[{"text":"I could be deported because my parents came here legally. Biden can change that.","label":-1},{"text":"First Latino tapped to head DHS signals shift from Trump's hard-line immigration policies","label":0},{"text":"Tony Pham, interim director of Immigration and Customs Enforcement, to step down","label":0},{"text":"More than two-thirds of undocumented immigrant workers have jobs \"essential\" to Covid fight, says study","label":0},{"text":"Biden to meet with struggling workers, small-business owners about the economic crisis - NBC News","label":-1},{"text":"Accused hate groups receive pandemic aid","label":-1},{"text":"Lawyers say Trump admin has handed over data that will help reunite separated migrant families","label":1},{"text":"28 migrant children and their parents face deportation after refusing to be separated","label":-1},{"text":"Visa delays leave thousands of South Asian women unable to work","label":-1},{"text":"Advocates, mental health experts pressure Biden to commit to reuniting separated families in the U.S.","label":0},{"text":"U.K.'s first non-white leader? Finance minister Sunak wins praise for staying calm in a crisis","label":1},{"text":"12 great Latino books of 2020","label":1},{"text":"Feinstein says she's stepping down as top Democrat on Senate Judiciary Committee","label":0},{"text":"Judge throws out Trump rules limiting skilled-worker visas","label":0},{"text":"San Francisco officer who seriously injured suspect indicted","label":-1},{"text":"Latino Catholics commemorate Virgen de Guadalupe through virtual events, amid Covid","label":0},{"text":"In Covid-19 regulations case, Sotomayor dissent claps back at Supreme Court majority","label":-1},{"text":"Pope installs new cardinals, including first African-American","label":0},{"text":"Why Trump's immigration legacy could take time to undo","label":0},{"text":"Trump administration settles lawsuit from U.S. Latinas detained after speaking Spanish","label":1},{"text":"From Covid-19 to racial justice, how 2020's biggest issues influenced the Black vote","label":0},{"text":"Almost a year after the pandemic began, 35,000 Australians remain stranded abroad","label":-1},{"text":"The democracy hangs on — by just enough","label":0},{"text":"Mexico's president one of last world leaders to formally congratulate Biden","label":1},{"text":"Lawmakers demand Biden include Asian Americans, Pacific Islanders in Cabinet","label":-1},{"text":"Biden looks to Susan Rice to elevate low-profile Domestic Policy Council","label":0},{"text":"Trump's tortured census power grab seems destined to fail. The question is: When?","label":-1},{"text":"Covid job losses are devastating these workers, who are largely unseen","label":-1},{"text":"Federal judge reinstates DACA, orders Homeland Security to quickly accept new applicants","label":0},{"text":"Did Trump draw out a new Latino Republican voter bloc in Florida?","label":0},{"text":"Who will replace Kamala Harris in the U.S. Senate? California governor weighs a shortlist of firsts","label":0},{"text":"How Dems are engaging these 1st-time voters who helped flip GOP district","label":1},{"text":"How the pandemic threatens to destroy America's three remaining Japantowns","label":-1},{"text":"'No choice except to flee': After back-to-back hurricanes, Central Americans go north","label":-1},{"text":"Member of Hungary's anti-LGBTQ government resigns after fleeing alleged sex party","label":-1},{"text":"Dozens rescued in smuggling operation, Houston police say","label":-1},{"text":"Driver arrested after plowing into New York City protesters, injuring 6","label":-1},{"text":"Bypassing McConnell: Democrats push Biden to aggressively use executive power","label":-1},{"text":"Supreme Court puts off ruling on Trump census case to exclude undocumented immigrants","label":0},{"text":"Bipartisan group of senators seek compromise on a Covid-19 relief package","label":0},{"text":"Biden meets, outpaces Trump and Obama's Cabinet nomination timelines","label":0},{"text":"Iowa congressional race likely to be one of closest in modern history","label":0},{"text":"Supreme Court skeptical of Trump's plan to exclude undocumented immigrants from census","label":0},{"text":"Supreme Court set to hear arguments on Trump plan to exclude undocumented immigrants from census","label":0},{"text":"Modeling agent Jean Luc Brunel arrested in Paris in Epstein probe","label":-1},{"text":"Trump's false fraud claims are laying groundwork for new voting restrictions, experts warn","label":-1},{"text":"Mental health care has become even more crucial in 2020 — but resources are stretched thin","label":0},{"text":"Trump is trying to overturn an election but we didn't get here by accident","label":0},{"text":"Despite pandemic, a pop-up school for U.S. asylum seekers is seeing success","label":1},{"text":"Latino mistrust of Covid vaccine worries Hispanic doctors","label":-1},{"text":"Biden administration on track to be most LGBTQ-inclusive in U.S. history","label":0},{"text":"Some Senate Democrats question Durbin's bid to helm Judiciary Committee","label":0},{"text":"Top Georgia Republican officials buck Trump's call to push legislators to overturn Biden victory","label":1},{"text":"'A huge catastrophe': Democrats grapple with congressional and state election losses","label":-1},{"text":"Calls, caravans, cartoons: Groups target Georgia Latinos ahead of Senate runoffs","label":0},{"text":"Judi Ketteler: Trump, Covid-19 and racism taught me to stop being nice and embrace my rage","label":-1},{"text":"Paper beats app: Vaccine verification will likely be proven offline. Here's why.","label":0},{"text":"Perdue, Ossoff race slated to be most expensive Senate race in ad spending","label":0},{"text":"New campaign filings show Trump's fundraising haul off claims of voter fraud","label":-1},{"text":"Acclaimed journalist Maria Hinojosa laid it all out in her memoir—and it's resonating.","label":1},{"text":"Now that we have a Covid vaccine, we can't let immigration politics trump public health","label":0},{"text":"Clyburn to lead Biden inaugural committee alongside new co-chairs","label":0},{"text":"TSA screens highest number of travelers since March","label":0},{"text":"Congress returns to face funding deadline, pressure on coronavirus aid","label":-1},{"text":"England's Covid-19 infections down 30 percent during national lockdown, study shows","label":0},{"text":"Cash-strapped ambulance services to receive federal aid","label":-1},{"text":"Outbreak sickens staffers at county health department in Arizona","label":-1},{"text":"Interior Secretary Bernhardt tests positive","label":0},{"text":"Pence to publicly receive Covid vaccine on Friday, Biden as soon as next week","label":0},{"text":"Pope Francis laments 'unprecedented educational crisis' caused by Covid","label":-1},{"text":"Los Angeles County reports staggering 21,000 new cases","label":-1},{"text":"First severe reaction to vaccine reported in U.S.","label":-1},{"text":"U.S. sees deadliest day of pandemic yet with nearly 3,300 deaths","label":-1},{"text":"Study: 69% of undocumented immigrant workers 'essential' to fighting virus","label":0},{"text":"Health experts warn of potential Covid-19 vaccine scam phone calls","label":-1},{"text":"Tyson fires 7 managers at Iowa plant after virus betting investigation","label":0},{"text":"St. Louis doctor says hospitals out of capacity or are at capacity","label":0},{"text":"Biden distances himself from Obama amid 'third term' comparisons - Fox News","label":0},{"text":"Biden says he'll push 'pathway to citizenship for over 11 million undocumented people' in first 100 days - Fox News","label":0},{"text":"Sen. Cotton says Biden’s Cabinet picks signal return of Obama's ‘disastrous’ foreign policy - Fox News","label":-1},{"text":"BLM raising $500K to back Ossoff, Warnock in Georgia Senate race - Fox News","label":0},{"text":"James Carafano: If Biden pursues open-border policy it will pose grave public health risk during pandemic","label":-1},{"text":"Flashback: Biden praised ‘constant,' 'unrelenting’ stream of immigration into US","label":-1},{"text":"LIVE UPDATES: Georgia Democrat Ossoff says ICE should enforce workplace protections for illegal immigrants","label":-1},{"text":"New York Gov. Cuomo signs Protect Our Courts Act prohibiting ICE from making arrests in state courthouses","label":-1},{"text":"ICE chief Tony Pham to resign by end of year, sources say","label":-1},{"text":"Trump officials warn of new border surge if Biden reverses immigration policies","label":-1},{"text":"San Jose mayor, police chief urge county to change sanctuary city policy","label":0},{"text":"Rep.-elect Tony Gonzales helps GOP hold Texas border district: 'My story is the American dream'","label":1},{"text":"Ossoff says ICE should make sure illegal immigrants are paid minimum wage","label":-1},{"text":"Deportation of ex-Nazi prison guard living in Tennessee upheld, court rules","label":-1},{"text":"ICE deports Russian national convicted in wire fraud scheme on attempted murder charge","label":-1},{"text":"Ali Noorani: Restoration of DACA benefits US and Dreamers — now we need immigration law reform","label":1},{"text":"ICE operation nabs more than 150 people in illegal immigration sting","label":-1},{"text":"Houston Police Chief Art Acevedo: Alejandro Mayorkas is good choice by Biden to head Homeland Security","label":1},{"text":"Illegal immigrants freed from detention after court order have been re-arrested for sex, drug crimes: ICE","label":-1},{"text":"This Day in History: Nov. 30","label":0},{"text":"California officials defy ICE detainer, release convicted child murderer","label":-1},{"text":"Tom Homan: Biden's border crisis is already brewing and it will accelerate COVID spread in the US","label":-1},{"text":"Honduran migrant caravan heading to US: reports","label":0},{"text":"ICE removes twice-deported Mexican national convicted in Washington of luring disabled child","label":-1},{"text":"As border numbers increase, CBP chief says US faces 'full-blown crisis' if Trump-era policies end","label":-1},{"text":"Ali Noorani: Immigrants made America great — time to end four years of demonizing and denouncing them","label":1},{"text":"California church stabbing suspect had been deported three times, officials say","label":-1},{"text":"Live Updates: BLM looks to raise $500G to back Dem Senate candidates in Georgia runoffs","label":0},{"text":"Imprisoned hacker ordered to be released, promptly deported","label":-1},{"text":"Hans von Spakovsky: Attorney General William Barr steps down with outstanding record of accomplishments","label":1},{"text":"Boston Celtics star Tristan Thompson becomes US citizen","label":1},{"text":"David Limbaugh: After years of attacking Trump and his supporters, Democrats now ask for unity","label":-1},{"text":"Border agents, ICE seize more than 100,000 counterfeit N95 masks in Texas warehouse","label":-1},{"text":"Houston police rescue dozens from house allegedly involved in human trafficking operation","label":1},{"text":"Doug Schoen: Biden will face grave challenges as president — here are a few and what to expect","label":-1},{"text":"Fox News Poll: Voters give President Trump mixed reviews after 4 years","label":0},{"text":"Biden DHS pick Mayorkas intervened to help Democrat-connected foreign investors: IG","label":1},{"text":"Biden should pull off executive order 'blitz' before people can react, leftists say","label":-1},{"text":"Georgia Lt. Gov. Geoff Duncan decries election 'misinformation' coming 'from every single angle'","label":0},{"text":"GOP Congresswoman-elect on forming ‘Freedom Force’: Left is ‘totally out of line’ with mainstream","label":-1},{"text":"6 injured by car during NYC protest, officials say","label":-1},{"text":"Linda Sarsour, too radical for Joe Biden, to campaign for Ossoff and Warnock in Georgia Senate race","label":0},{"text":"Biden declines to say where he stands on BLM-backed BREATHE Act","label":0},{"text":"Teen Vogue columnist rejects Biden's call for 'unity'","label":1},{"text":"Biden DHS pick had 'inappropriate' involvement in drug trafficker's commutation: Investigation","label":1},{"text":"Punishing hurricanes to spur more Central American migration","label":1},{"text":"Ingraham: Biden's 'team of false prophets' will deliver 'ruin instead of results'","label":1},{"text":"Black Lives Matter co-founder fires back at Obama for criticizing ‘defund the police’","label":1},{"text":"Retired Catholic archbishop says Biden should be denied Holy Communion over abortion stance","label":-1},{"text":"State Department restricts visas for Chinese Communist Party members, prompting retaliation","label":-1},{"text":"Cuomo warns that Trump vaccination plans fail minorities, undocumented immigrants","label":-1},{"text":"Virginia to grant ‘driver privilege cards’ to illegal immigrants","label":1},{"text":"Laura Ingraham: Biden more afraid of upsetting far left than alienating Trump supporters","label":-1},{"text":"Breonna Taylor's mother pens letter to Biden in full-page Washington Post ad","label":0},{"text":"Tucker Carlson: Joe Biden and his gun-grabbing, open-borders, soft-on-China advisers","label":-1},{"text":"BLM pressures Democrats to embrace bill described as 'roadmap for prison abolition'","label":-1},{"text":"Feinstein won't seek top Judiciary Committee spot after complaints from progressives","label":-1},{"text":"Biden chooses an all-female senior White House press team","label":0},{"text":"French protesters decry bill outlawing use of police images","label":-1},{"text":"Media praise Xavier Becerra, a partisan warrior who constantly sued Trump","label":1},{"text":"Biden HHS pick Becerra 'looks forward' to working 'in good faith' with Republicans, Democrats if confirmed","label":1},{"text":"Attorney General William Barr announces resignation","label":0},{"text":"Biden announces additions to White House communications team, includes former campaign staffers","label":0},{"text":"Victor Davis Hanson: Trump's options – election decision, his political future come down to these hard choices","label":-1},{"text":"Some Catholics sounding alarm about Biden administration, conflicts with moral teachings","label":-1},{"text":"Michelle Fischbach, new Minnesota congresswoman, awaiting concession call from 30-year Democrat she beat","label":0},{"text":"Socialist Democrats pick up House seats, tout successes despite pushback within party","label":-1},{"text":"Joe Manchin says 'Squad' could hamper $908B coronavirus relief","label":-1},{"text":"Liz Peek: Liberal lies have created this moment – Trump can do this to secure his legacy","label":-1},{"text":"Biden's HHS pick Becerra sued the Trump admin more than 100 times as California AG: Here are some of his cases","label":0},{"text":"Kansas Rep.-elect Tracey Mann says US must hold China, others to trade deals for good of farmers","label":0},{"text":"Bernie Sanders: 'Enormously insulting' if Biden ignores progressives in his administration","label":-1},{"text":"Biden picks Blinken, Mayorkas, Sullivan for key Cabinet positions","label":0},{"text":"Bobby Jindal & Wes Anderson: Hispanic support for Republicans growing as Democrats move leftward","label":1},{"text":"Liz Peek: Trump’s four years – productive, contentious, energetic and … fun. Let's review","label":1},{"text":"Jonathan Turley: Is Biden about to make the case for a Trump self-pardon? A Yates nomination could do it","label":0},{"text":"Supreme Court blocks Cuomo's limits on houses of worship","label":0},{"text":"Will the Biden campaign take legal action to force transition process?","label":-1},{"text":"Charles Koch: 'Horrified' When Donations Didn't Buy Politicians' Votes","label":-1},{"text":"California Court Order Frees 250 Criminal Illegal Aliens into U.S.","label":-1},{"text":"Feds: Plants that Hired Illegal Aliens Paid Unlawful Wages, Hired a Child","label":-1},{"text":"Lobbies: GOP S.386 Bill Will Trigger 2021 Push to Expand Immigration","label":0},{"text":"Traffic Stop Leads to Bust of California Human Smuggling Stash House near Border","label":-1},{"text":"CBP Commissioner: Joe Biden’s Border Policy Signals Open Borders to Migrants, Drug Cartels, Traffickers","label":-1},{"text":"Rashida Tlaib: 'Allah' Has Given Opportunity to Show 'Power of Muslims in Georgia'","label":1},{"text":"Human Rights Law Used to Prevent Deportation of Turkish Drug Lord From the UK","label":-1},{"text":"'Activist Lawyers' Block Deportation of 23 Illegal Migrants With Last Minute Legal Challenge","label":-1},{"text":"Georgia Sheriff: Jon Ossoff’s Immigration Policies Could Get Georgians ‘Killed’","label":-1},{"text":"Philippines’ Duterte Eager to Work with Vatican on Immigration, Climate","label":1},{"text":"Six Republicans to Explore ‘Immigration Reform’ with Amnesty Advocates","label":0},{"text":"Ocasio-Cortez Mimics George W. Bush’s Immigration Plan","label":0},{"text":"Billionaire Koch Urges GOP, Democrats to Pass Amnesty, Increase Immigration","label":1},{"text":"Immigration Activists Object to Changes in Citizenship Test: Easier Quiz Helps Grow U.S. Immigrant Population","label":-1},{"text":"House Democrats, GOP Advance Hong Kong-to-U.S. Mass Immigration Pipeline","label":-1},{"text":"NY Times: Democrats ‘Counting on Demographic Changes’ to Turn Georgia Blue via Mass Immigration","label":-1},{"text":"Never Trump Bill Kristol Offers to Help Joe Biden Win Amnesty","label":1},{"text":"Justice Department Debunks Silicon Valley’s ‘Worker Shortage’ Claim","label":-1},{"text":"Report: Joe Biden May Appoint Official to Undo Trump’s Immigration Reforms","label":0},{"text":"Border Patrol Agents Find Migrants Locked in Furniture, Appliances at Texas Checkpoint","label":0},{"text":"WATCH: Multiple Arrests After Antifa Vandalizes Portland ICE Facility — Again","label":-1},{"text":"ICE Seizes $32 Million in Fake ‘Viagra Pills,’ ‘Car Emblems,’ Other Goods Arriving from China","label":-1},{"text":"Democrats Relying on Results of Mass Immigration to Flip Georgia Blue","label":0},{"text":"Soros-Funded Los Angeles District Attorney to Help Criminal Illegal Aliens Avoid Deportation","label":-1},{"text":"Alyssa Milano’s Immigration Themed Netflix Christmas Movie Calls U.S.-Mexico Border an ‘Imaginary Line’","label":0},{"text":"Dale Wilcox: Biden’s Immigration Agenda Could Change America as We Know It","label":0},{"text":"Kamala Harris Vows Amnesty in First 100 Days, Restarting Immigration from Exporters of Terrorism","label":-1},{"text":"Watch–Joe Biden: Amnesty for Over 11 Million Illegal Aliens Going to Senate in My First 100 Days","label":-1},{"text":"Chuck Schumer: Biden’s DHS Chief Will Help Pass Amnesty for Illegal Aliens","label":-1},{"text":"House Democrats Begin Drafting Amnesty Plan to Send to Joe Biden","label":0},{"text":"Republican Sens. John Cornyn, Susan Collins: Start New Year with DACA Amnesty","label":0},{"text":"Chuck Schumer: ‘We’re Nothing If We’re Not a Nation of Immigrants’","label":0},{"text":"Jim Banks: Republicans Must Appeal to Working Class to Win Future Elections","label":1},{"text":"BOJO’s Post-Brexit Mass Migration Plan Is a ‘Total Surrender’, Says Think Tank","label":-1},{"text":"House Democrats Plot Resolution to Keep Criminal Illegal Aliens in U.S.","label":-1},{"text":"House to Push Mike Lee’s S.386 Bill, Create Class of ‘Half Immigrants’","label":-1},{"text":"Customs and Border Chief: Joe Biden Sending Open Borders Message to World’s Migrants","label":0},{"text":"Democrats’ Marijuana Amnesty Helps Illegal Migrants","label":-1},{"text":"Illegal Alien Charged with 19 Counts of Child Sexual Assault in North Carolina","label":-1},{"text":"House, Senate Bills Prioritize Foreign Nationals as 24.5M Americans Remain Jobless, Underemployed","label":-1},{"text":"Joe Biden’s Allies Warn of Blue-Collar Migrant Invasion","label":-1},{"text":"Mike Lee’s S.386 Giveaway Bill Exposes India vs. Asia Fights","label":-1},{"text":"Joe Biden Picks Pro-Migration Swamper for Top DHS Slot","label":-1},{"text":"Barack Obama: ‘Evangelical Hispanics’ Overlooked Trump Saying ‘Racist Things About Mexicans’","label":-1},{"text":"Mexico Deports U.S. Citizen Accused of Stalking TV Anchor","label":-1},{"text":"Joe Biden’s DHS Pick Promises Wage Raises from Amnesty, Migration","label":1},{"text":"Watch: Illegal Alien Arrested for Breaking into Woman’s Home as She Films TikTok Video","label":-1},{"text":"Election Data: President Trump’s Anti-Globalism, Pro-Police Message Wins Over Hispanics","label":1},{"text":"Seven GOP Representatives Cheerlead Hong Kong Population Transfer Bill","label":1},{"text":"President Trump Tightens Border Rules to End Asylum Shopping, Reduce Fraud","label":1},{"text":"Shakedown: Boris Govt to Pay France £28m to Start Stopping More Boat Migrants","label":-1},{"text":"Open Borders Lobby Urges Joe Biden to Quickly Grant Executive Amnesty","label":1},{"text":"Democrat Zoe Lofgren Pushing Green Card Giveaway into Spending Bill","label":-1},{"text":"Joe Biden’s DHS Nominee Aided Jailed Drug Smuggler","label":-1},{"text":"CATO Shows Joe Biden How to Flood the Labor Market for Wall Street","label":0},{"text":"NYT: Joe Biden’s Border Promises Are Creating a Migrant Wave","label":-1},{"text":"Kobach: The Supreme Court Hearing on Excluding Illegal Aliens in Apportionment Made One Thing Clear—We Needed the Citizenship Question on the Census","label":0},{"text":"Canada to Invest $40m Into ‘Home Ownership Opportunities’ for Black People Only","label":0},{"text":"Exclusive: Georgia Sens. David Perdue, Kelly Loeffler Vow ‘Never’ to Support Amnesty for Illegal Aliens","label":-1},{"text":"Four Deported Sex Offenders Arrested for Illegally Crossing Border into Texas","label":-1},{"text":"Report: Joe Biden’s DHS Pick Alejandro Mayorkas Ignored Asylum Fraud at Previous Post","label":-1},{"text":"Poll Shows Growing Democratic Opposition to Cheap Labor Migration","label":-1},{"text":"Democrat Jon Ossoff to Campaign with Pro-Amnesty, Sanctuary City Julian Castro","label":0},{"text":"Pro-Amnesty Business Groups Tout Mayorkas for DHS Job","label":-1},{"text":"Jon Ossoff Describes Latino Migrants as ‘Peasants’","label":-1},{"text":"EXCLUSIVE PHOTOS: Witchcraft Altar Found in Mexican Border State Stash House","label":-1},{"text":"‘Gang of Eight’ Amnesty Architect: Joe Biden Can Use COVID-19 to Give Amnesty to All Illegal Aliens","label":-1},{"text":"GOP Donors Lobby Senate Republicans to Support Joe Biden’s DHS Nominee","label":1},{"text":"Miami Herald: Republicans’ S.386 Bill Hurts Latino Legal Immigrants","label":-1},{"text":"Cruz Blocks Democrat-Backed Bill that Would Open Pipeline of Migrants from Hong Kong to U.S.","label":-1},{"text":"NYC Christmas Concert Shooter Was Immigrant Shielded from Deportation Despite Extensive Criminal Record","label":-1},{"text":"Survey: 72 Percent of GOP Voters Want Trump’s Economic Nationalism to Lead Republican Party","label":1},{"text":"Migration Lobby: Joe Biden Must ‘Revise’ Trump’s Extreme Vetting of Refugees","label":-1},{"text":"Illegal Alien Charged with Murdering Florida Woman on Thanksgiving","label":-1},{"text":"Photos: Obama Attacks Trump for Using Same ‘Cages’ at Border He Used","label":-1},{"text":"Over 2,000 'Child' Asylum Seekers in the UK Lied About Their Age to Cheat the System: Report","label":-1},{"text":"WSJ: Joe Biden’s Deputies Alarmed by Growing Tide of Migrants","label":-1},{"text":"Exclusive – David Perdue: Jon Ossoff, Democrats ‘Hiding Their True Platform’ on Defunding the Police, Amnesty","label":-1},{"text":"Japan to Launch A.I. ‘Marriage Hunting’ to Stop Birth Rate Collapse","label":0},{"text":"Over 8,000 Illegal Boat Migrants Land in the UK This Year, as 60 More Arrive at Dover","label":-1},{"text":"SCOTUS Throws Out Challenge to Trump’s Exclusion of Illegal Aliens from Congressional Apportionment","label":-1},{"text":"White House Source: Media’s Days of ‘Canceling Conservatives’ Are Over","label":0},{"text":"Vatican: Coronavirus Should Not Take Attention Away from Migrants","label":0},{"text":"Sanctuary California: Three-Time Deported Illegal Alien Charged with Double Murder in Stabbing Spree","label":-1},{"text":"Man Who Threatened Prime Minister and MPs over Fear Mother Would Fail Immigration Test Jailed","label":-1},{"text":"Tom Cotton: Biden DHS Nominee Mayorkas Disqualified to Lead Agency for Selling Green Cards to Chinese Nationals","label":-1},{"text":"Justice Sonia Sotomayor Uses Legal Term ‘Illegal Alien’ in SCOTUS Hearing","label":-1},{"text":"White House Unclear About Fate of Mike Lee’s Foreign Worker Bill","label":-1},{"text":"Black Lives Matters PAC to Raise $500K to Boost Democrats Raphael Warnock, Jon Ossoff","label":1},{"text":"Kenyan Charged with 9\/11-Style Terror Plot Sought Visa to U.S.","label":-1},{"text":"142 Pound of Meth, Heroin Found in Carrot Load at Texas Border Crossing","label":-1},{"text":"430 Pounds of Meth Seized at California Border Crossing","label":-1},{"text":"GOP, Democrats Allow Mike Lee’s Middle Class Replacement Bill to Pass Senate","label":0},{"text":"Kobach: Texas Case Challenges Election Directly at Supreme Court","label":0},{"text":"Kobach: Texas Holds the High Ground in Supreme Court Election Fight","label":1},{"text":"AOC Trashes Joe Biden’s ‘Corporate Revolving Door’ Team: ‘It’s Horrible’","label":-1},{"text":"Trump Puts Travel Restrictions in Place for Chinese Communist Party Members","label":1},{"text":"Apprehensions Jump 182 Percent in One Texas Border Sector","label":-1},{"text":"71 Migrants Found in Tractor-Trailer in Mexico Heading to Texas Border","label":0},{"text":"Italy's €1 houses are back in time for the holidays","label":1},{"text":"Australia vowed to never let these men settle on its soil. Some just got visas","label":-1},{"text":"Analysis: Building a Cabinet that looks like America is harder than it looks","label":0},{"text":"Biden administration prepares to inherit controversial Trump immigration policies","label":-1},{"text":"Charles Koch: One thing we should all agree on","label":1},{"text":"5 things to know for November 25: Covid-19, Biden, immigration, China, opioids","label":0},{"text":"5 things to know for December 8: Coronavirus, White House, immigration, Brexit, China","label":0},{"text":"What sort of immigration policies will Trump try to cram in? Families are anxious and looking to Biden","label":-1},{"text":"Mayorkas is a historic pick who may first have to confront his past at DHS","label":-1},{"text":"Mayorkas could bring stability to DHS after years of interim leadership","label":1},{"text":"Afghan major who helped save US pilot begs Pentagon to 'keep their word' to protect family","label":1},{"text":"Immigrant advocates urge Biden to quickly rectify the trauma of family separation","label":-1},{"text":"Trump's 2017 travel ban may be linked to preterm births in women from targeted countries, study says","label":-1},{"text":"Talks continue in Congress on government funding and Covid relief","label":0},{"text":"The latest on Biden's transition","label":0},{"text":"Sen. Dick Durbin: Republicans made this pillar of justice a shell of its former self","label":-1},{"text":"A short history of American food (whatever that is)","label":0},{"text":"Shut the door on Trump by ending the electoral college","label":-1},{"text":"Joe Biden and Kamala Harris, here's how you can rebuild the economy: Decriminalize sex work","label":0},{"text":"Contact tracing in immigrant communities is most effective with trusted voices from within","label":1},{"text":"Feinstein to step aside as top Democrat on Senate Judiciary Committee","label":0},{"text":"Biden says transition outreach from Trump administration has been 'sincere'","label":1},{"text":"US held dozens of children, including a 1-month-old, at border for several days in last 2 months","label":-1},{"text":"Biden team inherits Trump's ocean of troubles","label":-1},{"text":"The Herculean task facing President-elect Biden","label":-1},{"text":"Covid-19 and climate change make hurricanes more devastating for Latin America","label":-1},{"text":"This is who should get Kamala Harris's Senate seat","label":0},{"text":"Hispanic caucus expresses frustration to Biden team with how Michelle Lujan Grisham has been treated","label":-1},{"text":"Why more Republicans should follow Rep. Mitchell's lead","label":0},{"text":"It's time to end the nation's failed war on marijuana","label":-1},{"text":"Expect big things from Kamala Harris","label":1},{"text":"What Biden's top economic priority must be","label":1},{"text":"Biden's chief foreign policy appointment: his running mate","label":0},{"text":"What you need to know about Biden's nominees","label":0},{"text":"Here's who Trump has granted pardons and commutations to during his presidency","label":1},{"text":"Some Black and Latino Americans are still hesitant to take the vaccine. Here's what is fueling that distrust","label":-1},{"text":"What Obama gets wrong on 'defund the police'","label":-1},{"text":"What you need to know about coronavirus on Friday, December 11","label":0},{"text":"Democrats' push to investigate Trump won't stop when he leaves office","label":0},{"text":"How UK protesters are taking the spark of Black Lives Matter back to their hometowns","label":1},{"text":"The year of reckoning: How 2020 revealed the fault lines in American policing","label":-1},{"text":"Trump administration pushes 'midnight regulations' after breaking records for final-year rulemaking","label":-1},{"text":"Biden's transition formally begins","label":0},{"text":"Joe Biden announces top foreign policy and national security picks","label":1},{"text":"5 things to know for December 11: Pandemic, transition, government hack, El Salvador, Hungary","label":0},{"text":"Trump administration awarded millions to companies with checkered records to care for migrant children","label":-1},{"text":"Biden readies major stimulus push and flurry of executive actions in first 100 days","label":0},{"text":"Trump still has power to make policy. Watch what he does","label":0},{"text":"Biden's desire to stop the border wall could be costly and arduous","label":-1},{"text":"Biden faces increasing pressure to diversify his Cabinet","label":-1},{"text":"The seven most important relationships Biden will have on Capitol Hill","label":1},{"text":"As the pandemic rages, Hungary ramps up anti-LGBTQ legislation","label":-1},{"text":"Paris police officers suspended over beating of Black man","label":-1},{"text":"'Greenland' star Morena Baccarin: Hope 'is something people need right now'","label":1},{"text":"Arizona migrant border deaths highest in 10 years amid record heat","label":-1},{"text":"Top cartel leader, 2 other members arrested in connection to Mormon massacre","label":-1},{"text":"Trump says election fight still has 'a long way to go'","label":-1},{"text":"Biden's Health and Human Services pick has no public health experience","label":-1},{"text":"EU Wants Member-States to Keep Ethnic Stats for Its 'Integration and Inclusion' Plan","label":0},{"text":"EU Demands Italy Pay for Migrant Dependents Living Outside EU","label":-1},{"text":"18 Migrants Rescued from Frigid Rio Grande Border River","label":1},{"text":"November Migrant Apprehensions Fall Slightly amid 7-Year High","label":-1},{"text":"'What About My Daughter?' 1,000 pop. English Village Braces for 500-Man Migrant Camp","label":-1},{"text":"Three-Year-Old Girl Found Raped at Greek Island Migrant Camp","label":-1},{"text":"Balding Migrant School Pupil Who Looked 40 Disappears from UK School","label":-1},{"text":"156 Migrants Apprehended in Smuggling Attempts near Border in Texas","label":-1},{"text":"Greek Police Arrest Three Pakistanis for Holding People Hostage for Ransom","label":-1},{"text":"Migrants Jailed for Posing as NHS Workers to Rob 83-year-old Widow at Home","label":-1},{"text":"Vatican: Jesus, Mary, and Joseph Were Immigrants","label":0},{"text":"Swedish Politician: Only 68 of 7,000 ‘High School Amnesty’ Migrants Have Jobs","label":0},{"text":"Canary Islands See Possible Record 8,000 Migrants in Single Month","label":0},{"text":"Nigel Farage Saves Two Migrants from Drowning in English Channel","label":1},{"text":"Traffickers Offering £300 Cut-Rate Christmas Prices for Illegal Migrants to Cross Channel","label":-1},{"text":"Italian Police Break Up Migrant Smuggling Ring, Arrest 19","label":-1},{"text":"Three Human Stash Houses Raided in Texas Border City","label":-1},{"text":"Farage: Turn Back Migrant Boats Like Australia or More People Will Die","label":-1},{"text":"Migrant Who Tried to Set Bus Full of Children on Fire Expressed Hatred of Italians in Revealed Video","label":-1},{"text":"October Migrant Arrest Rate at Border Up 87 Percent","label":-1},{"text":"Paris: 71 Per cent of African Migrants’ Children Want to Move to Parents’ Homeland","label":1},{"text":"Spain Deploys Police to West Africa as Canary Islands Migrant Influx Increases by 1,000 Per Cent","label":-1},{"text":"Danish Minister Defends Ethnic Stats on Crime and Employment","label":-1},{"text":"100 Migrants Arrested in Three Human Smuggling Efforts in Texas near Border","label":-1},{"text":"Almost Half of Violent Sex Crimes in Italy Committed By Foreigners","label":-1},{"text":"Watch: Smuggler Rams U.S. Border Checkpoint During Escape to Mexico","label":-1},{"text":"Judge Orders DACA Amnesty Restored to 2012 Rules","label":1},{"text":"Boris Govt Assures UN of Its ‘Commitment to the Global Compact on Migration’","label":1},{"text":"Guatemalan Allegedly Assaults Border Patrol Agent in West Texas","label":-1},{"text":"Trinidad and Tobago Expels 16 Venezuelan Children Fleeing Socialism Back to Sea","label":-1},{"text":"Greek Police Hunt for Migrant ‘Chain Rapist’ After Attack on 54-year-old","label":-1},{"text":"Pakistani Migrant Accused of Drugging and Raping Minors","label":-1},{"text":"Report: Blue-state Migration Could Have Flipped Arizona","label":0},{"text":"Quarter of Finland’s Coronavirus Cases Involve Foreign Language Speakers","label":0},{"text":"United Nations Tells European Union to Give Vaccines to Migrants","label":0},{"text":"Another 111 Boat Migrants Land in Britain Despite 28 Million Deal With France","label":0},{"text":"Calais: Govt Offering Migrants Nearly 2,000 to Go Back to Home Countries","label":0},{"text":"Major Channel Migrant Human Trafficking Network Busted in France","label":0},{"text":"Farage Criticises 'Dangerous' Govt Open Migrant Camps After Several Illegals Abscond","label":-1},{"text":"Syrian Found with Turkish-Made Guns at Greek Border","label":0},{"text":"UK to Ban Asylum Claims from Illegals Caught at Sea Leaving Safety of Europe","label":-1},{"text":"DHS Promises 450 Miles of Border Wall by 2021","label":1},{"text":"Swedish Stats Agency to Investigate Link Between Migration and Rising Youth Robberies","label":-1},{"text":"NATO Head Wants ‘Positive Approach’ to ‘Western’ Turkey Despite Aggression Against Greece, Cyprus","label":0},{"text":"Afghan Migrant Flees Germany After Allegedly Murdering Wife","label":-1},{"text":"Watch: Fierce Cartel Gun Battle Rocks Mexican Border City near Texas","label":-1},{"text":"Turin Cathedral Criticized For Putting Face Masks on Nativity","label":-1},{"text":"Woman Badly Beaten By Masked Men in Swedish No-Go Zone","label":-1},{"text":"Hungarians on ‘Soros Puppet’ George Clooney: ‘Imbecile’ Who Couldn’t Find Their Country on Map","label":-1},{"text":"Pope Francis: 2020 Looked Bad Even Before the Coronavirus Outbreak","label":-1},{"text":"14 Venezuelans Drown Trying to Escape Socialism on Raft","label":-1},{"text":"Irish Govt Wants to Criminalise Sharing, Retweeting 'Hate' Posts","label":-1},{"text":"Swedish Politicians Speak of Poland and Hungary Leaving EU After Budget Veto","label":0},{"text":"CEOs Balloon Captive ‘Green Card Workforce’ in U.S. Jobs","label":-1},{"text":"Caruzo: How Maduro Uses Passport Regulations to Ruin People’s Lives","label":-1},{"text":"Turkish President Says Turkey 'Part of Europe', Wants 'Full Membership' of EU","label":0},{"text":"UK Clinics Offering ‘Virginity Tests’ and ‘Virginity Repair’ Exposed","label":-1},{"text":"New York Times: Democrats Suffered ‘Crushing Losses’","label":-1},{"text":"Joe Biden’s DNI Pick Argued Refusal to Admit Refugees Posed National Security Risk","label":-1},{"text":"Woke CA: ‘Racism’ Reason ‘Essential’ Illegal Workers May Not Get Vaccine Before General Public","label":-1},{"text":"Pope Francis: 2020 Saw a ‘Surge’ in Nationalism, Racism, Xenophobia","label":-1},{"text":"Greek Police Find Alleged Islamic State Jihadist in Migrant Camp","label":0},{"text":"Foreign Refugee Managers: Keep Americans in the Dark","label":-1},{"text":"700 Violent Gang Members Arrested in Central America by Joint U.S.-Local Operation","label":-1},{"text":"People over 45 are at greater risk of STIs, new study finds","label":-1},{"text":"For Biden, a key challenge in Central America","label":0},{"text":"'Immunity passports' are already here. But they come with warnings","label":-1},{"text":"Women fleeing Venezuela are being targeted for abuse amid pandemic border closures","label":-1},{"text":"Lockdowns have stopped people moving. And fugitives are running out of hiding places","label":-1},{"text":"The European leader who created a template for Trump's 2024 plans","label":0},{"text":"Joe Biden faces a key decision on Venezuela","label":0},{"text":"Why I am trying to put the brakes on Trump's pardon powers","label":1},{"text":"Ethiopian prime minister praises troops for victory but Tigrayans say fight is still on","label":-1},{"text":"Democrat Joaquin Castro seeks larger role in Congress as House Foreign Affairs chair","label":0},{"text":"'Your kind is not welcome': Homophobic confrontation sparks debate in Wyoming","label":-1},{"text":"Biden NSA pick warns against 'war crimes' in Ethiopia in first foray in new job","label":-1},{"text":"Ethiopian PM rejects Tigray conflict talks in African Union meeting","label":-1},{"text":"Ethiopia's prime minister urges world leaders to avoid ‘interference’ in Tigray conflict","label":-1},{"text":"Ethiopian army ordered to march on Tigray capital: prime minister","label":0},{"text":"Ethiopia declares victory as military takes Tigray capital","label":0},{"text":"Biden secretary of state pick Blinken admitted Obama administration 'failed' in Syria","label":-1},{"text":"600 bodies found in Tigray town after clash with Ethiopian troops: report","label":-1},{"text":"With Ethiopia on brink of escalation, diplomacy in doubt","label":-1},{"text":"Angelina Jolie sends message to women fearing abuse during holidays","label":-1},{"text":"This Day in History: Dec. 1","label":0},{"text":"Michigan rep introduces bill to end civil asset forfeiture","label":1},{"text":"Ethiopian armed forces launch assault on rebel region, officials say","label":-1},{"text":"Biden Defense Secretary pick at helm when team accused of ‘watering down’ ISIS intel","label":-1},{"text":"Cotton: 'Dangerous' for Joe Biden to rejoin Iran nuclear deal","label":-1},{"text":"U.N.: Jihadis Displace Nearly Half a Million in Mozambique","label":-1},{"text":"Islamic State Refugees Regret Returning Home to Destroyed Iraqi Village","label":-1},{"text":"Socialism: Maduro Marks Birthday with Giant Venezuelan Flag Cake as His People Starve","label":-1},{"text":"Atheists Attack Trump’s Religious Exemptions for Federal Contractors","label":-1},{"text":"Pope Francis Pushes Help for Middle Eastern Christians to Return Home","label":1},{"text":"Joe Biden Rushes to Embrace U.N. and Burnish Globalist Ambitions","label":1},{"text":"Democrat Raphael Warnock in 2016: Fidel Castro Had a ‘Complex’ Legacy","label":0},{"text":"Priest and Rabbi File SCOTUS Appeal Challenging Gov. Phil Murphy over Worship Restrictions","label":-1},{"text":"Hundreds of Chinese, Once Attracted by Belt and Road Deals, Flee Ethiopian Civil War","label":-1},{"text":"Report: U.N. Climate Projects Swamped with Fraud, Corruption Allegations","label":-1},{"text":"Trump: U.S. Should Recognize Moroccan Claims over Western Sahara After Israel Accord","label":0},{"text":"EXCLUSIVE – Incoming GOP Rep. Nicole Malliotakis: Anti-Socialist Freshman Class Here to ‘Preserve America’","label":1},{"text":"Report: North Korean Gymnast Escaped Country by Leaping over 10-Foot Fence","label":0},{"text":"Exclusive: Leftist in U.S. Threatens to Kill Cuban Exile Leader on Monetized YouTube Video","label":-1},{"text":"Virgil: If You Liked the ‘New World Order,’ You’ll Love ‘The Great Reset’","label":1},{"text":"Pentagon official who spread conspiracies, disparaged immigrants and refugees gets spot on influential West Point advisory board","label":-1},{"text":"Tigray forces battling Ethiopian government vow to fight on despite ultimatum to surrender","label":-1},{"text":"These refugees fled a massacre in Ethiopia. They join tens of thousands making the journey to Sudan","label":-1},{"text":"Over two million children in Ethiopia's Tigray region cut off from humanitarian aid","label":-1},{"text":"The heart-wrenching hand dealt to Hong Kong's democracy activists","label":-1},{"text":"5 things to know for November 23: Coronavirus, election, economy, Venezuela, Ethiopia","label":0},{"text":"Ethiopia enters 'final phase' of operation in Tigray region, says Prime Minister","label":0},{"text":"The reason we know it's about to get better","label":1},{"text":"Biden picks loyal lieutenant to lead mission to restore US reputation on world stage","label":1},{"text":"How Democrats can win back the Cuban-American vote","label":1},{"text":"Trump's outcasts in the civil and foreign service may get a second chance under Biden","label":1},{"text":"Love, death and pie: My last moments with my wife","label":1},{"text":"This student just became the first Latino DACA recipient to win the Rhodes Scholarship. He says it's all because of his elementary school teacher","label":1},{"text":"Trump's loss dealt a blow to global populism. But the movement is still alive and kicking","label":1},{"text":"Appeals court OKs Trump plan to end protected immigration status for 4 countries","label":0},{"text":"California schools launch anti-racism plan, flouting Trump's threats","label":-1},{"text":"De Blasio calls Trump's funding threat 'insulting,' but empty","label":-1},{"text":"How the left killed another major NYC development","label":-1},{"text":"‘This is f—ing crazy’: Florida Latinos swamped by wild conspiracy theories","label":-1},{"text":"The Surprising Conservatism of Ruth Bader Ginsburg","label":1},{"text":"POLITICO Playbook: Trump on alleged police shooters: ‘Animals that must be hit hard!’","label":-1},{"text":"POLITICO Playbook: Another big scoop from Dan Diamond","label":1},{"text":"‘All Paths to 270 Lead Through the Latino Electorate’","label":0},{"text":"Republicans line up behind swift SCOTUS vote","label":1},{"text":"All eyes on Mitt","label":0},{"text":"PhRMA doesn’t back Trump’s drug-discount plan","label":0},{"text":"OSHA fines meatpacking plants almost $30K after Covid-19 deaths","label":-1},{"text":"NEWSOM’s rough road — UC faulted for ‘inappropriate’ admissions — FORD doubles down on CA standards — Department of Labor moves on GIG WORKERS","label":-1},{"text":"1,666 Sussex County primary ballots counted two months later","label":0},{"text":"RBG’s death rocks CA politics, KAMALA in spotlight — EDD reset — NEWSOM signs UNDOCUMENTED tax benefit — ROHRABACHER-ASSANGE offer corroborated","label":-1},{"text":"TRUMP, FIRST LADY test positive for COVID — BUDGET pain ahead as PELOSI signals no deal — CAGOP back to NO. 2 — WILSON backs TRUMP’s ‘good judgment’","label":-1},{"text":"LA COUNTY DEM GONZALEZ to lead BIDEN CAMPAIGN in CA — RENDON backs GASCÓN — MEGHAN MARKLE cold-calling for DEMS? — NEWSOM calls for overhaul of EDD system","label":-1},{"text":"The SCI on the SDA","label":0},{"text":"Not all reviews are 5 stars as indoor dining returns — BOE to resend 100K ballot packages — Court rejects rent regulation challenge","label":-1},{"text":"BAKER’s imprint on the JUDICIARY — JURY TRIALS to RESUME — Students waiting on LAPTOPS in BOSTON","label":0},{"text":"BATTLE brewing over state DEMOCRATIC PARTY — Baker: There’s hope for HALLOWEEN — ‘UNLAWFUL’ stop in West Roxbury","label":-1},{"text":"The MBTA is running out of CASH — BAKER could pick state’s entire HIGH COURT — CLARK seeks top HOUSE post","label":-1},{"text":"How #MAPOLI reacted to Trump-Biden DEBATE – BAKER’s new REOPENING rules – WARREN won’t meet with SCOTUS nominee","label":0},{"text":"Court blocks Trump census order on undocumented immigrants","label":-1},{"text":"High court loses leading advocate for equality, immigrants","label":-1},{"text":"Census Bureau says count will continue through end of October","label":0},{"text":"Trump says a Harris vice presidency is ’no way for a woman’ to become president","label":-1},{"text":"DeSantis loses court pick amid claims of 'racial tokenism'","label":-1},{"text":"Joseph Bruno, longtime anchor of Albany's 'three men in a room,' dies at 91","label":-1},{"text":"Illinois AG brings his South Side upbringing into criminal justice","label":0},{"text":"Trump basks in cheers of Minnesota rally, far from debate criticism","label":1},{"text":"Pete Wilson endorses Trump, says president has 'very good judgment'","label":1},{"text":"What STDs Can Tell Us About How To Fight Covid","label":0},{"text":"Pence plays Covid defense and other things to watch at the vice presidential debate","label":1},{"text":"Biden woos Puerto Ricans in Florida — and gives new hope to state Democrats","label":1},{"text":"‘It’s a big, big swing’: Trump loses ground with white voters","label":-1},{"text":"The Trump foreign policies Biden might keep","label":0},{"text":"House GOP super PAC begins $2M TV campaign against Ron Kind","label":1},{"text":"The One Vital Message Democrats Need to Win","label":1},{"text":"Trump’s War on The New York Times Hits the Classroom","label":-1},{"text":"‘A Brush with Catastrophe’: Inside the 2020 Census Meltdown","label":-1},{"text":"The Governor Who Holds Trump’s Fate in His Hands","label":0},{"text":"Call It What It Is: Propaganda","label":-1},{"text":"How ‘Generation Jones’ Shaped Kamala Harris","label":0},{"text":"Just How Conservative Is Amy Coney Barrett’s Record on Voting Rights?","label":0},{"text":"The Trump Taxes Story Exposes a Glaring Hole in Biden’s Criminal Justice Platform","label":-1},{"text":"‘The Most Important Woman Lawyer in the History of the Republic’","label":1},{"text":"POLITICO Playbook: President Trump and Melania have Covid-19. What now?","label":0},{"text":"POLITICO Playbook: ‘Going well, I think!’","label":1},{"text":"Pelosi says W.H. Covid offer stinks","label":-1},{"text":"Crossroads adds more Lott, Breaux clients","label":0},{"text":"How a nonprofit is preparing to derail a Green New Deal","label":-1},{"text":"RBG’s legacy","label":1},{"text":"Presidential debate: CHAOS in CLEVELAND — ICE to launch targeted arrest campaign in CA — Covid-19 effects: DISNEY to lay off 28K — SCHWARZENEGGER funds voter ‘super centers’ — NEWSOM’s deadline: Sign or veto","label":-1},{"text":"Barrett’s record on the court","label":0},{"text":"Russia is back, wilier than ever — and it’s not alone","label":-1},{"text":"New fines for mask violators on public transit — 9\/11 commemorations altered by pandemic — Business leaders press de Blasio on quality of life","label":-1},{"text":"2020 is the Year Trump Was Worried About","label":-1},{"text":"TRUMP’s silence on Western wildfires — Did Covid-19 reach LA first? — Hoover fellow, POTUS adviser SCOTT ATLAS under fire — HAIM SABAN’s $500K fundraiser for BIDEN — SF to reopen hair, nail salons, gym","label":-1},{"text":"TRUMP to meet privately with NEWSOM — LA County SHERIFF’S DEPUTIES ambushed — FIRES rage, 22 dead in CA — GYMS, salons open in SF today","label":-1},{"text":"VP DEBATE: Kamala comes out swinging — NEWSOM AIDE tests positive for COVID — ICE arrests 128 in sanctuary city raids — Anonymous ‘former staffer’ hits KATIE HILL on Twitter","label":-1},{"text":"TRUMP and BIDEN address climate change — CROWFOOT: ‘I wish science agreed’ with Trump — FACEBOOK announces climate science push — ANN GETTY dead at 79 — KAMALA HARRIS returns to CA","label":-1},{"text":"AFFIRMATIVE ACTION in trouble, SPLIT ROLL close — NEWSOM says CA won’t block Pac-12 — CCPOA pulls JONES-SAWYER hit — new SACRAMENTO INFLUENCE superteam","label":-1},{"text":"Here comes the millionaires tax","label":0},{"text":"NYC indoor dining to reopen — De Blasio gets backlash over homeless decision — Teachers test positive for Covid-19","label":-1},{"text":"Chief Justice GANTS dies at 65 — WU officially running for MAYOR — How MALDEN is helping MALDEN","label":1},{"text":"State could face $5 billion BUDGET HOLE — BOSTON delays SCHOOL opening — Tally of HIGH-RISK towns jumps","label":-1},{"text":"Why Trump resorted to torching the debate","label":-1},{"text":"‘He just lies’: Florida’s senior voters suddenly are in play - POLITICO","label":-1},{"text":"The surprise religious group that could decide Trump's fate","label":0},{"text":"Trump crams policy moves — real and imagined — into final weeks","label":-1},{"text":"ByteDance picks Oracle in high-profile bid for video app TikTok","label":0},{"text":"Rank-and-file union members snub Biden for Trump","label":-1},{"text":"Cruz, Cotton, Hawley headline Trump's additional 20 potential Supreme Court picks","label":1},{"text":"Trump at Minnesota rally: Biden will turn state into a 'refugee camp'","label":-1},{"text":"Court grapples with protections for journalists in Portland unrest","label":-1},{"text":"‘This means everything’: Trump finds new rallying cry with Ginsburg seat","label":1},{"text":"Biden leads among Arizona Latinos but Trump makes gains","label":1},{"text":"Climate clash hits 2020 race as California burns","label":-1},{"text":"Poll: Americans united on a slew of issues, despite contentious election season","label":1},{"text":"Trump’s team plots his departure — even if he won’t","label":-1},{"text":"'Help me': Graham begs for cash in tighter-than-expected race","label":-1},{"text":"North Carolina sex scandal rocks battle for Senate majority","label":-1},{"text":"Donald Trump is a better debater than you remember","label":1},{"text":"Susan Collins goes for the jugular with her career on the line - POLITICO","label":-1},{"text":"How Barbara Lagoa’s fight for Elian Gonzalez shaped her legal career","label":0},{"text":"Chamber of Commerce talks peace with Senate Dems as McConnell's majority teeters","label":1},{"text":"Tech braces for debate night - Politico","label":-1},{"text":"Does Trump Actually Want to Win This Election?","label":0},{"text":"The Suburbs Where Trump Is Still on Top","label":1},{"text":"The SCOTUS sprint begins","label":0},{"text":"Senate sidetracked by Covid-19 cases","label":0},{"text":"How K Street sees a Biden presidency","label":0},{"text":"Paid for by coronavirus loans: Rolls-Royces, Rolexes and rowhouses","label":0},{"text":"How Amy Coney Barrett Would Reshape the Court — And the Country","label":0},{"text":"Trump’s Covid diagnosis renews testing debate on Capitol Hill","label":0},{"text":"Even more borrowing in the budge","label":0},{"text":"Industry City fight — Rochester police commanders sought to hide Prude footage — Thousands struggle months after Covid infection","label":-1},{"text":"Maya Wiley launches mayoral campaign with digs at de Blasio — Jewish, Catholic groups sue over shutdowns — Mayors in quarantine","label":-1},{"text":"Neighborhood coronavirus clusters spotted — Industry City plan dies — RECORDS: Nursing homes violated infection standards","label":-1},{"text":"WARREN to stump for BIDEN — The case for keeping DAYLIGHT SAVINGS — Tech snafus hamper ONLINE LEARNING","label":-1},{"text":"‘The hits just keep coming’: Congress stumbles from crisis to crisis","label":-1},{"text":"Pope: Market capitalism has failed in pandemic, needs reform","label":-1},{"text":"7 reasons Gavin Newsom has the worst job in politics","label":-1},{"text":"Trump’s last rally: A catalog of worst pandemic practices","label":-1},{"text":"‘She’s telling us how to run our country’: Trump again goes after Ilhan Omar’s Somali roots","label":-1},{"text":"House Republicans release recommendations for China crackdown","label":0},{"text":"Trump blames low-income people, minorities for 'ruining' suburbia","label":-1},{"text":"Supreme Court allows census count to cease","label":1},{"text":"Amy Coney Barrett papers over rift between Trump and GOP","label":-1},{"text":"Senate to vote on another aid package next week","label":0},{"text":"Southern Tier sees Covid-19 spike — Mayoral contenders hold first forum — MTA faces 'suffocating' debt","label":-1},{"text":"BREAK-IN at BAKER’S home — Galvin: CENSUS decision will ‘SHORTCHANGE’ state — WALSH embraces POLICE REFORM","label":-1},{"text":"How SCOTUS Nominations Became All-Out War","label":-1},{"text":"Playbook PM: Here’s how the Amy Coney Barrett hearing is going so far","label":0},{"text":"Cuomo’s book debuts — Shutdowns proceed as courts reject challenges — Small town Democrat seeks to survive","label":-1},{"text":"‘Will you please like me?’","label":0},{"text":"Hospital where activists say ICE detainees were subjected to hysterectomies says just two were performed there - The Washington Post","label":0},{"text":"ICE preparing targeted arrests in ‘sanctuary cities,’ amplifying president’s campaign theme - The Washington Post","label":-1},{"text":"‘They’re still not taking this seriously’: Whistleblowing nurse warns of covid-19 safety neglect at ICE facility - Washington Post","label":-1},{"text":"Trump’s attacks prompted Latino immigrants to get more involved in American civic life","label":-1},{"text":"ICE is accused of sterilizing detainees. That echoes the U.S.’s long history of forced sterilization.","label":-1},{"text":"A novel proposal to help millions of kids struggling with online school","label":1},{"text":"Trump’s racism and xenophobia haven’t caught on","label":-1},{"text":"New movies to stream this week: ‘The Glorias,’ ‘Blood on the Wall,’ and more","label":0},{"text":"Trump’s ugly rant in Minnesota shows why Republicans fear he’ll lose","label":-1},{"text":"The Trump mythology is collapsing. And the 9\/11 anniversary shows how.","label":-1},{"text":"Despite Trump’s actions against immigrants, these Latino voters want four more years","label":1},{"text":"Peking duck isn’t the same without the tableside show, but it’s still mighty fine","label":1},{"text":"Trump might want to stop fighting the culture wars. He’s losing.","label":-1},{"text":"New report on Trump’s child separation policy makes it clear: Cruelty was always the point","label":-1},{"text":"Trump’s Social Security-illegal immigration attack on Biden misses its mark","label":-1},{"text":"'Cuties' sparked outrage in the U.S. The reception in Senegal was vastly different.","label":-1},{"text":"If ‘Cuties’ disturbs you, that’s good. What are you going to do about it?","label":0},{"text":"Amy Coney Barrett and the GOP’s hypocrisy about religion","label":-1},{"text":"Allegations of racism have marked Trump’s presidency and become key issue as election nears","label":-1},{"text":"Latino groups warn that Biden’s sluggish outreach could have devastating results","label":-1},{"text":"Some assertions Donald ‘I don’t want people to panic’ Trump has made since February","label":-1},{"text":"Ruth Bader Ginsburg, Supreme Court justice and legal pioneer for gender equality, dies at 87","label":1},{"text":"Trump's dream of a Nobel Peace Prize kept alive by far-flung foreign allies","label":1},{"text":"Macron outlines new law to prevent Islamic 'separatism' in France","label":1},{"text":"Nurse questions medical care at immigration jail in Georgia","label":-1},{"text":"The pandemic is an era of protests — and protest restrictions","label":-1},{"text":"Boris Johnson, who almost died of covid-19, wishes Trump a 'speedy recovery'","label":-1},{"text":"Trump cuts refugee cap to lowest level ever, depicts them on campaign trail as a threat and burden - The Washington Post","label":-1},{"text":"‘I have never supported Donald Trump’: Portland-area sheriff hits back after president claims his endorsement in debate - The Washington Post","label":-1},{"text":"‘This is a nightmare’: New Yorkers get absentee ballots with the wrong return envelope - The Washington Post","label":-1},{"text":"DAWN OF PALANTIR: Silicon Valley surveillance company to go public on NYSE...","label":0},{"text":"Trump alleges ‘left-wing indoctrination’ in schools, says he will create national commission to push more ‘pro-American’ history - The Washington Post","label":0},{"text":"Thanks to Trump’s actions, millions lose health coverage - The Washington Post","label":-1},{"text":"Two new polls show the damage Trump has done to U.S. foreign policy - The Washington Post","label":-1},{"text":"ICE agents stopped a Black jogger in Boston. Authorities are demanding answers. - The Washington Post","label":-1},{"text":"Trump’s October surprises are part of a history of presidential election bombshells - The Washington Post","label":-1},{"text":"Trump says he misled on virus to instill calm. But he’s governed with scare tactics.","label":-1},{"text":"White men backing Trump say they can't be swayed...","label":0},{"text":"Trump can’t decide whom he should tell people to hate","label":-1},{"text":"Trump: America’s perfection shall not be questioned, except by me","label":-1},{"text":"Barack Obama and Kamala Harris both identify as Black. The news media doesn’t describe both that way.","label":-1},{"text":"How do newspapers cover racial and religious minorities? Here’s the data.","label":0},{"text":"We may get 2008 level turnout among young voters. That’s bad for Trump.","label":-1},{"text":"For first time in decade, more people left California than arrived...","label":0},{"text":"Why the Hispanic vote in Florida is particularly worrisome to Biden’s campaign","label":-1},{"text":"‘An ER visit costs more’: Trump’s $750 tax bill inspires a rush of comparisons","label":-1},{"text":"Warmer. Burning. Epidemic-challenged. Expensive. The California Dream has become the California Compromise. - The Washington Post","label":-1},{"text":"A former DHS insider sheds a darker light on Trump’s vile ‘Proud Boys’ comment","label":-1},{"text":"The Republican war on democracy is just getting started","label":-1},{"text":"An only-red-states America probably isn’t one Trump would actually like","label":-1},{"text":"Our democracy has turned dangerously undemocratic","label":-1},{"text":"Kamala Harris’s critics fell into the ‘Is she likable?’ trap","label":-1},{"text":"‘Nobody likes her’: Trump tries his likability standard for female politicians on Kamala Harris","label":-1},{"text":"Biden’s campaign goes full throttle: Trump lied, people died","label":-1},{"text":"Trump has no clue what suburbia is like","label":-1},{"text":"When it comes to race relations, the left and the right are miles apart","label":0},{"text":"Prospects for more stimulus checks, coronavirus relief fade as latest offer from Trump draws opposition from Republicans and Democrats","label":-1},{"text":"The code: How genetic science helped expose a secret coronavirus outbreak - Washington Post","label":-1},{"text":"The sweeping hypocrisy of Trump’s shrugging claim that ‘virtually nobody’ young dies from coronavirus","label":-1},{"text":"We get it, Mr. President: You’re mad at New York City","label":-1},{"text":"The Undecideds: Sure, Biden and Trump are very different. But maybe neither is right for the job.","label":-1},{"text":"What else should Chris Wallace ask at the debate?","label":0},{"text":"Joe Biden pulls off a big speech at a sacred location","label":1},{"text":"In 50 years of PBS programming, content for Americans of all classes and political views","label":1},{"text":"The Oscars want to use Best Picture to make Hollywood more diverse. It won’t be easy.","label":-1},{"text":"Poll: Sharp partisan differences now exist on foreign policy, views of American exceptionalism","label":0},{"text":"Trump finally gets what he has mostly lacked so far in 2020: a big audience and no filter","label":-1},{"text":"Ginsburg breaks one final barrier as first woman to lie in state at Capitol","label":1},{"text":"Tumultuous path to sixth conservative justice puts Supreme Court in the middle of political fray","label":-1},{"text":"White House looks at more executive actions as coronavirus-relief talks appear finished","label":0},{"text":"Once again, Trump’s rhetoric overlaps with arguments used to rationalize violence","label":-1},{"text":"The summer Black culture pushed back","label":0},{"text":"Supreme Court opens new term at the center of America’s bitter political divide","label":-1},{"text":"Ginsburg’s death jolts chaotic presidential race as both sides prepare for Supreme Court battle","label":-1},{"text":"Michigan kidnapping plot, like so many other extremist crimes, foreshadowed on social media","label":-1},{"text":"What we know about efforts by Trump’s 2016 campaign to suppress Black votes","label":-1},{"text":"Biden warns that a quick replacement of Ginsburg would “plunge us deeper into the abyss”","label":-1},{"text":"In Central Florida, Latino evangelicals could give Trump an edge","label":0},{"text":"The Trailer: The seven political states of Texas","label":0},{"text":"\"Will public sympathy lead to a bounce in the polls?\" Questions on the political ramifications of Trump’s COVID-19 diagnosis.","label":0},{"text":"When extremist soccer ‘ultras’ aligned with Israel’s right-wing government, mayhem followed","label":-1},{"text":"The six political states of Georgia","label":0},{"text":"‘All in’ for Trump: These White men, the strongest Trump supporters, say they can’t be swayed","label":-1},{"text":"Luxury cars, MAGA flags and Facebook invites: How an unknown Idaho family organized the Portland rally that turned deadly","label":0},{"text":"Why arguments that mail-in balloting will undermine the election are wrong","label":-1},{"text":"ICE flew detainees to Virginia so the planes could transport agents to D.C. protests. A huge coronavirus outbreak followed.","label":-1},{"text":"Trump’s fusillade of falsehoods on mail voting","label":-1},{"text":"Greek court convicts far-right party leaders of running a criminal organization","label":-1},{"text":"How the U.S. Supreme Court affects the world","label":0},{"text":"'Tis the season for travel in China. But virus fears cast a shadow over festivities.","label":-1},{"text":"Trump’s coronavirus diagnosis sparks hostile Twitter reaction against Asians","label":-1},{"text":"Seattle, Portland...","label":0},{"text":"Biden abandoned Florida. Trump could clinch it with his Supreme Court pick. - The Washington Post","label":0},{"text":"Justice Dept. targets Portland, New York and Seattle over protests - The Washington Post","label":0},{"text":"REINES: I played Trump in Clinton's prep. Here's what Biden can expect...","label":0},{"text":"FBI director says widespread mail ballot interference would be a ‘major challenge’ for foreign agents - The Washington Post","label":-1},{"text":"How a stronger presidency could lead to more effective government","label":1},{"text":"Amy Coney Barrett, a disciple of Justice Scalia, is poised to push the Supreme Court further right","label":0},{"text":"Pence Covid Aide Voting for Biden...","label":0},{"text":"Stories of being swept up by unmarked vans in Portand protests...","label":-1},{"text":"Virus's unseen hotzone: The American farm...","label":0},{"text":"U.S. Chamber of Commerce abruptly ousts top political consultant Scott Reed, alleging leaks","label":-1},{"text":"Democrats finally grasp the importance of the Supreme Court — when it’s almost too late","label":-1},{"text":"If Democrats win, they should move quickly to help the Postal Service","label":1},{"text":"Trump has turned the entire government into a subsidiary of his campaign","label":-1},{"text":"The White House declines to clean up Trump’s comments on a peaceful transfer of power","label":-1},{"text":"Biden visits Florida as Democrats worry about his standing in the state","label":-1},{"text":"CNN’s Biden town hall at the drive-in: This is what a pandemic-era campaign looks like on TV","label":1},{"text":"Bob Woodward, President Trump and 'fake’ news","label":0},{"text":"The four political states of Arizona","label":0},{"text":"Donald Trump doesn’t really care about white supremacy and you’re not going to make him","label":-1},{"text":"Why I dropped ‘conservative’ from my Twitter profile","label":0},{"text":"Parler and Gab, two conservative social media sites, keep alleged Russian disinformation up, despite report","label":-1},{"text":"How much government money does Trump plan to spend on his reelection?","label":-1},{"text":"Biden stiff-arms the left — which holds its fire","label":-1},{"text":"Trump, Biden and the facts: The tale of the tape","label":0},{"text":"Biden and Trump mark Sept. 11 — and are marked by it","label":0},{"text":"E.U. proposes immigration deal that would require countries to take a share of asylum-seekers or assist in deportations","label":0},{"text":"No TV ads, no presidential visits. Virginia’s era as a swing state appears to be over.","label":-1},{"text":"Biden’s moderation contrasts with Democratic rage as court fight looms","label":-1},{"text":"She's straight. He's gay. They can form a 'conjugal relationship' anyway, a Canadian judge says.","label":0},{"text":"Donald Trump sought control over his father’s will and estate, causing family crisis - Washington Post","label":-1},{"text":"Trump looks for ways to win over voters on health care after failing to deliver on promises","label":-1},{"text":"Dutch lawmakers demand answers after U.S. ambassador holds party for right-wing populists at embassy","label":-1},{"text":"Donald Trump, facing financial ruin, sought control of his elderly father’s estate. The family fight was epic.","label":-1},{"text":"The Trailer: The First State goes last","label":0},{"text":"The 50 political states of America","label":0},{"text":"Covid-free communities on the U.S.-Canada border want travel restrictions eased","label":0},{"text":"Singapore — a poster child for globalism — is taking a nativist turn","label":-1},{"text":"Philippines deports U.S. Marine pardoned for murdering transgender woman","label":-1},{"text":"TikTok videos, Facebook Trump ads spread misinformation concerning Biden’s health","label":-1},{"text":"Opinion | Trump’s ‘terrific’ health-care plan is so secret his own health advisers don’t know it exists","label":-1},{"text":"'You're still my baby': Hong Kong mother pleas for son held in mainland China after desperate boat escape","label":-1},{"text":"Twitter employees can now work from home forever","label":0},{"text":"Here’s what Chris Wallace needs to ask at next week’s debate","label":0},{"text":"Migration, in reverse: Coronavirus forces migrant workers to return home","label":0},{"text":"Days after fires destroyed Europe's largest migrant camp, more than 11,500 people are still sleeping outside","label":-1},{"text":"For Filipino migrant workers, coronavirus dashes their ticket to a better life","label":-1},{"text":"After fire guts Europe's biggest migrant camp, Greece erects tents, other countries offer little","label":-1},{"text":"Outcry after reports Britain considered sending asylum seekers to island in the South Atlantic","label":-1},{"text":"Economic fallout from coronavirus leads to surge in Tunisians leaving for Europe","label":-1},{"text":"China's mealtime appeal amid food supply worries: Don't take more than you can eat","label":-1},{"text":"For binational couples divided by the coronavirus, Croatia offers a rare rendezvous","label":0},{"text":"Fleeing chaos and hardship, Lebanese have begun braving perilous seas","label":-1},{"text":"Concern over ethics of using on human beings...","label":-1},{"text":"How the coronavirus pandemic is fueling ethnic hatred","label":-1},{"text":"Federal officials stockpiled munitions, sought ‘heat ray’ device before clearing Lafayette Square, whistleblower says - The Washington Post","label":0},{"text":"Trump’s pandemic lies unmask his contempt for the American public","label":-1},{"text":"There has never been a better time to read J.K. Rowling’s books","label":1},{"text":"Pope Francis's new encyclical is a papal warning about a world going backward","label":-1},{"text":"How the pandemic has affected abortion rules around the world","label":0},{"text":"In Colombia, a death in police custody follows a history of brutality","label":-1},{"text":"How Jewish history and the Holocaust fueled Ruth Bader Ginsburg’s quest for justice - The Washington Post","label":1},{"text":"New survey: Yes, Americans will give up liberties to fight the coronavirus","label":0},{"text":"Prominent Southern Baptists dropping 'Southern' name amid racial unrest...","label":0},{"text":"The Washington Football Team has a new name, but the stink remains","label":-1},{"text":"The Trailer: Biden goes to where his party lost","label":0},{"text":"Trump brings divisiveness and invective back to the rally stage","label":-1},{"text":"Germany suspends dozens of police officers for neo-Nazi chat messages","label":0},{"text":"Raising kids in Gaza was hard enough. Then came a lockdown within the lockdown.","label":-1},{"text":"Burkina Faso's wildlife reserves have become a battle zone, overrun by militants and poachers","label":-1},{"text":"Trump’s rally rhetoric is becoming uglier","label":-1},{"text":"Election live updates: 9\/11 events dominate schedules of both tickets","label":0},{"text":"The long, dangerous history of right-wing calls for violence and civil war","label":-1},{"text":"The five political states of Minnesota","label":0},{"text":"Hong Kongers who fled by sea are held without legal access in China, families say","label":-1},{"text":"Venezuela's Guaido calls supporters to gather in the midst of a pandemic","label":1},{"text":"Turkey arrests dozens, including members of pro-Kurdish party, in connection with deadly 2014 protests","label":-1},{"text":"Venezuela says it has captured American 'mercenary' plotting to blow up power plants, oil refineries","label":0},{"text":"U.S. criticism of European mission to Venezuela shows growing divide over Maduro","label":-1},{"text":"Canada to bring 5-year-old orphan home from Syrian camp; others remain stranded","label":0},{"text":"U.N. investigators accuse Venezuelan government of 'crimes against humanity'","label":-1},{"text":"Democracies are backsliding amid the coronavirus pandemic","label":-1},{"text":"Venezuela's broken oil industry is spewing crude into the Caribbean Sea","label":-1},{"text":"‘Hatred is taught’: Pennsylvania’s second lady films a woman’s racist attack at the grocery store - The Washington Post","label":-1},{"text":"Top workplaces 2020: How the concept of work has shifted - The Washington Post","label":1},{"text":"Michigan’s history of self-styled militia groups has long vexed law enforcement - The Washington Post","label":-1},{"text":"Many Catholic women see themselves in Amy Coney Barrett. Others see an impossible standard. - The Washington Post","label":0},{"text":"How Amy Coney Barrett played a role in Bush v. Gore - and helped Republican Party defend mail ballots...","label":1},{"text":"Supreme Court says Trump administration can shut down census count now, despite fears of an undercount","label":0},{"text":"Biden and Trump step up their fight for older voters","label":0},{"text":"How Amy Coney Barrett played a role in Bush v. Gore — and helped the Republican Party defend mail ballots","label":1},{"text":"Biden reaches out to Catholics like himself, embracing a key group in big 2020 states","label":1},{"text":"Much of America has stopped celebrating Columbus Day, but the explorer remains revered in Italy","label":1},{"text":"Bernard Cohen, lawyer who won victory for interracial marriage in Loving v. Virginia, dies at 86 - The Washington Post","label":1},{"text":"Melania Trump is having a hard time distancing herself from the president - The Washington Post","label":-1},{"text":"Harris faces spotlight at Supreme Court hearing","label":1},{"text":"Justice Dept. sues to seize profits of tell-all Melania Trump book, citing White House nondisclosure pact - The Washington Post","label":0},{"text":"Canada celebrates Thanksgiving amid coronavirus second wave, mixed messages","label":1},{"text":"Families of coronavirus victims are organizing online to push politicians for more strict health measures","label":-1},{"text":"Under the U.S.-Mexico border, miles of tunnels worth millions of dollars — to traffickers","label":0},{"text":"An Indian jewelry brand made a touching ad about an interfaith marriage. Outrage ensued.","label":-1},{"text":"Chinese Americans look to new platforms as WeChat's future remains uncertain","label":-1},{"text":"\"False sense of perspective\": Immigrant TV stories mainly focus on Latinos, deportation","label":-1},{"text":"Coalition backing TPS starts tour slamming Trump's 'racist' end to immigrant protections","label":-1},{"text":"Latino workers are at increased risk of dying on the job, new report says","label":-1},{"text":"Maryland council member loses six family members to Covid-19","label":-1},{"text":"A voice for the 'excluded' and 'oppressed': Latinos remember Justice Ruth Bader Ginsburg","label":1},{"text":"Amid Covid crisis, these Latino businesses are thriving","label":1},{"text":"It's a mistake to compare ICE's 'mass hysterectomies' to Nazi experiments. Here's why.","label":-1},{"text":"German police officers suspended for sharing pictures of Hitler","label":-1},{"text":"Asian American voters support Biden at 54% and Trump at 30%, but numbers don't tell full story","label":0},{"text":"Change or keep your name? For 'Kamala,' 'Nikki,' others, a story of identity, culture and power","label":0},{"text":"Garment workers, paid by the piece, say they'll fight to change the system","label":-1},{"text":"Pence and Harris reflect America's demographic transformation","label":0},{"text":"Latino construction workers have fueled the building boom—at a price","label":-1},{"text":"Asian Twitter, Black Twitter joke about Harris' disapproving auntie vibe","label":1},{"text":"Twitter users flood #ProudBoys hashtag with gay pride images","label":1},{"text":"At 68, this Mexican immigrant is still fighting fires and picking fruit","label":-1},{"text":"Court rules Trump can end Temporary Protected Status for immigrant families","label":0},{"text":"Harris could boost Asian American turnout, study says","label":1},{"text":"'Over the Moon' producer on why Asian representation is in the details","label":0},{"text":"Greek court rules far-right Golden Dawn leaders ran a crime group","label":-1},{"text":"Guatemala says it will detain, return new migrant caravan from Honduras","label":-1},{"text":"Despite coronavirus impact, U.S. Mexican workers send big amounts of money back home","label":0},{"text":"Kamala Harris uses personal story to court recent immigrants, communities of color","label":1},{"text":"Kamala Harris and a history of trying to define 'Asian American'","label":0},{"text":"In many Asian languages, 'LGBTQ' doesn't translate. Here's how some fill the gaps.","label":0},{"text":"Latino voters, activists say Ginsburg replacement fight will rally Democrats, Republicans","label":1},{"text":"Eddie Van Halen endured a 'horrifying racist environment' before becoming a rock legend","label":-1},{"text":"73% of young Asian American voters support Biden, poll shows","label":1},{"text":"Why so many Latinos still love Trump","label":1},{"text":"Black people in Paris recognized the injustice exposed after George Floyd's death","label":-1},{"text":"'A sad and glorious history': One of NYC's last Chinese hand laundries closes","label":0},{"text":"Why Kamala Harris' nomination is pushing this academic idea further into the mainstream","label":0},{"text":"Latino historic sites in Texas and Puerto Rico face risk of destruction","label":-1},{"text":"Nurse questions medical care, operations on detainees at immigration jail in Georgia","label":-1},{"text":"The states with the best and worst census response rates","label":0},{"text":"Justice Department officials drove family separation policy, watchdog report says","label":-1},{"text":"'Called to protect': Air Force veteran sets sights on Congress","label":1},{"text":"After a tumultuous month of news, Biden maintains national lead over Trump","label":0},{"text":"Progressive groups mobilize Latino voters in N.C. by tapping culture, youth","label":1},{"text":"Biden launches initiative with lawmakers to reach Asian Americans in battleground states","label":0},{"text":"New film dismantles South Asian stereotypes tied to spelling bee, mental health","label":0},{"text":"Rights group denounces Central America anti-LGBTQ violence","label":-1},{"text":"Ruth Bader Ginsburg's dying wish highlights Trump's brutal Supreme Court hypocrisy","label":-1},{"text":"Trump's incredible Proud Boys debate moment was more than a dog whistle","label":1},{"text":"Why domestic violence calls are surging for Asian American women amid the pandemic","label":-1},{"text":"Affirmative action debate ignores Asian American community college students","label":-1},{"text":"The Senate COVID-19 relief bill was DOA. Why McConnell held a vote anyway.","label":0},{"text":"Members of the Divine Nine prepare to back Harris","label":1},{"text":"To save the American economy, Trump and Biden must look to U.S. Latinos","label":1},{"text":"Trump's new 'anarchist jurisdictions' would be absurd — if they weren't so scary","label":-1},{"text":"Inside the battle to mobilize Latino voters amid pandemic, protests","label":-1},{"text":"Stoking his base, Trump warns of a Kamala Harris presidency","label":-1},{"text":"Kamala Harris, Mike Pence and the case for making white people uncomfortable","label":-1},{"text":"How Covid has impacted Asian American multigenerational homes","label":0},{"text":"As Trump dismisses the virus again, Biden stands with a cautious majority","label":-1},{"text":"Latino voters could swing Nevada. But they worry their ballots won't count.","label":-1},{"text":"Trump's 'rigged' election talk is more dangerous than it was four years ago","label":-1},{"text":"DHS spokeswoman pushed NBC News to retract accurate story about terrorists at the border","label":-1},{"text":"The GOP is usually more fired up over SCOTUS. Now, polls say Democrats are.","label":-1},{"text":"Video of Black jogger stopped by ICE agents in Boston prompts calls for investigation","label":-1},{"text":"Pence vs. Harris: 5 things to watch at their only debate","label":0},{"text":"'Beyond negligent': Census workers describe logistical nightmare as deadline approaches","label":-1},{"text":"The sheriff's race pitting Trump against Black Lives Matter","label":-1},{"text":"Here's how Biden passed Trump last month in the 2020 money race","label":0},{"text":"Puerto Ricans who fled Hurricane Maria find a home in Pennsylvania's Amish country","label":0},{"text":"This Latino cartoonist is on a mission to defeat Trump in November","label":1},{"text":"Judge blocks large parts of temporary work visa ban","label":0},{"text":"Stephen Miller, top White House aide, tests positive for coronavirus","label":0},{"text":"Could Trump's economic message land with Latinos?","label":0},{"text":"Supreme Court battle after Ginsburg's death could fracture Trump's coalition","label":-1},{"text":"Due to coronavirus, nation's oldest Latino civil rights group moves 2021 convention online","label":0},{"text":"Pompeo criticizes pope over China as Vatican warns against dragging church into election","label":-1},{"text":"On the Texas border amid coronavirus, families are seeking medical care in Mexico","label":0},{"text":"Lindsey Graham, Jaime Harrison tout bipartisanship in S.C. debate","label":-1},{"text":"As a new American, I gave my first vote to Trump. Here's why I'll do it again.","label":0},{"text":"'Ching chong! You have Chinese virus!': 25 percent of Asian American youths have been victims of racist bullying, report says","label":-1},{"text":"Eva Longoria partners to support farmworkers and debunks myths about Latino voters","label":1},{"text":"Venezuelans start fleeing country again after months of Covid lockdowns","label":-1},{"text":"With support from other groups lagging, Trump makes push for Latino voters in campaign home stretch","label":0},{"text":"COVID-19's economic impact on Latinos is 'much worse' than expected, poll finds","label":-1},{"text":"Lindsey Graham tries to hold on in tight S.C. Senate race","label":0},{"text":"Facebook removes Trump ads with baseless claims","label":-1},{"text":"The GOP's defense of Kyle Rittenhouse has an ominous 2020 election motive","label":-1},{"text":"'A crisis of humanity': Migrants take on treacherous journey from France to Britain","label":-1},{"text":"Biden leans into economic populist pitch","label":0},{"text":"Cuban dissident, denied entry to U.S., waits in Mexican border town as cancer spreads","label":-1},{"text":"Philippines deports U.S. Marine in transgender killing","label":-1},{"text":"Louisville federal buildings close as city awaits state findings on Breonna Taylor","label":0},{"text":"Acting DHS secretary calls claims of manipulating intelligence reports 'patently false'","label":-1},{"text":"Resilience amid violence: Author digs into El Salvador's and his family's past","label":1},{"text":"Kelly, McSally face off in feisty Arizona Senate debate: Trump, McCain, 'radical left'","label":0},{"text":"Theater director who championed marginalized voices lost to Covid","label":1},{"text":"Native Americans reclaim history 400 years after Mayflower landing","label":0},{"text":"Democratic insiders set up 'war room' to kill the filibuster","label":-1},{"text":"What Obamacare? Republican candidates go mum on health care law","label":-1},{"text":"Trump struggles with town hall questions on the coronavirus and race relations","label":-1},{"text":"The Senate was designed to cool our politics down. No more","label":0},{"text":"Trump and team reversed course on the debate expectations game","label":0},{"text":"Michelle Obama releases 'closing argument' for Joe Biden","label":0},{"text":"How Democrats are trying to win over Trump-skeptical veterans","label":1},{"text":"Biden campaign hits new weekly spending highs across battleground states","label":0},{"text":"Obama puts political heft behind Democrats in key races up and down the ballot","label":0},{"text":"Music legend Linda Ronstadt honors her Mexican roots — and has a lot to say about our politics","label":1},{"text":"Vice presidential debate live updates: Pence and Harris face off","label":0},{"text":"Pelosi again tests negative, aide says","label":0},{"text":"From the fields to the classroom: Inside the lives of U.S. agriculture's youngest workers","label":0},{"text":"How this artist turned a lynching tree into guitars","label":0},{"text":"DHS awarded $6 million in contracts to firm where Acting Secretary Wolf's wife is executive","label":1},{"text":"Democrats demand answers from Azar after NBC News report on family separation vote","label":-1},{"text":"Officials said in 2017 that separated migrants under 12 couldn't find parents again on their own","label":0},{"text":"UN urges Latin America, Caribbean boost stimulus aid amid coronavirus","label":1},{"text":"It's 'now or never' for ex-Trump aides weighing speaking out","label":-1},{"text":"Thousands made homeless by refugee camp fires to be housed within days, Greece says","label":0},{"text":"First Asian American Pulitzer board member on how his new role transcends literature","label":0},{"text":"Colorado officer who pointed gun at doctor's head on his own property suspended 1 week","label":-1},{"text":"Chris Rock is the surprise highlight of 'Fargo's' ambitious new season","label":1},{"text":"Trump plans to slash refugee admissions to U.S. to a record low","label":-1},{"text":"Trump's positive test guarantees the coronavirus will dominate the final weeks of campaign","label":0},{"text":"'No one cares': Pandemic exacerbates strain on Gaza Strip's densely packed communities","label":-1},{"text":"Biden outspent Trump $153 million to $57 million on ads in a single month","label":0},{"text":"An unexpected discovery on Venus is a potential game changer for alien hunters","label":1},{"text":"How one chocolatier pivoted during pandemic","label":0},{"text":"Puerto Rican voters, battered by crisis, could be pivotal for Biden in Florida","label":-1},{"text":"Wife of Pennsylvania's Lt. Governor called racist slur at grocery store","label":-1},{"text":"New film explores immigrant family sacrifice, understanding through LGBTQ lens","label":1},{"text":"Democrats' attention has moved on from ICE. But the crisis it enables continues.","label":-1},{"text":"Indian Americans solidly behind Biden in U.S. presidential election, survey shows","label":1},{"text":"Mexico says 2 women may have had nonconsensual surgery in ICE detention","label":-1},{"text":"Jamaicans in Florida energized by Harris on 2020 ticket","label":1},{"text":"How to determine which Americans get the first Covid vaccine","label":0},{"text":"Biden campaign's microtargeting of Latino communities takes on a new twist","label":0},{"text":"Here's why Republicans seem so obsessed with Amy Coney Barrett's motherhood","label":-1},{"text":"A growing Asian American electorate could help swing Pennsylvania back to blue","label":1},{"text":"Supreme Court allows Trump administration to end census count early","label":0},{"text":"Cameroonian asylum seekers pulled off deportation plane amid allegations of ICE abuse","label":-1},{"text":"Pelosi calls latest Trump stimulus proposal 'grossly inadequate' as Trump revives push","label":-1},{"text":"New thriller by Priyanka Chopra tackles generational trauma","label":-1},{"text":"Early end to census count 'particularly cruel' amid Covid, say groups","label":-1},{"text":"Coronavirus struck Texas' Rio Grande Valley. Will Latinos strike back with their votes?","label":-1},{"text":"In Singapore, facial recognition is getting woven into everyday life","label":0},{"text":"Democrats dominate California, so why aren't progressives happy?","label":-1},{"text":"Biden's key immigration policies face uphill battle","label":-1},{"text":"Stephen Miller reveals Trump's second-term immigration agenda","label":0},{"text":"How one of Trump's signature issues is backfiring with the voters he needs to win","label":-1},{"text":"Shakira slams 'unimaginably cruel' U.S. family separations at border","label":-1},{"text":"Dreamers laud Biden's win but remain vigilant on his DACA, immigration promises","label":1},{"text":"U.S. deports migrant women who alleged abuse by Georgia doctor","label":-1},{"text":"Lawyers say deportees to Cameroon would be flying on 'death planes'","label":-1},{"text":"Ramped-up ICE arrests amid Covid outbreaks slammed for 'irresponsible disregard'","label":-1},{"text":"Why Trump is picking up support from Black and Hispanic voters","label":1},{"text":"Here's how Biden policies could impact segments of the Latino community","label":0},{"text":"Mexico will stop holding migrant children in detention, wins praise from U.N.","label":1},{"text":"How undocumented Asian Americans who can't vote are getting people to polls","label":0},{"text":"Trump and Biden's divide over kids in cages underscores America's stark 2020 choice","label":-1},{"text":"Federal judge rules acting DHS head Chad Wolf unlawfully appointed, invalidates DACA suspension","label":-1},{"text":"ICE arrests 15 foreign students for allegedly using visa program to stay in U.S. fraudulently","label":-1},{"text":"In a first, ICE agents are poised to respond to potential Election Day unrest","label":-1},{"text":"What Democrats need to learn from Latino support for Trump — before 2022","label":1},{"text":"Asian American New Yorkers had biggest surge in unemployment during pandemic","label":-1},{"text":"Seeds of change: For the first time in decades, farmers in Arizona are divided over presidential election","label":0},{"text":"Latino voters in Georgia get attention in high-stakes Senate races","label":0},{"text":"Supreme Court to take up Trump border wall spending, asylum enforcement","label":0},{"text":"Voter outreach in South Asian languages ramps up","label":1},{"text":"Trump begins rally blitz by playing the hits and lamenting the cold","label":-1},{"text":"These 8 Latino Democratic candidates could be historic firsts in Congress","label":1},{"text":"Why the Asian American Covid data picture is so incomplete","label":0},{"text":"Three-quarters of Latino voters disapprove of Trump's coronavirus response in poll","label":-1},{"text":"Asian Americans could swing key states, survey shows","label":0},{"text":"Muslims in the U.S. are more politically engaged than ever, study finds","label":1},{"text":"NY Attorney General developing 'long' list of Trump actions for Biden to undo","label":0},{"text":"Highlights from the final Trump-Biden presidential debate","label":0},{"text":"Final Trump-Biden debate finally provides clarity on the issues","label":1},{"text":"This asylum-seeker was wrongfully deported. ICE admits it was a mistake.","label":-1},{"text":"Asian Americans more likely to use absentee ballots — and be rejected in Calif.","label":-1},{"text":"LGBTQ representation in the House could double on Election Day","label":0},{"text":"Another Latino 'first': Law school dean becomes college president","label":1},{"text":"Who are the Latinos who could be in Biden's Cabinet?","label":0},{"text":"Being a Black Republican in the Trump era","label":0},{"text":"'Full-blown depression': Most Latina domestic workers grapple with housing, food insecurity","label":-1},{"text":"Georgette Gomez could make history as the first queer Latina in Congress","label":1},{"text":"From magazine editor to first Asian American in Penn. state Senate","label":1},{"text":"Asian American vote carries newfound weight in N.C.","label":0},{"text":"These 2 congressional districts could decide the election. Biden is up in both.","label":0},{"text":"Asian Americans are growing fastest in Nevada. Here's how they voted.","label":0},{"text":"Nguyen vs. Nguyen race in Calif. highlights rise of Vietnamese American electorate","label":0},{"text":"Trump administration's child separations a \"moral stain\" — and a voter issue","label":-1},{"text":"Who are the Asian Americans still voting for Trump in spite of his 'China virus' rhetoric?","label":-1},{"text":"The truth about 'Anonymous' that 'Resistance' liberals don't want to hear","label":-1},{"text":"Black Lives Matter faces test of its influence in election","label":0},{"text":"'Years in the making': Established Latino groups helped Biden in Arizona, Nevada","label":0},{"text":"Joe Biden will have a long list of economic fixes to make: Experts say these are the top 3","label":0},{"text":"From Covid-19 to climate, President-elect Joe Biden laid out a comprehensive agenda","label":1},{"text":"Lawyers can't find the parents of 666 migrant children separated by Trump administration","label":0},{"text":"2020 National Book Awards finalists","label":1},{"text":"Trump turns to his playbook from four years ago, but 2020 isn't 2016","label":-1},{"text":"The 2020 census count is done, but the fight over the results is just beginning","label":-1},{"text":"'Do-or-die moment': Latino Biden supporters canvass in battleground states","label":1},{"text":"Indiana officer fired after ties to neo-Nazi internet forum are revealed","label":-1},{"text":"Young Latino voters in Pennsylvania, Florida could tilt race for Trump, Biden","label":0},{"text":"Pennsylvania Latinos were pivotal for Biden in the state","label":1},{"text":"It's 'white knuckle time' for Biden and Trump","label":0},{"text":"In Florida, Spanish-language misinformation embraces misleading Election Day claims","label":-1},{"text":"European leaders push for tighter borders after attacks","label":-1},{"text":"Gen Z's first-time voters celebrate Biden's election but vow to hold him accountable","label":1},{"text":"State AGs have sued the Trump admin. 138 times — nearly double those of Obama, Bush","label":0},{"text":"'2020 is the time': California voters weigh bringing back affirmative action","label":0},{"text":"An activist's dreams 'were about to come true.' Then, a horrific accident cut her life short.","label":-1},{"text":"Trump's border wall endangered the environment. Could it come down under Biden?","label":0},{"text":"Tech platforms continue to let U.S.-based hate groups use them to make payments","label":-1},{"text":"How the Trump administration's 'midnight rule-making' could leave a big mark on government","label":-1},{"text":"November 8 highlights: Reactions after Joe Biden wins presidency","label":0},{"text":"Offensive cartoon inflames tensions between France, Turkey","label":-1},{"text":"The South was a lost cause for Democrats. Now eight key Senate seats are in play.","label":-1},{"text":"These attorneys remade the Supreme Court. Now they're fighting to limit voting.","label":0},{"text":"Election 2020 live updates: Trump and Biden hold dueling Florida rallies","label":0},{"text":"Election live results: Joe Biden, Kamala Harris win the election","label":0},{"text":"His Hometown: Springsteen uses classic to sing Biden's praises","label":1},{"text":"4 takeaways from the last presidential debate of 2020","label":0},{"text":"Watch full NBC News Trump town hall","label":0},{"text":"Voters battle lines, malfunctioning machines, misinformation at some polling sites","label":-1},{"text":"Israeli columnists fret over U.S. elections","label":-1},{"text":"Trump volunteer tells rallygoers not to wear QAnon attire. Not everyone listens.","label":-1},{"text":"Biden narrowly expands Arizona lead as more of vote count is released","label":1},{"text":"There's plexiglass on the debate stage in Nashville","label":0},{"text":"Demonstrators in France honor teacher beheaded after discussing Prophet Muhammad cartoons","label":1},{"text":"Two dead, others injured in suspected terrorist attack at French church","label":-1},{"text":"New film spotlights shifting politics of Asian Americans","label":0},{"text":"Retired Philadelphia fire lieutenant survived close calls until Covid-19","label":1},{"text":"From tenet to target: Paris teacher's beheading challenges France's idea of secularism","label":-1},{"text":"'Binded by blood,' split over election: Asian American family embodies generational shift in politics","label":0},{"text":"Ethiopia's Tigray leader confirms firing missiles at Eritrea as fighting escalates","label":-1},{"text":"305,000 unregistered Asian American swing state voters still have time to register, study finds","label":0},{"text":"War crimes feared in Ethiopia's Tigray conflict as thousands flee to neighboring Sudan","label":-1},{"text":"1st woman of color elected to Vermont Senate wants to uplift others","label":1},{"text":"Ethiopia nears war as PM orders military into defiant region","label":-1},{"text":"Biden leads Trump, but it's much closer in battleground states","label":0},{"text":"Apple announces the cast for its 'Pachinko' series","label":-1},{"text":"German prosecutors seek life for extremist who attacked synagogue on Yom Kippur","label":-1},{"text":"Priyanka Chopra Jonas' 'The White Tiger' explores India's class struggles in first trailer","label":-1},{"text":"70% of Asian Americans support affirmative action. Here's why misconceptions persist.","label":1},{"text":"John Leguizamo: When it comes to Latinos, there's a wall 'in American culture'","label":-1},{"text":"In Miami, coalition of Latino evangelical leaders endorses Biden","label":1},{"text":"Calif. Uber, Lyft measure could take toll on Asians, who are 1 in 3 drivers in Bay Area","label":-1},{"text":"Judge orders Trump admin. to stop expelling children who cross border alone","label":-1},{"text":"Fake news spread on WhatsApp to Indian Americans plays stealth role in U.S. election","label":-1},{"text":"Julián Castro: Latino voters 'are in the driver's seat like never before'","label":1},{"text":"How Kamala Harris and Jill Biden are subverting myths about America's stepmoms","label":1},{"text":"Marilyn Strickland's Black, Korean American roots are 1st for Congress","label":0},{"text":"Latino voters targeted by abortion misinformation campaigns","label":-1},{"text":"Harris solidifies her place in history as first female, Black, South Asian American VP-elect","label":1},{"text":"With Harris as VP, South Asian women see an opening into politics","label":1},{"text":"Asian American lawmakers celebrate Harris as VP-elect, call for more progress","label":1},{"text":"Asian Americans voted for Biden 63% to 31%, but the reality is more complex","label":0},{"text":"He went undercover with French police. He found racism, brutality and a toxic culture.","label":-1},{"text":"Democrats hold big edge in Spanish-language TV and radio spending up and down ballot","label":0},{"text":"Harris solidifies her place in history as first female, Black, South Asian American VP","label":1},{"text":"Not enough or double the prejudice: On being Black and Asian American in 2020","label":-1},{"text":"Immigrant families pay tribute to Alex Trebek for helping them learn English","label":1},{"text":"How Filipino Americans are being honored in L.A. after fighting for visibility","label":1},{"text":"Majority of Americans don't expect to know presidential winner on Election Day","label":0},{"text":"Battleground ad spending: Biden maintains advantage in key swing states","label":0},{"text":"Democratic presidential effort poised to outspend Republicans $93 million to $41 million in race's final days","label":0},{"text":"'Adis Trump' T-shirt sale will fund DACA kids, says Julin Castro","label":0},{"text":"Jill Biden says husband will be a president for 'all families'","label":1},{"text":"Meet California's first Gen Z lawmaker","label":0},{"text":"Desi Twitter bursts with pride over Kamala Harris as VP-elect","label":1},{"text":"Is the Trump administration really 'working very hard' to reunite migrant parents and children?","label":-1},{"text":"Kamala Harris shattered the ultimate glass ceiling — for all women","label":1},{"text":"Lawyers say they can't find the parents of 545 migrant children separated by Trump administration","label":-1},{"text":"Where did Trump make election gains? Unemployment data tells a surprising story","label":1},{"text":"Adrian Tam defeats local Proud Boys leader for Hawaii House seat","label":1},{"text":"The quiet neighbor? Mexico has yet to congratulate Joe Biden on his win.","label":-1},{"text":"'Adiós Trump' T-shirt sale will fund DACA kids, says Julián Castro","label":0},{"text":"Democrats gear up to fight gerrymandering after state House losses","label":-1},{"text":"Here's my debate question: Should I let my children watch it?","label":-1},{"text":"Anti-Latino hate crimes push up overall number","label":-1},{"text":"In Nashville the reasons vary, the candidate of choice doesn't","label":0},{"text":"'A win for all of us': Over 220 LGBTQ candidates celebrate election victories","label":1},{"text":"'Saturday Night Live' celebrates Biden's win","label":1},{"text":"Trump hates Biden's stretch-run strategy. Biden loves Trump's.","label":1},{"text":"Read: President-elect Joe Biden's full victory speech","label":0},{"text":"Agency that cares for migrant kids was not told Trump admin was separating families, says report","label":0},{"text":"U.S. criticized for police brutality, racism at U.N. rights review","label":-1},{"text":"Community rallies for Latina leader needing lung transplant","label":1},{"text":"Trump is underperforming with the voters who carried him to the White House","label":0},{"text":"Melania Trump expressed surprise over Vogue selecting Beyoncé for 2018 cover","label":0},{"text":"74 migrants drown as Europe-bound ship capsizes near Libya","label":-1},{"text":"Biden win would lift Mexico-U.S. ties but energy is 'canary in the mine'","label":1},{"text":"Candace Owens mocks Harry Styles in sad attempt to preserve the gender binary","label":-1},{"text":"ICE deports illegal immigrant wanted for homicide in El Salvador","label":-1},{"text":"Nevada judge clears way for trial of undocumented immigrant in four 2019 homicides","label":-1},{"text":"Mackenzie Lueck’s killer pleads guilty to aggravated murder, will avoid death penalty: reports","label":-1},{"text":"Three immigrant brothers accused of raping 10-year-old girl in Louisiana, one suspect fled","label":-1},{"text":"MSNBC’s Maddow uses Obama-era photos of immigrant children to slam Trump","label":-1},{"text":"DHS investigates forced sterilization, hysterectomy allegations of illegal immigrants","label":-1},{"text":"Georgia jail housing ICE, other detainees performed questionable hysterectomies, shredded records, nurse says","label":-1},{"text":"The Catholic Vote: PART I","label":0},{"text":"ICE planning immigration enforcement operations in sanctuary cities","label":0},{"text":"Mexican teen in US illegally is charged as adult for attempted murder of Arizona trooper","label":-1},{"text":"ICE arrests 128 illegal immigrants in Calif.; 96 percent had criminal charges or convictions","label":-1},{"text":"Federal appeals court strikes down Trump administration policy on keeping undocumented immigrants from being counted in the census","label":-1},{"text":"Google Doodle honors Felicitas Mendez, civil rights pioneer, for Hispanic Heritage Month","label":1},{"text":"Democrats to unveil bill limiting Supreme Court justice terms","label":1},{"text":"Trump administration moves to limit student visa stays over fraud, national security concerns","label":-1},{"text":"California town destroyed by deadly wildfire; another town relives 2018 nightmare","label":-1},{"text":"GOP rep unveils 'Creeper Act' to crack down on pedophilia amid 'Cuties' outrage","label":-1},{"text":"Abortion and immigration driving Florida Latino voters to the polls","label":0},{"text":"Biden has immigrants, advocates hoping for reversal of Trump's border policies","label":1},{"text":"Refugees from socialist countries warn Americans: Don't let it happen here","label":-1},{"text":"Critics rip Netflix for condemning Jerry Harris' alleged abuse of minors after defending 'Cuties'","label":-1},{"text":"Parkland parents create artificial intelligence video of slain son to spur voters","label":0},{"text":"Mercedes Schlapp: Why I celebrate Hispanic Heritage Month","label":1},{"text":"Jimmy Kimmel criticized after ICE joke directed towards John Oliver","label":-1},{"text":"Conservatives call on Obamas to use Netflix influence to nix 'Cuties'","label":0},{"text":"Rep. Ken Buck calls for investigation into 'exploitation of children' in letter to DOJ regarding Netflix film 'Cuties'","label":-1},{"text":"Group led by Black Lives Matter founder is 'fiscally sponsored project' of pro-China org: report","label":0},{"text":"'Coronavirus Death Scoreboard' display stirs controversy in Illinois town","label":-1},{"text":"Ex-Texas deputy sheriff gets 18 years in prison for sexually exploiting, cyberstalking two Massachusetts girls","label":-1},{"text":"Woman loans designer wedding dress to other brides for free","label":1},{"text":"Netflix should face DOJ action over 'Cuties,' some members of Congress say","label":0},{"text":"Sophia Loren, 86, reveals the reason she came out of retirement","label":0},{"text":"Amid coronavirus pandemic, Texas border agents see human smuggling on the rise","label":-1},{"text":"Joint push for Caribbean countries to develop a coordinated sex-offender registry announced","label":0},{"text":"'Coronavirus Death Scoreboard' vandalized, Illinois town decides not to remove anti-Trump display","label":-1},{"text":"Washington Post columnist defends 'Cuties' from uproar after knocking 'Joker' as provocative","label":-1},{"text":"Ted Cruz calls for DOJ investigation into 'Cuties' filmmakers and Netflix","label":0},{"text":"Biden, Florida-bound, says his support among Hispanic voters has ‘gotta go higher’","label":1},{"text":"Jeffrey Sutton: Justice Scalia and our Constitution -- a legacy that will endure","label":1},{"text":"Biden blasts Trump, touts veterans issues during first stop in battleground Florida","label":-1},{"text":"Pro-Trump crowd in Illinois opposes Trump-bashing 'Coronavirus Death Scoreboard'","label":-1},{"text":"Ruth Bader Ginsburg, R.I.P.","label":0},{"text":"The Trump show goes into reruns","label":0},{"text":"House Democrats’ stimulus bill includes stimulus checks for illegal immigrants, protections from deportations","label":-1},{"text":"Trump voters view immigrants more positively now than in 2016: poll","label":0},{"text":"GOP senators ask CBO how much immigration provisions in House stimulus bill will cost","label":0},{"text":"Eleven suspects charged for marriage fraud scheme involving immigrants, U.S. Army soldiers","label":-1},{"text":"Appeals court reverses order on protections for immigrants from El Salvador, Haiti, Sudan, Nicaragua","label":0},{"text":"Baltimore murder suspects protected by sanctuary laws, ICE says; 'This is the worst-case scenario'","label":-1},{"text":"Border Patrol nabs two sex offenders trying to re-enter US illegally","label":-1},{"text":"Trump White House can't end census early, judge rules","label":0},{"text":"ICE deportation flight, objected to by Omar over COVID fears, included convicted murderer, rapist","label":-1},{"text":"Rep. Ralph Norman (R-SC): I Oppose The Stimulus Checks, Open Up The Country Instead","label":0},{"text":"Federal judge orders Trump admin to respond to accusations census workers ordered to halt operations","label":-1},{"text":"Tlaib: Jeff Sessions should be sent 'to the Hague' for role in family separation policy","label":-1},{"text":"Trump administration denied request to block 2020 census extension","label":-1},{"text":"Virginia county denied more than 900 ICE detainer requests over two years: report","label":-1},{"text":"Rove breaks down Trump boost from Latino voters: 'People in Florida remember what socialism looks like'","label":1},{"text":"US extends coronavirus travel restrictions across Canadian, Mexican borders","label":0},{"text":"Paul Batura: Grandparents Day — thinking of the man I feared, and why I'm grateful to him","label":-1},{"text":"Meryl Streep's nephew accused of spouting anti-Hispanic slurs during road-rage attack","label":-1},{"text":"Biden won't release Supreme Court list because it would be 'radical,' 'frighten' voters: Carrie Severino","label":-1},{"text":"No deal yet on coronavirus relief; Pelosi remains 'hopeful'","label":1},{"text":"House Democrats' new coronavirus relief bill eliminates $600M for policing: 'It's shameful'","label":-1},{"text":"David Bossie: Presidential debates will showcase Trump strengths and Biden weaknesses","label":1},{"text":"Texas' largest county is approving voter registrations for noncitizens, lawsuit claims","label":-1},{"text":"John Cusack compares Donald Trump to Adolf Hitler, claims fascism is on the rise: ‘It’s happening slowly’","label":-1},{"text":"Ilhan Omar says Trump should resign for downplaying coronavirus","label":-1},{"text":"Japan celebrates Osaka; Sponsors cautious about activism","label":1},{"text":"Hondurans in migrant caravan bused back after entering Guatemala","label":0},{"text":"Problem Solvers Caucus leader says COVID stimulus deal is 'within inches'","label":0},{"text":"Kudlow on coronavirus relief negotiations: ‘Vital, targeted assistance' would 'strengthen the economy’","label":1},{"text":"Bill Clinton shares statement, photo after Ginsburg death","label":0},{"text":"Harvard poll shows voters receptive to law and order messaging","label":0},{"text":"Rep. Eric Swalwell: Biden wins first debate, Trump is truth’s worst enemy","label":-1},{"text":"Ceasefire’s over: After Trump twitter storm, Biden urges president to ‘listen to the scientists’","label":-1},{"text":"Scalise touts Trump coronavirus response, slams Democrats for 'actively working to undermine public faith'","label":1},{"text":"Woman’s headache caused by tapeworm larvae in brain: case report","label":0},{"text":"Newt Gingrich: Harris vs. Pence VP debate – Get ready for a truly historic encounter","label":1},{"text":"Sen. Mike Lee: VP debate -- The Harris agenda isn't something Americans should be forced to follow","label":-1},{"text":"Trump administration unveils sweeping changes to controversial H-1B guest worker program","label":-1},{"text":"Wolf takes aim at 'fabricated' complaints, reports at confirmation hearing","label":-1},{"text":"Lee Carter: In three presidential debates, undecided voters want to hear these things from Trump and Biden","label":0},{"text":"Supreme Court nominees if Biden wins: Who might be considered","label":0},{"text":"Louisville police officers shot as Breonna Taylor protesters take to streets","label":-1},{"text":"Judith Miller: Democrats hope Trump's COVID medical misfortune is their political gain","label":1},{"text":"Leslie Marshall: On Supreme Court, Amy Coney Barrett would threaten rights of millions of Americans","label":-1},{"text":"Biden vows not to allow ‘White supremacists to overturn the America of Lincoln’","label":1},{"text":"Trump wants Russian collusion, Clinton email probe documents declassified","label":0},{"text":"David Bossie: At VP debate, Pence's steady hand vs. the uncertainty of Harris was on full display","label":1},{"text":"How long each Supreme Court Justice has served on the bench, and how long it took to confirm them","label":0},{"text":"David Bossie: Trump clearly defeats Biden in first presidential debate","label":1},{"text":"Florida's Puerto Rican voters courted heavily by Republicans and Democrats","label":0},{"text":"Where has Amy Coney Barrett stood on important cases?","label":0},{"text":"What’s up with Trump and the Hispanic vote?","label":0},{"text":"NJ business owner apologizes for sign: 'Speak English or pay $10 extra'","label":-1},{"text":"Migrant caravan of 2,000 Hondurans heading to US despite COVID-19 threat","label":-1},{"text":"Portland protesters clash with federal officers outside ICE building, unlawful assembly declared: report","label":-1},{"text":"ICE detainees will no longer be seen by doctor accused of performing hysterectomies without consent","label":-1},{"text":"US Marine who killed transgender woman in Philippines deported after presidential pardon","label":-1},{"text":"Chad Wolf, acting head of DHS, to face Senate confirmation hearing Wednesday","label":0},{"text":"Twitter temporarily suspends Hungarian government account 'without warning or explanation,' cabinet official claims","label":0},{"text":"AOC says Dems can 'likely' push Biden in 'more progressive direction' if elected","label":0},{"text":"Former GOP Gov. Tom Ridge endorses Biden","label":0},{"text":"Joe Biden blasts Bernie in pitch to Wisconsin voters: 'I beat the socialist'","label":-1},{"text":"Milwaukee health commissioner says she faced racism, sexism on job","label":-1},{"text":"Portland civil rights leader says protesters are 'not going anywhere'","label":-1},{"text":"Jimmy Kimmel’s Emmy Awards telecast plummets to record low ratings","label":-1},{"text":"Trump says Biden, Dems want ‘American nightmare’ in pitch to Latino voters","label":-1},{"text":"Biden downplays ties to Bernie Sanders policies in general election despite unity platform","label":-1},{"text":"Washington Post's Jennifer Rubin finally drops 'conservative' label from Twitter bio","label":0},{"text":"Andrew McCarthy: Biden refuses to say if he favors packing Supreme Court — among key questions he won’t answer","label":-1},{"text":"Bernie Sanders to stump for Biden in Arizona with virtual town hall","label":0},{"text":"EPA boss rips Cuomo, de Blasio over protests, threatens to relocate NYC office","label":-1},{"text":"Fox News Poll: Biden-Trump a 5-point race in post-convention poll","label":0},{"text":"150 liberal groups tell senators to oppose Barrett as outside groups ramp up for confirmation fight","label":-1},{"text":"Portland protests resume after wildfire hiatus with Ginsburg vigil, more vandalism","label":-1},{"text":"Washington Post's Jennifer Rubin calls to 'defund' Walter Reed after Trump announces White House return","label":0},{"text":"DHS chief Wolf says border crossers now are mostly single adults coming for economic reasons","label":0},{"text":"Newt Gingrich: Kamala Harris is most radical major party VP nominee in US history","label":-1},{"text":"Louisville police declare 'state of emergency,' barricades block traffic ahead of anticipated Breonna Taylor announcement","label":-1},{"text":"Biden says Senate should not act on Amy Coney Barrett Supreme Court nomination until after election","label":0},{"text":"Trump campaign expects ‘tuned in’ Joe Biden on debate night","label":-1},{"text":"Tim Murtaugh: Presidential debate reminder -- Biden is a skilled debater. It's his record that's a failure","label":-1},{"text":"Biden calls Trump’s a ‘climate arsonist’ who ‘won’t take responsibility’ for wildfires","label":-1},{"text":"California's Newsom thanks Trump for help with fires, says climate change contributes to blazes","label":1},{"text":"Tom Homan: Attacks on police must end — they are America’s heroes and protect us all, regardless of race","label":1},{"text":"What Trump's suspension of coronavirus aid talks means for future of relief bill","label":0},{"text":"Judge denies motion to extend Florida's voter registration","label":-1},{"text":"Trump camp keeps pressure on Biden to release list of SCOTUS picks after Ginsburg death","label":-1},{"text":"Schumer puts health care on forefront as Dems prepare to fight Amy Coney Barrett nomination","label":1},{"text":"'Nervous' Schumer spending big in Michigan Senate race to help Gary Peters: memo","label":-1},{"text":"Louisville federal buildings boarded up ahead of anticipated Breonna Taylor grand jury decision","label":0},{"text":"David Limbaugh: Trump haters keep gaslighting Trump supporters -- as if supporting him an unforgivable sin","label":-1},{"text":"Conservative groups bring in reinforcements expecting brutal Barrett confirmation fight","label":-1},{"text":"Bail fund backed by Kamala Harris and Joe Biden staffers bailed out alleged child abuser, docs indicate","label":-1},{"text":"Republicans eye Amy Coney Barrett Senate floor vote at end of October, just days before election","label":0},{"text":"Biden campaign on Trump rallies: ‘People will die’","label":-1},{"text":"Coronavirus outbreak at Vermont apple orchard sickens dozens of migrant workers","label":-1},{"text":"Coronavirus cases linked to beer fest in North Carolina, attendees urged to get tested","label":0},{"text":"Is Qatar lying about its COVID-19 outbreak to avoid jeopardizing its hosting of the World Cup?","label":-1},{"text":"HIV drug combination ineffective as coronavirus treatment: study","label":-1},{"text":"Having a baby later in life may increase longevity, study suggests","label":1},{"text":"Rep. Ken Buck accuses Colorado secretary of state of sending voter registration cards to non-citizens and dead people, calls for probe","label":-1},{"text":"California braces for power shutoffs and warm, windy weekend","label":-1},{"text":"Supreme Court's first week without Ginsburg includes coronavirus, 'Remain in Mexico,' revenge porn cases","label":-1},{"text":"Military police inquired about heat rays for use on White House protesters: report","label":0},{"text":"Colorado Secretary of State accuses Congressman of ‘election misinformation’","label":-1},{"text":"Victor Davis Hanson: Turkey vs. Greece – here's why this centuries-old rivalry matters now","label":0},{"text":"China military show of force near Taiwan has experts asking if island could be the 'next Hong Kong'","label":0},{"text":"Trump says Joe Biden 'will turn Minnesota into a refugee camp'","label":-1},{"text":"In Minnesota Biden would open 'flood gates' to terrorism, Trump says","label":-1},{"text":"Angelina Jolie gives generous donation to boys’ lemonade stand raising money for Yemen","label":1},{"text":"Ilhan Omar fires back after Trump's rally attack: 'This is my country'","label":-1},{"text":"Brad Parscale faces attacks from Trump critics after hospitalization","label":-1},{"text":"How US can help China's Uighurs, who suffer disappearances, forced abortions, other atrocities","label":-1},{"text":"Pelosi, Mnuchin try to jam Senate GOP","label":-1},{"text":"German police officers suspended over pro-Nazi photos, doctored images of refugees in gas chambers","label":-1},{"text":"Explosion kills British, Australian WWII bomb specialists in Solomon Islands","label":-1},{"text":"Trump plans visit to Minnesota next week — what's at stake","label":0},{"text":"House GOP China task force releases report on combating Chinese Communist Party: 'The U.S. must act decisively'","label":1},{"text":"NFL Star Benjamin Watson: Nigeria needs justice, too, and Americans must help","label":1},{"text":"Hurricane Sally strengthens to Category 2 storm, expect life-threatening flooding: officials","label":-1},{"text":"Anthony Weiner piecing together shattered life as CEO of broken glass factory","label":-1},{"text":"IOC asked to move 2022 Olympics from China by human rights group","label":0},{"text":"GOP report claims Hunter Biden paid women linked to ‘prostitution or human trafficking ring’","label":-1},{"text":"Christina Stanton: 9\/11 radically changed my faith – and helped me endure COVID -19 almost 20 years later","label":1},{"text":"Death toll soars as Armenia-Azerbaijan conflict escalates: 'This is a fight against jihadists'","label":-1},{"text":"Will Trump change his approach to COVID after contracting virus?","label":0},{"text":"Supreme Court sides with Trump administration to not extend census count - Fox News","label":0},{"text":"ICE responds to reports officer wore NYPD jacket, says the word police is a law enforcement symbol","label":0},{"text":"Bill de Blasio excluded from Columbus Day festivities","label":-1},{"text":"Governor Cuomo claims Trump convinced American their loved ones died due to nursing home policy","label":-1},{"text":"Pennsylvania's second lady posts video of racist attack, says it is 'reflective of the times'","label":-1},{"text":"Amy Coney Barrett confirmation hearings: 5 main issues at hand","label":0},{"text":"Mark Levin asks if Joe Biden is 'still a White supremacist?'","label":-1},{"text":"Authorities at Heathrow Airport seize $2.48M from luggage of woman involved in alleged money laundering scheme","label":-1},{"text":"Trump holds slight edge over Biden among Florida seniors, poll finds","label":0},{"text":"Jeffrey Epstein estate barely able to pay bills amid accusation of misused funds","label":-1},{"text":"Ninth Circuit court rules Trump can’t divert military funds for border wall","label":0},{"text":"Amy Coney Barrett tells Democratic senator: 'I hope you aren’t suggesting I don’t have my own mind'","label":-1},{"text":"Miami Herald defends Kamala Harris from comparison to Clinton, claims she's been labeled the 'Black Hilary'","label":0},{"text":"Erin Hawley: Amy Coney Barrett confirmation fight – how did we get here?","label":-1},{"text":"Arnon Mishkin: Trump reelection in trouble, polling indicates — race is referendum on him","label":-1},{"text":"Trump touts his COVID-19 treatment in first rally since diagnosis","label":-1},{"text":"Tucker Carlson: Democrats treat first day of Amy Coney Barrett hearings like a campaign rally","label":1},{"text":"Herschel Walker: Dems pushing reparations are 'pandering for a vote'","label":-1},{"text":"How Andrew Cuomo is using COVID-19 pandemic to oppress New Yorkers","label":-1},{"text":"Biden would return to Obama-era immigration policies if elected, report says","label":0},{"text":"Ex-ICE chief Homan: 'It's terrible what's about to happen' at border under Joe Biden","label":-1},{"text":"Former ICE director blasts Biden for Obama administration’s immigration policy","label":-1},{"text":"Biden to reverse many of Trump’s immigration policies if elected","label":0},{"text":"Trump claims Biden disrespected Obama with immigration answer at debate","label":-1},{"text":"ICE arrests 176 in Operation Rise sanctuary city crackdown","label":-1},{"text":"Supreme Court agrees to hear key cases on Trump immigration policies","label":1},{"text":"Biden says he and Obama 'made a mistake' on immigration policy","label":-1},{"text":"Live updates: Trump, Biden final presidential debate in the books","label":0},{"text":"ICE launches new billboards with individuals released by sanctuary policies","label":0},{"text":"White House’s Stephen Miller warns of ‘nationwide catch and release’ if Biden is elected","label":-1},{"text":"ICE says court order forced them to release 250 immigrants with criminal histories","label":-1},{"text":"Brandon Judd: Trump is strengthening border security, keeping violent criminals and illegal drugs out of US","label":-1},{"text":"ICE operation nabs 100-plus illegal immigrants, more than 70% have criminal convictions, charges","label":-1},{"text":"France's Macron vows to crackdown on illegal immigration to counter growing 'terrorist threat'","label":-1},{"text":"Trump announces day of remembrance for Americans killed by illegal immigrants","label":-1},{"text":"ICE publishes list of criminal immigrants released after California court order","label":-1},{"text":"Biden's picks for transition team the latest sign of a radically different approach to immigration","label":0},{"text":"Only 17% of Canadians want more immigrants in 2021, as Trudeau pushes immigration plan: poll","label":0},{"text":"Protesters in Mexico burn Trump effigy at border, urge Americans to vote Biden","label":-1},{"text":"New ICE chief Tony Pham draws on refugee past as he defends agency from attacks","label":-1},{"text":"What happens to the border wall under a President Biden?","label":0},{"text":"DOJ, DHS release 'Alien Incarceration' report, say 94% of illegal aliens in custody were 'unlawfully present'","label":-1},{"text":"ICE announces crackdown on abuse of immigrant job-training program","label":-1},{"text":"Border wall construction nears 400 miles as DHS declares border ‘more secure’ than any time in US history","label":1},{"text":"Guy Benson & Juan Williams Debate Minority Support For President Trump","label":0},{"text":"Trump administration moves to bar convicted felons, gang members from asylum","label":-1},{"text":"The Squad and other Democrats ask UN to investigate alleged human rights abuses by DHS","label":-1},{"text":"Revamped US citizenship test adds questions, drawing some criticism","label":-1},{"text":"‘Angel Families’ react to President Trump’s National Day of Remembrance for Americans killed by illegal aliens","label":-1},{"text":"CBP chief warns of border 'invasion' with liberal policies, reversal of Trump-era efforts","label":-1},{"text":"Rubio: Florida's Latino voters rejected Democrats' 'crazy ideas,' and 'out of their mind' radicals","label":-1},{"text":"Ilhan Omar mobilizing progressives to push Biden further left","label":0},{"text":"Latino vote crucial as Democrats try to turn North Carolina away from Trump","label":0},{"text":"Trump administration moves to change H-1B guest worker program to prioritize higher-wage applicants","label":0},{"text":"CNN anchor attacks NBC town hall over presence of 'nodding' Trump supporter","label":-1},{"text":"Trump 'coyote' remark confuses Twitter, including Georgia state Democrat","label":-1},{"text":"Phoenix cop accused of threatening Democratic Mayor Kate Gallego","label":-1},{"text":"'Nodding lady' at Trump town hall accuses critics of targeting her employees","label":-1},{"text":"Mark Levin describes how Biden-Sanders 'unity platform' mimics 1936 Soviet Constitution","label":0},{"text":"NBC town hall attendee goes viral after she compliments Trump: 'You have a great smile'","label":1},{"text":"NY Post endorses Trump: 'Make America great again, again’ and 'tick off' Hollywood with reelection","label":1},{"text":"Competency of Kate Steinle’s alleged killer being reviewed by federal judge","label":-1},{"text":"Trump deserves 2nd term even though he’s a ‘wretched human being,’ newspaper says","label":-1},{"text":"Canada updates rules for incoming travelers to fight coronavirus, keep citizens safe","label":0},{"text":"Border Patrol finds 27 illegal immigrants trapped inside train cars in Texas","label":-1},{"text":"Maryland man charged after note discovered threatening televised execution of 'Grandpa Biden,' Harris","label":-1},{"text":"Congresswoman-elect Stephanie Bice credits 2018 midterms for 2020 GOP women House wins","label":1},{"text":"China threatens to detain innocent Americans after DOJ arrests Chinese 'spies,' Gen. Keane warns","label":-1},{"text":"Audience member nodding along with Trump during NBC town hall goes viral","label":0},{"text":"AOC won't say whether she'll support Pelosi for speaker","label":0},{"text":"AOC, socialist Dems are ‘new power’ of the party, Leader McCarthy says","label":1},{"text":"Biden taps reparations advocate for Treasury transition","label":0},{"text":"Joy Behar says Trump should be charged with ‘crimes against humanity’ over immigration policy","label":-1},{"text":"Rev. Samuel Rodriguez: Biden vs. Trump -- Why Latinos in Florida are turning to Trump","label":0},{"text":"Doug Schoen: Trump vs. Biden – Here's who won the debate and what it means for the 2020 election","label":0},{"text":"Victor Davis Hanson: What Donald Trump, classic Westerns' heroes and these American generals have in common","label":1},{"text":"Kristen Day & Xavier Bisits: Abortion issue costs Democrats Hispanic votes","label":-1},{"text":"Samuel Rodriguez: What Biden should learn about how Latinos voted in 2020","label":0},{"text":"Portland's mayor blames 'white supremist organizations' for potential violence after election","label":-1},{"text":"John Legend appears to jab at Trump fans Ice Cube, Lil Wayne during rally for Kamala Harris","label":-1},{"text":"Lil Pump endorses Donald Trump for president, prompts record label to declare pro-Biden stance","label":1},{"text":"'Real Housewives' star Teresa Giudice is dating a new man after split with Joe","label":0},{"text":"California Gov. Newsom eases penalties for former felons, including immigrants facing deportation","label":1},{"text":"Young Kim, California Republican elected to House, calls for unity in video to constituents","label":1},{"text":"Jim Acosta says Trump will just be another 'crackpot on internet' after Jan. 20","label":-1},{"text":"Border Patrol agents stop smuggling case where child was separated from parents","label":-1},{"text":"Trump administration proposes change to rules governing international students in US","label":0},{"text":"Border Patrol agent fatally shoots man suspected of human smuggling in Texas","label":-1},{"text":"Samantha Bee fawns over far-left Democrats who 'really freak the f—k out of Republicans'","label":-1},{"text":"Kimberley Strassel: Election 2020 -- Pelosi's top priority was remaking our electoral system. COVID helped her","label":1},{"text":"Who is MJ Hegar? Top things to know about Texas' Senate candidate","label":1},{"text":"Mark Morgan slams Twitter as 'un-American' for suspending his account over tweet on border wall","label":-1},{"text":"Rapper Lil Wayne meets with Trump: 'He listened to what we had to say'","label":0},{"text":"FBI holding laptop allegedly containing Hunter Biden business emails: officials","label":0},{"text":"Daniel Allott: Biden vs. Trump – the unspoken issues costing Dems dearly in rural, industrial America","label":-1},{"text":"Tokyo Olympics try to get word out about COVID-19 measures","label":0},{"text":"Justice Amy Coney Barrett to hear first Supreme Court oral arguments Monday","label":0},{"text":"Who is Steve Daines? 4 things to know about the US senator from Montana","label":0},{"text":"Ben Shapiro: 2020 election's one big message -- voters refuse to accept woke media's narrative on race","label":-1},{"text":"Pelosi labels Barrett 'an illegitimate Supreme Court justice'","label":-1},{"text":"If elected, Biden plans task force to reunite 545 children separated from parents at border","label":0},{"text":"Candace Owens on Lil Wayne's Trump support: Liberals laughed at idea of 'Black Exit' by Dems","label":-1},{"text":"Leslie Marshall: Amy Coney Barrett's confirmation is proof that we need a Biden victory in 2020","label":0},{"text":"Biden target of profane graffiti in Portland, as crowd smashes windows at Democratic campaign office","label":-1},{"text":"Tripadvisor warns users about Thai hotel after American jailed over critical review","label":-1},{"text":"Who is Mark Kelly? Things to know about Arizona's Democratic Senate candidate","label":0},{"text":"Who is Lindsey Graham? 5 things to know about the SC senator","label":0},{"text":"Geraldo Rivera: Trump 'senses' that unexpected minority support could fuel victory over Biden","label":1},{"text":"Tokyo Olympics to give refunds to ticket buyers in Japan","label":0},{"text":"Illegal immigrant who murdered California cop gets plea deal","label":-1},{"text":"Portland celebrates Biden win with illegal street racing, crowds outside ICE chanting 'come out and fight'","label":-1},{"text":"Final Trump-Biden presidential debate: Top 5 moments","label":1},{"text":"Celebrities who said they'd leave America in 2016 if Trump was elected -- and didn't","label":-1},{"text":"AOC's new 'Squad' members want to defund police, much more","label":0},{"text":"50 Cent hints Lil Wayne made a mistake meeting President Trump: 'Oh no'","label":-1},{"text":"Ed Rollins: Trump is presidential debate underdog. If he loses this faceoff, he's toast. Here's how to win it","label":-1},{"text":"Jessica Tarlov: 2020 House races tell the true story of America's politics today – don't overlook them","label":0},{"text":"Ice Cube: 'I'm not playing politics' by working with Trump campaign on 'Platinum Plan' for Black Americans","label":-1},{"text":"Liberian GOP candidate in Minnesota troubled by 'anti-American rhetoric'","label":-1},{"text":"Suspect in teacher's beheading in France was Chechen teen","label":-1},{"text":"Ex-UFC fighter Zelim Imadaev uses social media to praise Chechen refugee for beheading: report","label":-1},{"text":"Khabib Nurmagomedov submits Justin Gaethje at UFC 254, announces retirement","label":0},{"text":"Paris teacher beheading: Police investigating dozens who allegedly issued messages of support for suspect","label":-1},{"text":"Phil Hawes has 18-second knockout in UFC debut","label":0},{"text":"France moves to expel 231 radicalized foreigners after assassination of teacher","label":-1},{"text":"Trump vows ‘comeback’ in campaign’s closing message, claims Biden will ‘lock down your state’","label":0},{"text":"This Day in History: Oct. 27","label":0},{"text":"Laura Ingraham: Biden administration set to engineer 'great American sellout' of working, middle class","label":-1},{"text":"New York GOP congresswoman-elect reveals interest in forming House anti-socialist 'Squad'","label":1},{"text":"France pulls ambassador to Turkey after Erdogan calls for mental health check for Macron","label":0},{"text":"Minnesota 'Squad' member says Trump attack on her during campaign was a mistake","label":-1},{"text":"Muslims call for French goods boycott to protest caricatures","label":-1},{"text":"Tucker Carlson: Joe Biden's agenda is meant for America's unhappy rich ladies and no one else","label":-1},{"text":"Susan Collins: 'Some parts of our country' there is systemic racism, not in Maine","label":-1},{"text":"Reporter's Notebook: Peter Kassig's selfless aid and brutal murder left a profound impact on this journalist","label":1},{"text":"Pope Francis congratulates Biden on election win during phone conversation","label":1},{"text":"Trump administration considers early biometric screening for visa seekers","label":0},{"text":"Ricky Martin says it's 'super sad' to see fellow Latinos back Donald Trump","label":-1},{"text":"Pope Francis supports law for same-sex civil unions in new documentary: ‘They are children of God’","label":1},{"text":"Ingraham: Biden's COVID shutdown, globalist 'reset' plans will cripple American freedoms, economy","label":-1},{"text":"Pope Francis returns to not wearing a mask amid growing criticism","label":-1},{"text":"Fred Fleitz: Sudan-Israel agreement normalizing relations marks a revolutionary change — all thanks to Trump","label":1},{"text":"Erekat, longtime spokesman for the Palestinians, dies at 65","label":0},{"text":"Alleged killer of Houston police sergeant could face death penalty","label":-1},{"text":"Inmates need priority access to coronavirus vaccine, AMA says","label":0},{"text":"Going Beyond Inclusion with AT&T CEO Anne Chow","label":0},{"text":"Houston sergeant killed in shooting ‘died protecting me and my family,' estranged wife of alleged killer says","label":-1},{"text":"Shooting at Texas nightclub leaves 3 dead, 1 critically injured: police","label":-1},{"text":"Ilhan Omar easily wins reelection in Minnesota","label":1},{"text":"Virginia robbery suspect dead after wounding officer","label":-1},{"text":"Colorado inmate dies after experiencing coronavirus symptoms: officials","label":-1},{"text":"CNN's Van Jones cries on-air amid emotional response to Biden victory: 'Being a good person matters!'","label":1},{"text":"Biden faces backlash for saying 'America was an idea' that 'we've never lived up to'","label":-1},{"text":"Houston police sergeant's funeral set for Thursday after fatal shooting","label":-1},{"text":"Anti-human trafficking groups push politicians, media companies to fight QAnon conspiracy theories","label":-1},{"text":"'Haunted' New York castle auction ending on Halloween","label":0},{"text":"New York grocery store threatened with boycotts after offering discount to Trump supporters","label":-1},{"text":"Arnold Schwarzenegger voices frustrations with lack of patriotism in America: 'It doesn't make any sense'","label":-1},{"text":"Obama says controversy over infamous ‘bitter’ comments about small-town Americans still ‘nags at me’","label":-1},{"text":"Gigi Hadid encourages fans to vote while showing off her post-baby body: 'I’m proud of you'","label":1},{"text":"Reporter's notebook: 107-year-old casts vote in 22nd straight presidential election","label":0},{"text":"The Power of Prayer and the Story of Fr. Patrick Peyton, aka, “The Rosary Priest”","label":1},{"text":"Battle brewing over Biden Cabinet picks, priorities, as far left and moderates launch opening salvos","label":-1},{"text":"Longtime Minnesota sports columnist Sid Hartman dies at 100","label":0},{"text":"Judge Andrew P. Napolitano: Americans are in two politically warring camps — each side hates the other","label":-1},{"text":"Richard Fowler: Biden’s call for unity a welcome change from pain, mistrust and division under Trump","label":1},{"text":"Teófimo López win excites Honduran Americans amid pain","label":1},{"text":"Xavier Becerra, possible Biden AG pick, once said illegal immigration should be decriminalized","label":-1},{"text":"David Bossie: Top takeaways from Trump-Biden debate — one candidate exceeds expectations","label":1},{"text":"Liz Peek: Winners and losers at final presidential debate – What the Trump, Biden scorecard looks like now","label":0},{"text":"Man oh mandate","label":0},{"text":"Border Patrol arrests nearly 300 illegal immigrants in 18 hours","label":-1},{"text":"Trump administration moves to limit work permits for immigrants with deportation orders","label":0},{"text":"Border Patrol reports shooting near US-Mexico crossing in California","label":0},{"text":"RNC spends $9M for final battleground TV ads on health care","label":0},{"text":"Hispanic Democrat says far-left socialist message is 'killing us': report","label":-1},{"text":"'Saturday Night Live' airs celebratory 'Weekend Update' segment mocking Trump's loss hours after Biden's win","label":-1},{"text":"Democratic representatives say Hispanic populations losses reflect party's poor messaging","label":-1},{"text":"Georgia's Perdue urges voters to send him back to DC to fight AOC, 'radical leftists'","label":-1},{"text":"Sunny Hostin blasts 'un-American' Trump voters who backed 'racist,' 'homophobic' candidate","label":-1},{"text":"Judge orders Trump administration to stop deporting unaccompanied minors amid coronavirus pandemic","label":0},{"text":"Ingraham: Democrats hiding 'true agenda' from middle, working class by trotting out Biden cliches","label":-1},{"text":"Texas man granted US citizenship -- 53 years after serving in Vietnam, receiving Purple Heart","label":1},{"text":"Surge in early voting gives Democrats competitive edge in Texas","label":1},{"text":"Maren Morris endorses Joe Biden: ‘I believe that country music is for everyone, so is this country’","label":1},{"text":"Sen. Thom Tillis: Amy Coney Barrett incredibly qualified for Supreme Court, Dems' radical agenda alarming","label":1},{"text":"Trump slams Cuomo over 'apology tour' as NY governor warns public should be 'skeptical' of COVID vaccine","label":-1},{"text":"Biden says Catholic faith guides policies but gets hit on abortion, religious freedom","label":1},{"text":"Mollie Hemingway: 'Media by and large ran the Biden campaign,' downplayed far-left proposals","label":0},{"text":"Cuomo, other governors to meet for coronavirus policy alignment","label":0},{"text":"Chef reveals menu of Kamala Harris victory dinner at Delaware restaurant: 'It was very last-minute'","label":0},{"text":"Former McCain adviser says Democratic win in Arizona may be senator's 'revenge'","label":-1},{"text":"Kamala Harris makes history as first female, Black vice president","label":1},{"text":"Paul Batura: Who is Alex Trebek? The perfect guest in our homes, through good times and bad","label":1},{"text":"Former NFL player Emmanuel Acho tackles racism in new book","label":-1},{"text":"Rev. William J. Barber, II, Sen. Sherrod Brown: Why workers will decide the 2020 election","label":0},{"text":"Perdue links Ossoff to Schumer and Pelosi in his first Georgia runoff ad","label":0},{"text":"Rick Scott campaigns in Georgia for Loeffler and Perdue as big names descend on Peach State","label":0},{"text":"Cal Thomas: On which issues would Biden be willing to compromise and find common ground with Republicans?","label":0},{"text":"New Pentagon adviser could push US troop withdrawals before Trump’s departure","label":0},{"text":"Michael Moore calls for Joe Biden to eliminate the Electoral College, adopt democratic socialism","label":0},{"text":"In Georgia Senate races, it's socialism versus health care and the coronavirus","label":0},{"text":"RNC to spend $25M on TV ads in battleground states in final stretch to Election Day","label":0},{"text":"How Sanders, AOC and 'The Squad' plan to make Biden the most liberal president ever","label":0},{"text":"Rep. Mo Brooks: I support Donald Trump because he stands for security, prosperity and liberty","label":1},{"text":"California Republican Darrell Issa headed back to Congress","label":0},{"text":"Sen. Rick Scott: I voted for Trump because the 2020 election is about my family and yours","label":1},{"text":"Biden's new chief of staff praised de Blasio for holding large dinner to put COVID fears to rest","label":1},{"text":"#WalkAway Founder Brandon Straka: Hillary got my vote in 2016, here’s why I'm voting for Trump in 2020","label":0},{"text":"Pompeo dismisses flak over 'second Trump administration' remark","label":-1},{"text":"Jury still out on Sweden’s ‘experiment’ on coronavirus pandemic management, experts say","label":0},{"text":"Fox News Voter Analysis: Trump sees strong support from base as moderates back Biden","label":1},{"text":"Tucker Carlson: What we learned at the final presidential debate","label":0},{"text":"Fox News voter analysis: Biden’s path to the presidency","label":0},{"text":"Senate Power Rankings: Fifty-one-derful?","label":1},{"text":"Hannity: The country's most critical institutions have failed us","label":-1},{"text":"Latino voters supported Trump out of fear of Democratic socialists","label":-1},{"text":"AOC rips MSNBC's Claire McCaskill: 'Why do we listen to people who lost elections?'","label":-1},{"text":"Qatar says airport officials behind strip searches referred to prosecutors","label":0},{"text":"Alyssa Milano says voters will choose between 'America or Trump' in 2020 election: 'You can't love both'","label":-1},{"text":"Qatar apologizes after women strip-searched at airport before flight to Australia","label":0},{"text":"Australian police investigating after women 'strip-searched' at Qatar airport after newborn found abandoned","label":-1},{"text":"Dr. Jill Biden avoids tough questions on 'The View' as hosts skip past Hunter Biden allegations","label":-1},{"text":"'Anonymous' anti-Trump official revealed as CNN pundit Miles Taylor, who lied about writing NYT op-ed","label":-1},{"text":"New York Times columnist Cohen deletes tweets that 'did not meet' paper's standards","label":-1},{"text":"15 arrested in 'maritime smuggling event' near Mar-a-Lago","label":-1},{"text":"New arrest after France church attack, security tightened","label":-1},{"text":"Larry Elder: Why Trump deserves four more years","label":1},{"text":"Guatemala digs through landslide where 100 believed buried","label":-1},{"text":"Are Mexico's stringent gun control laws aiding a rise in cartel violence?","label":-1},{"text":"Explosive charges from nurse at immigrant detention center","label":-1},{"text":"U.S. reimposes \"public charge\" wealth test for immigrants","label":-1},{"text":"Appeals court upholds ban on holding migrant kids in hotels","label":-1},{"text":"Remembering New York's worst terror attack before 9\/11","label":-1},{"text":"Amnesty Int'l slams Palantir over company's work for ICE","label":0},{"text":"ICE billboards of immigrants denounced as \"wildly inappropriate\"","label":-1},{"text":"15-year-old girl facing deportation after hospital arrest","label":-1},{"text":"Trump-Biden race to dictate fate of U.S. immigration for generations","label":0},{"text":"How the outlawed practice of redlining is still hurting Black Americans","label":-1},{"text":"Migrant caravan sets off from Honduras with eyes on U.S. border","label":0},{"text":"Melania Trump takes aim at critics, migrant children in secret recordings","label":-1},{"text":"2020 Daily Trail Markers: Republicans are narrowing voter registration gaps in swing states","label":0},{"text":"2020 Daily Trail Markers: Pence and Harris are set to face off in their only debate","label":0},{"text":"2020 Daily Trail Markers: Debate prep is in full swing for Trump and Biden","label":0},{"text":"Ex- CIA head Brennan on ethics of intel, challenges to democracy","label":-1},{"text":"Mexico asks U.S. to \"clarify\" alleged hysterectomies on migrant women in ICE custody","label":-1},{"text":"Court OKs end to humanitarian protections for 300,000 immigrants","label":-1},{"text":"NYPD officer accused of acting as agent of Chinese government","label":-1},{"text":"Alexandria Ocasio-Cortez rips Trump over his tax returns","label":-1},{"text":"Court orders Trump admin to extend census count","label":0},{"text":"Incumbent Trump banks on fear and anxiety to motivate voters","label":-1},{"text":"Trump holds indoor campaign rally near Las Vegas","label":0},{"text":"Judges halt Trump plan to upend congressional apportionment","label":0},{"text":"Federal court rebuffs Trump effort to move up census deadlines","label":0},{"text":"IRS: Up to 9 million people need to claim stimulus checks","label":0},{"text":"Decision to speed up 2020 census not made by Census Bureau, internal report says","label":0},{"text":"Lawmakers mourn sudden death of Ruth Bader Ginsburg","label":-1},{"text":"Millions of Americans still may be eligible for stimulus check","label":0},{"text":"Alumni at Amy Coney Barrett's undergrad school sign letter of concern","label":-1},{"text":"Judge temporarily stops Census Bureau ending count month early","label":0},{"text":"Jim Belushi, cannabis farmer","label":0},{"text":"Kamala Harris is on the cover of Elle magazine","label":0},{"text":"Supreme Court Justice Ruth Bader Ginsburg has died","label":0},{"text":"Western wildfires turn more deadly, spur mass evacuations","label":-1},{"text":"7 takeaways from the NYT report on Trump's tax returns","label":0},{"text":"What to expect from the New York Film Festival amid the pandemic","label":0},{"text":"American faces prison over bad review of resort in Thailand","label":-1},{"text":"Facebook removes Trump ads about Biden, COVID-19 and refugees","label":0},{"text":"8,800 migrant kids have been expelled under pandemic border policy","label":-1},{"text":"U.S. stops holding migrant children in hotels","label":0},{"text":"Moderator Susan Page reveals \"big\" topic missed during VP debate","label":-1},{"text":"Newcomer with QAnon ties wins GOP Senate primary in Delaware","label":0},{"text":"Newcomer Witzke wins GOP US Senate primary in Delaware","label":0},{"text":"U.S. unveils restrictions on H-1B foreign work visas","label":0},{"text":"Trump administration sets refugee cap at 15,000, a record low","label":0},{"text":"Officials looking into video of ICE stopping a Black jogger","label":0},{"text":"Biden makes first trip to Florida amid questions about Latino support","label":0},{"text":"Why many parents may have to quit working as school resumes","label":0},{"text":"Twitter launches election hub to fight disinformation","label":-1},{"text":"China, Russia and white supremacy top DHS' first public threat assessment","label":-1},{"text":"Toxic waste in the Tijuana River spilling into California","label":-1},{"text":"Biden makes his first visit to Florida as Democratic nominee","label":0},{"text":"2020 Daily Trail Markers: Debate night fundraising push has already begun","label":0},{"text":"2020 Daily Trail Markers: 2nd presidential debate in doubt","label":-1},{"text":"Guatemala turns around U.S.-bound migrant caravan from Honduras","label":0},{"text":"Greek court rules far-right party operated as a criminal organization","label":-1},{"text":"Thousands spend another night in the open after fires destroy refugee camp","label":-1},{"text":"Trump's campaign strategy \"is to create panic,\" Jeh Johnson says","label":-1},{"text":"Pope says pandemic has exposed market capitalism's failure","label":-1},{"text":"As country crumbles, Syrians face \"terrifying\" option of refugee life","label":-1},{"text":"Emotional coping tactics for young kids","label":0},{"text":"Sesame and the IRC join forces to help Syrian refugee children","label":1},{"text":"Women's rights are faltering, United Nations says","label":-1},{"text":"When 60 Minutes met the Nobel Peace Prize winners","label":0},{"text":"Nadia Murad's mission to hold ISIS accountable","label":1},{"text":"Trump says Biden will flood Minnesota with \"refugees\"","label":-1},{"text":"COVID creeps into a sprawling Syrian refugee camp in Jordan","label":-1},{"text":"Syria may only be counting 1.25% of its actual coronavirus deaths","label":-1},{"text":"Immigrant mother says she's grateful to be in America","label":1},{"text":"Supreme Court allows census count to end October 31","label":0},{"text":"Biden continues to outspend Trump on TV ads","label":0},{"text":"Border arrests rise for fifth consecutive month","label":-1},{"text":"How the GOP became the party of Trump","label":1},{"text":"3 million voters registered after 2016 — Dems now hope to flip Texas","label":1},{"text":"Where Trump and Biden stand on major issues","label":0},{"text":"Supreme Court agrees to hear challenges to Trump immigration policies","label":1},{"text":"Biden plans sweeping reversal of Trump's immigration agenda","label":0},{"text":"Migrant families face \"many dangers\" along U.S. border","label":-1},{"text":"Final presidential debate: Fact checking Trump and Biden","label":0},{"text":"ICE moves to quickly deport more immigrants without court hearings","label":-1},{"text":"Revised U.S. citizenship civics test includes more questions","label":0},{"text":"Judge blocks Trump's \"public charge\" wealth test for green cards","label":-1},{"text":"Nevada 2020 election results","label":0},{"text":"Texas facility now holding soon-to-be expelled migrant families","label":-1},{"text":"DHS chief claims some deported parents \"have chosen to separate\" from their kids","label":-1},{"text":"Supreme Court to hear case over congressional seat count","label":0},{"text":"DHS employees urge leadership to rescind \"illegal gag order\" on leaks","label":-1},{"text":"New documents reveal chaos behind Trump's family separation policy","label":-1},{"text":"Hundreds of parents separated from kids at the border remain \"unreachable\"","label":-1},{"text":"Trump: Separated children were \"so well taken care of\"","label":1},{"text":"Laura Ingraham says Trump needs to act with \"grace\" if he loses election","label":-1},{"text":"Ken Burns says theme of race in his works was instilled in him as a child","label":0},{"text":"How Trump used COVID-19 to shut U.S. borders to migrant minors","label":0},{"text":"NXIVM founder Keith Raniere sentenced to 120 years in prison","label":-1},{"text":"Judge rules Wolf did not have authority to restrict DACA","label":-1},{"text":"Black scholars band together to fight \"cultural disinformation\"","label":-1},{"text":"Wisconsin voters who flipped from Obama to Trump","label":0},{"text":"Battleground Tracker: Tight race in Florida, Georgia, North Carolina","label":0},{"text":"Joe Biden's Scranton is filled with signs and anxious Democrats","label":-1},{"text":"Joe Biden projected winner of presidency, edging out Trump in Pennsylvania","label":1},{"text":"Barack Obama speaks out on politics, the presidency, and Donald Trump","label":0},{"text":"Ken Burns on America, selling his first film and more","label":0},{"text":"COVID-19 considered a top issue in GOP ads in just 2 battleground states","label":0},{"text":"Victim's photo found on phone of teen who beheaded teacher","label":-1},{"text":"All four members of the \"The Squad\" reelected","label":0},{"text":"Scores killed in massacre amid intense conflict in Ethiopia","label":-1},{"text":"Florida unions reach out to infrequent voters in final stretch of campaign","label":0},{"text":"2020 Daily Trail Markers: Senate Democratic hopefuls are raising serious cash. They're also spending it.","label":0},{"text":"Jill Biden could become the only first lady to work paid job outside White House","label":0},{"text":"Biden takes deliberate approach to foreign calls amid transition","label":0},{"text":"Palestinians hope for \"destructive policies of Trump to totally stop\"","label":-1},{"text":"Pope endorses same-sex civil unions for the first time as pontiff","label":1},{"text":"Battleground states to watch","label":0},{"text":"2020 Daily Trail Markers: Obama tells \"60 Minutes\" he's \"more troubled\" by GOP members \"humoring\" Trump","label":-1},{"text":"13 battleground states to watch","label":0},{"text":"DOC NYC documentary film festival goes online","label":0},{"text":"Vice President-elect Kamala Harris, a woman of many firsts","label":1},{"text":"Kamala Harris to make history as the first Black woman vice president","label":1},{"text":"Winning the votes of suburban women in battleground states","label":1},{"text":"Sophia Loren on \"The Life Ahead\"","label":0},{"text":"2020 Daily Trail Markers: How ads from the two campaigns differ in the final sprint","label":0},{"text":"IRS says time running out for people to get stimulus check","label":-1},{"text":"Nancy Pelosi seeks reelection as speaker of the House","label":0},{"text":"Police hunt for Greek far-right party member evading prison sentence","label":-1},{"text":"Pie art: One baker's delectable designs","label":1},{"text":"Book excerpt: The origin story of Estée Lauder, from \"The Company I Keep\"","label":0},{"text":"Examining the process and history behind the way ballots look","label":0},{"text":"The election aftermath, and the power of the vote","label":0},{"text":"Arizona in play for both Biden and Trump","label":0},{"text":"Judge says border agents can't use COVID-19 order to expel migrant kids","label":-1},{"text":"Survivors \"in shock\" after 94 drown in two shipwrecks","label":-1},{"text":"140 Europe-bound migrants drown in deadliest wreck of year","label":-1},{"text":"Qatar may charge officials behind forced vaginal exams at airport","label":-1},{"text":"Qatar condemned for \"disturbing\" exams of women passengers","label":-1},{"text":"Eta leaves 150 dead or missing in Guatemala, president says","label":-1},{"text":"Second suspect in custody in suspected terror attack in France","label":-1},{"text":"Donald Trump Gains Votes from Asian Immigrants","label":1},{"text":"Trump Weighs More Crackdowns on Welfare-Dependent Immigration","label":-1},{"text":"Ilhan Omar: Hate for Me Is ‘Anti-Muslim, Anti-Immigrant, Anti-Black, Sexist’","label":-1},{"text":"NBC: VP Debate ‘Living Encapsulation’ of U.S. ‘Demographic Transformation’","label":0},{"text":"Amnesty Groups Demand Bailout for Cities, States that Rely on Illegal Migrants","label":-1},{"text":"Fact Check: Joe Biden, Eva Longoria Attack Donald Trump over Obama Administration Putting Kids in Cages","label":-1},{"text":"Cato: Immigration Slowed During 2019 Economic Boom","label":0},{"text":"Politico: ‘Union Members Snub Biden for Trump’","label":-1},{"text":"Immigration Reformers OK Judge Amy Coney Barrett","label":1},{"text":"Judge Blocks Trump Administration Effort to Fund Immigration Services","label":-1},{"text":"Study: Joe Biden Migration Plan Could Bring 52 Million Foreign Nationals to U.S.","label":0},{"text":"Axios: New York City Shrinks Due to Lower Immigration","label":-1},{"text":"Charles Hurt: Donald Trump Should Nominate Miguel Estrada to Supreme Court","label":0},{"text":"Trump Further Reduces Obama’s Refugee Inflow to U.S. by 80 Percent","label":0},{"text":"48 Migrants Found in Crowded New Mexico Stash House near Border","label":-1},{"text":"Amy Schumer Posts Staged Photo of Mannequins in Cages in Get Out the Vote Screed Against America’s ‘Caste System’","label":0},{"text":"Exclusive Excerpt—Rep. Matt Gaetz: ‘Firebrand: Dispatches from the Front Lines of the MAGA Revolution’","label":1},{"text":"Lost Migrant Starts Fire in California, 13 More Rescued from Heatwave","label":-1},{"text":"DHS Denies Democrat Claims It Downplays the Threat of White Terrorists","label":-1},{"text":"Project Veritas Exposes Ilhan Omar Allies in Alleged Ballot Harvesting Operation in Minnesota","label":-1},{"text":"ABC News: Arizona’s Changing Demographics Helping Democrats","label":1},{"text":"Report: Illegal Boat Migrants Sign Slave Labour ‘Pact’ with Traffickers to Reach UK","label":-1},{"text":"Law Professors: Let Immigrants Become President by Amending Constitution","label":0},{"text":"Kamala Harris Courts Mormon Voters Ahead of VP Debate in Salt Lake City","label":1},{"text":"Sanctuary Los Angeles Frees Illegal Aliens Charged with Murder, Sex Crimes","label":-1},{"text":"Report: U. of New Hampshire Prof Posed as ‘Woman of Color’ on Twitter","label":0},{"text":"Pew Research: Mass Immigration Drives Up Democrat Support in Swing States","label":1},{"text":"Joe Biden Promises to Let Mayors Import Foreign Workers","label":1},{"text":"Glenn Beck: We Need One Billion People in the U.S.","label":0},{"text":"Farage Watched French Navy Abandon Struggling Migrant Vessel in English Channel","label":-1},{"text":"AOC Sounds the Alarm in Wake of Ruth Bader Ginsburg’s Death: ‘November’s About Survival’","label":-1},{"text":"Survey: Hispanic Americans Most Opposed to Illegal Immigration, Defunding Police","label":-1},{"text":"Charles Hurt — Leftist Hatred Hits Its Apex: Trump-Haters Wishing POTUS Dead","label":-1},{"text":"Watch: Chad Wolf’s DHS Confirmation Hearing","label":0},{"text":"Democrats Demand Investigation of ‘Mass Hysterectomies’ of Migrant Women","label":-1},{"text":"Business Slams Draft Curbs on White-Collar Illegal Migrants","label":-1},{"text":"Trump’s New Supreme Court List Includes Diverse Array of Conservative All-stars","label":1},{"text":"Republicans Decry Nancy Pelosi for Withholding Coronavirus Aid for Political 'Expediency'","label":-1},{"text":"Republicans, Democrats Seek to Widen H-2B Visa Program as 20.6M Americans are Jobless","label":-1},{"text":"Pope Francis Denounces Rise of Populist Nationalism","label":-1},{"text":"Left-Wing Author: We Need One Billion People to Fight China","label":-1},{"text":"Double Standard: Joe Biden’s Catholic Faith ‘Informs His Values,’ Amy Coney Barrett’s Is a Threat","label":-1},{"text":"Ex-Equality Tsar Trevor Phillips Criticises 'Woke Ultras' Trying to Erase British History","label":-1},{"text":"Presidential Debates Ignore '2000-Lb Elephant' of Immigration","label":-1},{"text":"‘Turning Point for the Nation’: Pro-Life Leaders Urge Trump to ‘Move Quickly’ to Fill Supreme Court Vacancy","label":1},{"text":"UK Government Importing Asylum Seekers Directly from Greece Under ‘Family Reunification’","label":0},{"text":"Donald Trump Touts ‘Pro-American Immigration’ Strategy","label":1},{"text":"Census Bureau: U.S. Household Income Jumped 7 Percent in 2019","label":0},{"text":"GOP Senators Ask Feds to Probe Democrat Plan that Gives American Jobs to Illegal Aliens","label":-1},{"text":"Washington Post: Only ‘Bigots’ Oppose Large Refugee Inflows","label":-1},{"text":". UN Insists Record Boat Migrant Numbers 'Not a Threat' to Britain","label":1},{"text":"France Demands Brussels Force Every EU Nation to Take Third World Migrants","label":-1},{"text":"House Democrats Hide Amnesty, White-Collar Inflows in Coronavirus Bill","label":-1},{"text":"Judges OK Donald Trump Decision to End TPS Amnesty for 300,000 Migrants","label":1},{"text":"Exclusive–Ron DeSantis: E-Verify Critical to Ensure Americans Get Jobs in Pandemic, Not Cheap Foreign Labor","label":1},{"text":"Donald Trump’s Judges Fill Immigration Courts","label":0},{"text":"Biden: My Immigration Policy Will Protect Foreign Families","label":1},{"text":"Matt Gaetz: Trump’s Nominee ‘Gives Us the Chance to Reshape Jurisprudence’","label":1},{"text":"Over 100 Migrants Jump Overboard from NGO Vessel to Reach Italy","label":0},{"text":"8 Migrants Found in Towed Boat in California near Border","label":0},{"text":"Swedish Police: New Gang Culture Emerged from Second-Generation Migrants","label":-1},{"text":"Migrant Under Deportation Order Turns Himself in After Murder of Priest","label":-1},{"text":"63 Arrested in Mountain Smuggling Operations in New Mexico near Border","label":-1},{"text":"Alexandria Ocasio-Cortez Says She Is Voting in Person","label":0},{"text":"34 Migrants Found in Tractor-Trailer 80 Miles into Texas","label":0},{"text":"Michael Rapaport Hammers AOC over NYC’s Surge in Shootings: ‘You Never Bring That Stuff Up for Some Reason’","label":-1},{"text":"Jesuit Cardinal: Europe Must ‘Open the Doors’ to Migrants","label":0},{"text":"Left: Trump Equals Hitler for Saying ‘Good Genes’; Obama Used Same Phrase","label":-1},{"text":"Sammy’s Mexican Grill Owner Thrills Latinos at Trump Roundtable","label":1},{"text":"ICE Billboards Expose Pennsylvania’s Sanctuary Illegals","label":-1},{"text":"WashPost: Kenosha Riot Casualties Lived Poor, Chaotic Lives in Outsourced City","label":-1},{"text":"CA Gov. Newsom Signs Bill Establishing Taxpayer-Subsidized Transgender Equity Fund","label":0},{"text":"Pollak: Democrats Threatened to Pack the Court Long Before Ginsburg’s Death","label":-1},{"text":"Tom Cotton Confident Trump Will Peacefully Transfer Power in 2025","label":1},{"text":"Hungary Vows to ‘Protect Nation’s Interests’ as EU Court Strikes Down Soros Crackdown","label":-1},{"text":"MSM Catches up to Farage, Finally Reports Alleged Refugees Evading Authorities","label":-1},{"text":"NYT: Elites ‘Ghost’ Their Illegal Migrants in Coronavirus Crash","label":-1},{"text":"Donald Trump Nominates Amy Coney Barrett to the Supreme Court","label":0},{"text":"25 Questions Kamala Harris Should Be Asked in the Debate","label":0},{"text":"Foreign Workforce in U.S. Shrinks as Foreign Students Stay Away","label":-1},{"text":"25 Questions Joe Biden Should Be Asked in the Debate","label":0},{"text":"Agency Officials Offer Surprise Giveaway to 400,000 Indian, Chinese White-Collar Visa Workers","label":1},{"text":"Donald Trump Slashes Corporate Outsourcing to India’s H-1B Gig-Workers","label":-1},{"text":"Trump Gets Pennsylvania Opportunity as Democrats Endorse H-1B Outsourcing","label":1},{"text":"Report: Illegal Alien Arrested for Allegedly Ambushing Arizona Officers","label":-1},{"text":"Illegal Alien MS-13 Gang Members Charged with Murdering 16-Year-Old","label":-1},{"text":"29 Migrants Found Locked in Belly-Dump Trailer at Texas Immigration Checkpoint near Border","label":-1},{"text":"Illegal Alien Brothers Accused of Raping 10-Year-Old Girl in Louisiana","label":-1},{"text":"Two Romanians Arrested After Illegally Crossing Canadian Border to U.S.","label":-1},{"text":"Deported Child Rapist Arrested in Texas After Illegally Crossing Border","label":-1},{"text":"35 Migrants Found During 5 Stash House Raids in Texas near Border","label":-1},{"text":"Illegal Alien Accused of Assault Freed 10 Times by Sanctuary New York City","label":-1},{"text":"Kobach: Biden Would Have No Authority to Impose a National Mask Mandate","label":-1},{"text":"Hungary Strikes Back Against E.U. ‘Open Borders’ Propaganda","label":-1},{"text":"Hollywood Celebrities Mock Stephen Miller After Positive COVID Test: 'Deadly Virus Has Infected a Worse Deadly Virus'","label":-1},{"text":"GOP's Voter Registration Wins in Pennsylvania Signal Close 2020 Race","label":0},{"text":"Pope Francis: Resistance to Immigration Is a ‘Primal’ Reaction","label":-1},{"text":"13 Migrants Found in Sealed Cardboard Boxes at Texas Checkpoint","label":0},{"text":"Exclusive: Reformers Issue Pro-U.S. Worker Immigration Blueprint for Trump, Congress to Adopt","label":1},{"text":"42 Migrants Found in Horse Trailer near Inland Texas Checkpoint","label":0},{"text":"Report: Feds Plan ICE Raids on Criminal Illegal Aliens in Sanctuary Cities","label":-1},{"text":"Flashback: Seven 9\/11 Hijackers Overstayed Visas Due to Loophole Used by Over Half a Million Each Year","label":-1},{"text":"Over 125 Illegal Aliens, Including Convicted Murderers, Arrested After Sanctuary California Set Them Free","label":-1},{"text":"Korean Illegal Aliens Arrested at Georgia Plant that Took $300M in Taxpayer-Funded Subsidies","label":-1},{"text":"Illegal Aliens Accused of Assault, Theft Arrested After North Carolina Sanctuary County Set Them Free","label":-1},{"text":"Pew: Hispanic Voters Rank Economy, Health Care as Top 2020 Issues","label":0},{"text":"Moody’s: Joe Biden Will Boost GDP via More Immigration, More Free Trade","label":1},{"text":"Virginia County Frees Over 900 Criminal Illegal Aliens in Less than Two Years","label":-1},{"text":"Joe Biden: ‘No Deportations’ for Illegal Aliens Until They Commit a Felony","label":-1},{"text":"Deported Child Sex Offender Arrested Moving Around Texas Checkpoint","label":-1},{"text":"New York Times: More than 60 Percent of Latinos Reject Progressives’ Identity Politics","label":-1},{"text":"Peter Navarro: Trump Up Against ‘Four Corners’ of America – Hollywood, Silicon Valley, Wall Street, NBA","label":-1},{"text":"White House: Border Wall Grows 10 Miles Per Week","label":0},{"text":"Populist Joe Biden: 2020 is ‘Between Scranton and Park Avenue’","label":0},{"text":"Joe Biden Promises Welcome for Venezuelan, Cuban Migrants","label":1},{"text":"All 50 States Issuing REAL ID Drivers’ Licenses, 19 Years After 9\/11","label":0},{"text":"600 Pounds of Meth Found in Modified Truck at Arizona Checkpoint","label":0},{"text":"Illegal Alien Gets Six Years in Prison for Trying to Pay a Child for Sex","label":-1},{"text":"Donald Trump’s Policies Boosted Lower, Middle Income Americans","label":1},{"text":"Illegal Alien Charged with Bludgeoning 81-Year-Old Woman to Death","label":-1},{"text":"Police Arrested Nearly 90 Protesters at Abolish ICE Protest in NYC","label":-1},{"text":"Kamala Harris Touts Wall Street’s Support for Joe Biden During VP Debate","label":1},{"text":"Feds: Nearly 400K American Victims of Identity Theft Never Notified by IRS","label":-1},{"text":"Deported Criminal Migrants Who Break Back into Britain Using Human Rights Laws to Fight Removals: Report","label":-1},{"text":"Viktor Orbán: Today’s European Institutions Serve the ‘Interests of George Soros’","label":0},{"text":"Twice-Deported Honduran Charged with Sexual Assault of Pre-Teen Girl","label":-1},{"text":"WATCH: Thousands of Caravan Migrants Push into Guatemala","label":-1},{"text":"Arizona Poll: Joe Biden, Donald Trump Statistically Tied in the Grand Canyon State","label":0},{"text":"Pelosi: Trump ‘Hasn’t Been on the Level’ — Not a ‘Good Use of Time’ to Work With Him","label":-1},{"text":"Rather: In November We Will ‘Find Out How Many People Are Dumb Enough to Believe’ Trump","label":-1},{"text":"White House Ricin Suspect Was Arrested in Texas Border Town in 2019","label":-1},{"text":"Illegal Alien Charged with Raping Child in North Carolina","label":-1},{"text":"Facebook to Reject Political Ads that Question Election, Voting Methods","label":-1},{"text":"Chris Wallace Picks Debate Topics, Appears to Omit Several Key Issues","label":-1},{"text":"Agriculture Deptartment Drops Wage Floor in H-2A Farmworker Program","label":0},{"text":"15 Migrants Arrested at Sea After 6-Hour Search off California Coast","label":-1},{"text":"Coons: Biden Can Lead Us to Address ‘Our Founding Sin of White Supremacy and Slavery’","label":-1},{"text":"Cynthia Nixon Claims Trump, Coronavirus Exposed ‘Retrograde’ White Supremacy in America","label":-1},{"text":"Amazon Teams with Playwright Heidi Schreck Who Pushed for Defunding the Police","label":0},{"text":"Nigerian Pleads Guilty to Murdering Mackenzie Lueck, Avoids Death Penalty","label":-1},{"text":"Poll: 51% Believe Kamala Harris Won Vice Presidential Debate","label":1},{"text":"Millionaire Democrat Donor Says Joe Biden Will Be Good for Wall Street","label":1},{"text":"WATCH: Over 7,000 Participate in ‘Laredo Trump Train’ Event","label":0},{"text":"GRAPHIC: Female Migrant Found Dead on Texas Ranch -- 80 Miles from Border","label":-1},{"text":"Farage Predicts the Future! Hundreds of Illegal Boat Migrants Cross the Channel","label":-1},{"text":"Greek Police Investigation Into Suspicious Fires Near Turkish Border","label":-1},{"text":"Paris Region Arrests Over 6,300 Underage Migrants in 2020","label":-1},{"text":"First Lady Melania Trump Rips the Media, Liberals in Leaked Tapes","label":-1},{"text":"Second UK Military Migrant Camp Set to Open in Wales, as Migrant Crisis Grows","label":-1},{"text":"‘We Have Space’ Thousands of Germans Protest For MORE Migrants After Moria Camp Fire","label":-1},{"text":"Iraqi Migrants Accused of Dragging Women into a Car And Raping Them","label":-1},{"text":"Leftists Protest New Migrant Camps – Want Even More Generous Housing for Illegals","label":-1},{"text":"Driver Killed, Nine Injured After Suspected Migrant Smuggler’s Car Crash","label":-1},{"text":"Farage Watched French Warship Escort Migrant Boat into British Waters","label":-1},{"text":"Pakistani Migrant Paris Attacker Revealed to Be 25 Not 18","label":-1},{"text":"French Police Catch Pregnant 13-Year-Old Migrant Pickpocket","label":-1},{"text":"Populist Salvini Physically Attacked by Leftist Migrant in Tuscany","label":-1},{"text":"Underage Afghan Migrants Arrested for Moria Migrant Camp Arson","label":-1},{"text":"Confession: Pakistani Migrant Stabbed German Teen in Plot to Avoid Getting Deported","label":-1},{"text":"GRAPHIC: Migrant’s Decaying Body Found on Texas Ranch 80 miles from Border","label":-1},{"text":"‘We Wish We Stayed in France’: Sudanese Illegal Migrants Complain About Conditions in UK Camp","label":-1},{"text":"Majority of Germans Fear Taking Migrants from Greece Will Trigger New Migrant Wave","label":-1},{"text":"Migrants Lost in Arizona Mountains Rescued by CBP Helicopter Crews","label":1},{"text":"Greek Minister Claims Closed Borders Have Cost People Traffickers €100 Million","label":0},{"text":"Mexico’s President Suggests New Migrant Caravan Timed to Influence U.S. Presidential Election","label":0},{"text":"EU Considers Scrapping Dublin Asylum Agreement, New Measures Could Force Migrant Redistribution","label":-1},{"text":"Bosnian Regional PM Calls on Italy to Help Stop Migrant Surge","label":-1},{"text":"Paris to Open Migrant Reception Centre in Historic Former Town Hall","label":0},{"text":"Father of Paris Charlie Hebdo Attacker Claims To Be ‘Proud’ Of His Actions","label":-1},{"text":"‘Will Anybody Lift A Finger?’ Farage Predicts Hundreds of Boat Migrants Will Set Off on Tuesday","label":-1},{"text":"Sweden: Nearly Half of Unemployed Migrants Lack High School Education","label":-1},{"text":"Orbán Rejects Migration Pact, Says EU Wants to ‘Manage Migration’ Not Stop It","label":-1},{"text":"Moroccans Make Up Nearly a Quarter of All Juvenile Inmates in Spain","label":-1},{"text":"British Authorities ‘Overwhelmed’ by ‘Absolute Mayhem’ as 200 Illegals Land","label":-1},{"text":"More Illegals Have Landed in UK in September Than Whole of 2019: Report","label":-1},{"text":"Lawyer Linked to Swedish Migrant Clan Gangs Threatened with Expulsion from Bar Association","label":-1},{"text":"Italian Coastguard Tells German Migrant Taxi NGO Ship to Go to Germany","label":0},{"text":"French Police Dismantle Calais 'Jungle' Migrant Camp Housing Over 700 'Asylum Seekers'","label":-1},{"text":"Austrian Integration Minister Rejects Any Form of Parallel Migrant Societies","label":-1},{"text":"At Least 13,000 Migrants Homeless After Notorious Moria Camp Burns to the Ground","label":-1},{"text":"Spanish Canary Islands See 'Unsustainable' 700 Per Cent Rise in Migrants","label":-1},{"text":"Iraqi Convicted of Beheading Swedish Teen Pleads Innocence at Appeal","label":-1},{"text":"Austrian Chancellor Speaks Out Against EU Migrant Redistribution Policy","label":0},{"text":"EU Reveals 'Mandatory Solidarity Mechanism' to Spread Migrants Across All States","label":-1},{"text":"Prosecutor Files Terrorism Charges Over New Charlie Hebdo Stabbings","label":-1},{"text":"First of Up to 431 Channel Migrants Arrive at New Open Camp in England","label":0},{"text":"Gothenburg Police Concerned Over Growing Drug Trade Ethnic Gang Violence","label":-1},{"text":"It CAN Be Done: Tunisia Stops and Turns Backs Hundreds of Boat Migrants at Sea","label":-1},{"text":"Italy: Majority of Migrants Rejected for Asylum But Stay in Country Anyway","label":-1},{"text":"Migrant Crisis Balkan Route Nations Have Least Favourable Opinions Towards Migrants","label":-1},{"text":"Mayor Says Parents Fear for Children After Migrant Centre Becomes Crime Hotspot","label":-1},{"text":"Swedish Police Hunt for Danes Who Burned Qur’an in No-Go Zone","label":-1},{"text":"Deportation Flight Had One Passenger After 29 Lodged Legal Challenges","label":-1},{"text":"Hungarian Police Discover 16 Tunnels Used by Migrants to Cross Border","label":0},{"text":"Report: Law Firm Which Stops Deportations Got 55m in Taxpayer Legal Aid","label":-1},{"text":"Ng: HBO’s Quarantine Comedy ‘Coastal Elites,’ Starring Bette Midler, Is an Angry Anti-Trump Rage Fest","label":-1},{"text":"Italians Able to Head to Polls in Seven Regional Elections Despite Coronavirus","label":0},{"text":"Reports: CDC Health Officials Resisted Disease Closure of U.S.-Mexican Border","label":0},{"text":"Colorado Secretary of State Encourages Non-Citizens, Deceased to Register to Vote","label":-1},{"text":"Burger King Depicts Mascot in Gay Kiss with Ronald McDonald for New Ad Campaign","label":0},{"text":"Populist Salvini Candidate on Course to Get Largest Governor Vote in Italian History","label":1},{"text":"Leftist Italian Govt Set to Dismantle Salvini Anti-Mass Migration Decrees","label":-1},{"text":"Muslim Imam Arrested in Huge Child Pornography Bust","label":-1},{"text":"French Butcher Attacked With Tear Gas By Children For Selling Pork","label":-1},{"text":"Quarantined Migrants Grow Angry, Set Fires in Italian Hotel","label":-1},{"text":"White House Posts H-1B Visa Reforms to Help American Graduates Get Good Jobs","label":1},{"text":"Judges Ground Another Entire Deportation Flight for Illegal Migrants","label":-1},{"text":"Blue State Blues: Joe Biden Is Already Irritating — and Worrying — U.S. Allies","label":-1},{"text":"Pollak: The NYT’s Latest ‘Whistleblower’ Looks Like Another Adam Schiff Hit Job","label":-1},{"text":"UK Considering Floating Asylum Centres in Old Ferries, Sending Migrants to Remote Islands: Reports","label":0},{"text":"Paris Stabbing Suspect Admits He Was Trying to Target Charlie Hebdo: Report","label":-1},{"text":"Italian Authorites Open After Being Rammed by Suspected Smuggler Boat","label":-1},{"text":"NGO Claims Around Half of Migrants on Paris Streets May Be Coronavirus Positive","label":-1},{"text":"Macron Faces Islamophobia Claims Over Homeschooling Ban 'to Protect Children From Religion'","label":-1},{"text":"Former Swedish Broadcaster CEO: No One in Sweden Likes President Trump","label":-1},{"text":"Greece to Recruit 800 New Border Guards After Turks Push Migrants to Frontier","label":-1},{"text":"Paris No-Go Suburb Politician Faced Trial for Apologising for Terrorism","label":-1},{"text":"Swedish 2021 Budget Spends More on Foreign Aid Than Police Force","label":1},{"text":"Nearly All Top Ten Baby Names in Paris Suburbs Have Islamic Connection","label":0},{"text":"Greek Birthrate Declined by over Three Per Cent in 2019","label":-1},{"text":"Greece: Court Rules Fascist Golden Dawn Party Is a Criminal Organization","label":-1},{"text":"Deported Rapists, 40 Migrants Apprehended in Texas near Border","label":-1},{"text":"Pope Francis: Migrants Are Forced to Flee ‘Like Jesus’","label":-1},{"text":"Salvini Ally Threatened with Rape After Opposing Mosque","label":-1},{"text":"WATCH: Migrants Rescued After Being Stuck on New Border Wall","label":1},{"text":"Greek Police Arrest Three People Smugglers Holding Migrants Ransom","label":-1},{"text":"Exclusive: Human Smuggler Arrested in South Texas with Pistols","label":-1},{"text":"Border Patrol Agent Stabbed — Assailant Shot, Killed","label":-1},{"text":"EXCLUSIVE Video: Heavily Armed Human Smugglers Operating in Texas — 80 Miles from Border","label":-1},{"text":"Greeks Strengthen Military Amid Increased Turkish Aggression","label":-1},{"text":"Patel Criticises Illegals 'Shopping Around' for Asylum, Vows 'Firm and Fair' Refugee System","label":-1},{"text":"'How Many More Get Away?' Farage Releases Footage of Migrants Arriving 'Under the Cover of Darkness'","label":-1},{"text":"Sweden: Thousands of 2015 Crisis Migrants Have Allegedly Disappeared","label":-1},{"text":"Venezuela’s Maduro Asks U.N. to Pay Rogue States Under U.S. Sanctions","label":-1},{"text":"Newark Cardinal: Americans Can Vote for Joe Biden ‘in Good Conscience’","label":1},{"text":"Shift to Armed Human Smuggling in South Texas Worries Feds","label":-1},{"text":"Border Patrol Agent Fires Weapon After Assault by Suspected Smuggler","label":-1},{"text":"WATCH-- Trump Tells Minnesota Rally Crowd: 'I'm Your Wall Between American Dream and Chaos'","label":1},{"text":"Report: Trump Considers Reducing Refugee Resettlement for Fifth Year","label":0},{"text":"Trump Ad: Joe Biden to Hike Refugees by 700 Percent During Coronavirus Crisis","label":-1},{"text":"Michael Keaton to Joe Biden: ‘No More Debates. You Won. Walk Away’","label":1},{"text":"Minnesota Supporters Chant ‘Lock Her Up’ as Trump Mentions Ilhan Omar","label":-1},{"text":"Facebook Removes Trump Campaign Ad","label":0},{"text":"Pope Francis Says More Voices Must Be Heard to Beat Coronavirus","label":0},{"text":"Omar: ‘I Resent’ Anyone Who Says Trump ‘Is Not Racist’ — We Have ‘Fascist in the White House’","label":-1},{"text":"North Korea at U.N. Claims Coronavirus Situation ‘Safe and Stable’","label":1},{"text":"UK Politician Demands Deportation of Christian Pastor for Criticising Gay Pride","label":-1},{"text":"Nearly Half of Young People in North Africa and Middle East Want to Migrate","label":0},{"text":"MI5 Knew Manchester Bomber Had Visited Jihadist in Prison but Did Nothing","label":-1},{"text":"Fact Check: Kamala Harris Repeats False ‘Muslim Ban’ Claim","label":-1},{"text":"House Republican China Task Force Unveils Detailed Plan on How to Counter China","label":0},{"text":"Afghanistan’s Only Known Jewish Citizen: Peace Talks Must Protect Minorities","label":1},{"text":"EU Commission President Claims Populist Opponents ‘Preach Hate’","label":-1},{"text":"Scarborough: Trump Using ‘Clearly Fascist Language’ in Omar Attacks","label":-1},{"text":"Pope Francis Knocks Nationalism, Pushes Multilateralism in U.N. Speech","label":-1},{"text":"Lebanon at the U.N.: Beirut Will 'Rise from Its Ruins'","label":1},{"text":"Senate Bill Demands Probe into U.N. Role in Cuba’s Billion-Dollar Slave Doctor Industry","label":-1},{"text":"Palestinians Slam Israel-Bahrain Deal as Yet Another 'Stab in the Back'","label":-1},{"text":"UK Failed to Learn Lessons of 9\/11, 7\/7, Says Father of Ariana Grande Terror Attack Victim","label":-1},{"text":"WATCH: Democrat Ammar Campa-Najjar Released 'Free Palestine' Music Video in 2012","label":1},{"text":"Left Recruits 600k Poll Workers to Ensure 'Fair Election'","label":1},{"text":"Kamala Harris Skips Amy Coney Barrett Hearing Citing Coronavirus While Attending Numerous Indoor Events","label":-1},{"text":"Pope Francis Meets Parents of Priest Stabbed to Death by Tunisian Immigrant","label":-1},{"text":"Kamala Harris Cites Planned Parenthood, NAACP in Opposition to Amy Coney Barrett","label":0},{"text":"Mindy Kaling, Kumail Nanjiani Push ‘South Asian Block Party’ Fundraiser for Biden","label":1},{"text":"Cato: Donald Trump Slashes Immigration","label":-1},{"text":"Progressive Democrats Reveal Radical Platform: 'Biden a Doorway, Not a Destination'","label":1},{"text":"Bill de Blasio Not Invited to New York's Columbus Day Event","label":0},{"text":"At least 851 Illegal Migrants on French Terror Watchlist","label":-1},{"text":"SCOTUS OKs Donald Trump’s Census Plan","label":0},{"text":"Trump: While I Am President, Nobody Will Touch Your Social Security","label":1},{"text":"Populist Senator Matteo Salvini Wears 'Trump 2020' Mask in Italian Parliament","label":0},{"text":"H-1B Supporters Denounce Wage-Boosting Regulations","label":-1},{"text":"White House Touts H-1B Visa Worker Reforms","label":1},{"text":"Asylum Lawyers Fail to Stop Africans’ Deportation","label":-1},{"text":"Blexit Event Attendee: Illegal Immigration Hurts Black Community","label":-1},{"text":"Twitter Censors Senate Candidate Lauren Witzke’s Immigration Views as ‘Hateful Conduct’","label":-1},{"text":"Human Smugglers Pack 100 Migrants in Refrigerated Trailer in Texas near Border","label":-1},{"text":"Judges Block Deportation of Migrant Drug Dealer, Cite ‘Human Rights’","label":-1},{"text":"Kamala Harris Refused Death Penalty for Illegal Alien MS-13 Gang Member Who Murdered Bologna Family","label":-1},{"text":"Axios: Wall Street Investors Increasingly Confident in Joe Biden","label":1},{"text":"Migrant Apprehensions at Border Jump 16 Percent in September","label":-1},{"text":"‘Led by Idiots’: UK Govt Floats Idea of Disabling Migrant Boats with Nets","label":-1},{"text":"Channel Migrant Tsar Claims 'Vast Majority' of Asylum Seekers Are 'Genuine'","label":1},{"text":"Marine Le Pen Rejects New EU Migrant Pact As 'Suicide of Europe'","label":-1},{"text":"Greece: Migrants Film Themselves Licking Baby Food in Supermarket","label":0},{"text":"21 of 57 Newly Arrived Migrants Landing in Italy Test Positive for Coronavirus","label":-1},{"text":"Exclusive Video: Migrants Raft Across Texas Border River in Daylight","label":0},{"text":"Finnish Police Bust Huge Sex Trafficking Ring Led by Migrants","label":-1},{"text":"Bulgarian Vagrant Set Fire to Policeman.","label":-1},{"text":"Centre-Right Dominates Czech Senate Elections, Social Democrats Wiped Out","label":0},{"text":"Callista Gingrich: Human Trafficking in the Wake of COVID-19","label":-1},{"text":"First Hijab-Wearing Mayor in UK Quits Labour Party Alleging Islamophobia","label":-1},{"text":"Pope Francis Compares Today’s European Nationalism with Pre-Nazi Germany","label":0},{"text":"Exit Polls: 3-in-4 Voters Want Less Immigration During and After Pandemic","label":0},{"text":"Joe Biden Vows Amnesty for All Illegal Aliens in First 100 Days: 'We Owe Them'","label":1},{"text":"Fact Check: Obama-Biden Administration Used So-Called 'Cages' for Border Crossers","label":-1},{"text":"Billionaires Back Claim That Only Amnesty and Illegals Can Save America","label":1},{"text":"FNC's Donna Brazile: 'President Trump Was Not Capable of Delivering for All Americans'","label":-1},{"text":"Donald Trump Revives Snake Poem at North Carolina Rally","label":1},{"text":"Donald Trump Gains Among Younger Latinos, Blacks","label":1},{"text":"Biden's Chief of Staff Worked on Behalf of Big Tech for Endless H-1B Visas","label":0},{"text":"New York Post Endorses Donald Trump: 'Make America Great Again, Again'","label":1},{"text":"Ann Coulter: What America Wants Is ‘Trumpism without Trump’","label":0},{"text":"Exclusive—Marsha Blackburn: Support Kelly Loeffler for U.S. Senate","label":1},{"text":"Donald Trump's Populist Coalition Saves GOP State, Federal Legislators","label":1},{"text":"Donald Trump Silent on H-1B Reforms in Vital North Carolina","label":1},{"text":"Associated Press: Joe Biden Has 'Seasoned Cool'","label":1},{"text":"Watch: Donald Trump's Border Wall Reaches 371 Miles","label":0},{"text":"Border Patrol Agents Involved in Fatal Shootings in Texas, California","label":-1},{"text":"Farage Relaunching Brexit Party as Reform Party, Will Campaign Against Lockdown","label":1},{"text":"Fact Check: Democrats' HEROES Act Is Bailout of Illegal Migration Cities","label":0},{"text":"Exclusive--Ann Coulter: ‘The Most Deleterious Force for America and for Conservatism Has Been Fox News Leading People Astray’","label":-1},{"text":"Report: Donald Trump Raises Wages amid Shrinking Migration","label":1},{"text":"GOP Establishment Rebuked for Fleeing ‘America First’ with Amnesty Talk","label":-1},{"text":"No Immigration Question in Next Debate, Say Debate Organizers","label":0},{"text":"Greece to Build Border Wall in Fight Against Illegal Immigration","label":-1},{"text":"Miles Taylor: Trump Administration Has ‘Almost Nazi-Like Immigration Policies’","label":-1},{"text":"Migration Hawk Chuck Grassley to Run Senate’s Immigration Committee","label":0},{"text":"WashPo: President Trump ‘Shattered’ Bipartisan Consensus on Immigration","label":-1},{"text":"Analysis: Mass Immigration Drastically Alters Electorates in Swing States","label":0},{"text":"500 Missing Migrant Children Narrative Reaches Presidential Debate Stage Despite the Facts","label":-1},{"text":"Twitter Locks Account of Republican Senate Candidate Lauren Witzke – Again","label":-1},{"text":"Democrat Filmmaker to Vote for Donald Trump After Making Illegal Immigration Documentary","label":-1},{"text":"Watch: Antifa Medic Calls for Federal Agent to Be ‘Executed’","label":-1},{"text":"The Stakes: Stephen Miller Outlines the Choice on Immigration and Border Security in 2020","label":0},{"text":"Watch: Police Attacked with Glass Bottles in Portland as Protesters Call Them ‘Nazi Terrorists’","label":-1},{"text":"CBS Host Stephen Colbert Orders Audience to ‘Punish’ Trump at the Ballot Box","label":-1},{"text":"More Than 170 Criminal Illegal Aliens Arrested in Sanctuary Cities, Including Convicted Sex Offenders","label":-1},{"text":"Billionaire Charles Koch Ready to Work with Joe Biden, Democrats on Immigration","label":1},{"text":"Watch: Documentary Shows Coyotes Using Democrat Debate Footage to Recruit Illegal Border Crossers","label":-1},{"text":"Philippines to Expel 2,800 Chinese Nationals for Overstaying Visas","label":-1},{"text":"Tucker Carlson: GOP Establishment ‘Happy to Sell Out’ Voters with Amnesty","label":-1},{"text":"Previously-Deported Chinese Violent Felon Arrested near Border in Maine","label":-1},{"text":"Donald Trump: Joe Biden Will Trigger ‘Tsunami’ of Illegal Immigration if Elected President","label":-1},{"text":"CBP Chief Warns of Illegal Immigration ‘Invasion’ if Biden Ends Trump Policies","label":-1},{"text":"Immigration Officials: System ‘Can Easily Be Overwhelmed,’ ‘Very Problematic’ to Say You’ll Be Legalized as Long as You Reach U.S.","label":-1},{"text":"Portland Chaos: Video Shows Antifa Screaming as Police Retake Streets","label":-1},{"text":"More Than 100 Illegal Aliens Arrested Across Six States, Including Domestic Abusers","label":-1},{"text":"Tom Cotton: Joe Biden Presidency Would Cause ‘Massive Surge’ of Illegal Immigration","label":-1},{"text":"Trump Critics Reveal Ignorance on Immigration Issues After President Remarks on Coyote Human Traffickers","label":-1},{"text":"Trump: Joe Biden to Give Illegal Aliens Free Healthcare, Not Americans","label":-1},{"text":"Rasmussen: Liberals Favor Migration over Environmental Protection","label":0},{"text":"EXCLUSIVE: ICE Places Detainer on Accused Houston Cop-Killer Illegally Present in U.S.","label":-1},{"text":"Supreme Court to Decide Three Migration Disputes","label":0},{"text":"Watch: Latino Border Patrol Agents Discuss Benefits of Secure Borders on Their Communities","label":1},{"text":"Donald Trump on DACA: We’re Going to Take Care of ‘Dreamers’","label":1},{"text":"Female Voter Tells President Trump: ‘You’re So Handsome When You Smile’","label":1},{"text":"Illegal Alien Released into U.S. Charged with Murdering Two Women in Machete Attack","label":-1},{"text":"Ann Coulter: Stumper — Should Trump Mention His Most Popular Issue?","label":1},{"text":"Linda Ronstadt: Trump the ‘New Hitler’ and ‘Mexicans Are the New Jews’","label":-1},{"text":"Washington Post: ‘Demographic Changes’ Spur Democrat Rebirth in Texas, Virginia, Colorado","label":1},{"text":"DHS Chad Wolf: President Trump Slashed Migrant Inflow from 400,000 to 14,000","label":-1},{"text":"Tom Cotton Slams Joe Biden’s Claim ‘We Owe’ Amnesty to Illegal Migrants","label":-1},{"text":"Donald Trump Slams Joe Biden’s Claim That ‘America Was an Idea’","label":-1},{"text":"Guatemala Asks for U.S. Amnesty for Its 700,000-Plus Migrants","label":0},{"text":"Rubio: GOP’s Future Is Appealing to Working Class Who Don’t Want Business Shut Down, Jobs Outsourced","label":1},{"text":"Trump Declares ‘National Day of Remembrance for Americans Killed by Illegal Aliens’ on November 1","label":-1},{"text":"Joe Biden’s Progressives Split over Pro-Migration Promises","label":1},{"text":"Munro: NYT Op-Ed: Shocked, Stunned to See Blacks Vote for Donald Trump","label":-1},{"text":"U.S. Attorney Files Federal Charges on Accused Houston Cop-Killer","label":-1},{"text":"Charles Hurt: QAnon Obsession Marks the Depth of Deep State Journalism","label":-1},{"text":"2,000 African Boat Migrants Land on the Canary Islands Over the Weekend","label":0},{"text":"Exclusive – Sen. Joni Ernst: Sarah’s Law Is About Justice","label":1},{"text":"Tom Cotton: Joe Biden Avoids Wage-Raise Policy","label":-1},{"text":"Latino Support for Trump in California Jumps 8 Points in One Month","label":1},{"text":"Iraqi Archbishop: Europe Is 'Nave' About Terrorism, Uncontrolled Immigration","label":-1},{"text":"Promises Made, Promises Kept: Trump Administration Arrests More than 600 MS-13 Gang Members Since 2017","label":1},{"text":"‘Thousands of Foreign Fighters in EU’: Kurz and Macron Meet Over Fight Against Political Islam","label":-1},{"text":"More than 1 Million Migrants Are in the U.S. Seeking Asylum","label":0},{"text":"Joe Biden Touts Wall Street Support in Philadelphia, Pennsylvania","label":1},{"text":"Sanders: Biden ‘Has a Very, Very Strong Mandate’","label":1},{"text":"Kamala Harris Failed to Prosecute Illegal MS-13 Gang Member Months Before He Murdered Bologna Family","label":-1},{"text":"Fact Check: Joe Biden Claims Trump is the First President to End Asylum Shopping","label":0},{"text":"Joe Biden’s Final Pitch to Pennsylvania Voters: Wall Street Backs My Agenda","label":1},{"text":"Donald Trump Cuts 2021 Refugee Inflow Below 15,000","label":-1},{"text":"Twitter Blacklists Angel Families Days After Presidential Election","label":-1},{"text":"Carney: 6 Ways a Biden Democrat Run Economy Would Hurt Suburban America","label":-1},{"text":"Migrants in Mexico Hope for Joe Biden Win","label":1},{"text":"NBC Report: Biden’s Team Hesitates on Border Migration Policies","label":-1},{"text":"Charles Hurt — Democrats New Battle Cry: ‘Mr. Biden, Tear Down That Wall!’","label":-1},{"text":"200K Migrants Expelled After Illegally Crossing U.S. Border Under Coronavirus Protocols","label":-1},{"text":"DOJ: 94 Percent of Foreign Nationals in U.S. Federal Prison Are Illegal Aliens","label":-1},{"text":"Whitmer: Trump Is Only President for ‘Whomever Agrees with Him’","label":1},{"text":"Donald Trump: Biden’s Donors Were Wall Street Bankers; Mine Were Policemen, Farmers, Everyday Citizens","label":1},{"text":"Trump Bans Convicted Felons, Gang Members from Securing Asylum in U.S.","label":-1},{"text":"Joe Biden Touts Wall Street’s Praise for His Economic Plan","label":1},{"text":"90s Hip Hop Group De La Soul Release Anti-Trump Anthem ‘Remove 45’","label":-1},{"text":"Pollak: 11 Shining Successes of President Donald Trump’s First Term","label":1},{"text":"Kamala Harris Urges Illegal Migrants to Help Elect Joe Biden","label":-1},{"text":"Angel Families on National Day of Remembrance: ‘Trump Is the Only One Who Cares About Our Losses’","label":1},{"text":"French Schools Reopen for First Time Since Teacher Beheaded in Islamist Terror","label":-1},{"text":"Joe Biden Promises to Raise Annual U.S. Refugee Target by 800%","label":1},{"text":"Woke Archbishop Calls on the UK Government to Take in MORE Refugees","label":0},{"text":"Fingerprints of Ariana Grande Bomber's Refugee Father Found in Car That Stored Explosives","label":-1},{"text":"Pakistan Govt Demanded Twitter Take Down Images of Tribute to Beheaded Teacher","label":-1},{"text":"Reading Park Terror: Libyan Refugee Admits to Three Counts of Murder","label":-1},{"text":"French Teen Arrested for Praising Beheading of French Teacher","label":-1},{"text":"Ethiopia: ‘Likely Hundreds’ Hacked to Death as Nation Faces Civil War","label":-1},{"text":"French Teachers Receive Death Threats Explicitly Referencing Beheading of Samuel Paty","label":-1},{"text":"France: Pupils Arrested After Praising Sharia and Threatening Teacher","label":-1},{"text":"Dutch Teacher Who Posted Jihadi-Mocking Cartoon Forced Into Hiding by Threats","label":-1},{"text":"UFC Champ Khabib Nurmagamedov Blasts French Leader Macron for Defending Magazine","label":-1},{"text":"Iran Arrests Paralympian for Questioning Coronavirus Response","label":-1},{"text":"Farage on Priest Shooting in France: ‘Every Terror Attack in France Is Another Reason to Vote Trump’","label":-1},{"text":"CBS: Joe Biden to Demolish Legal Wall Against Migration","label":-1},{"text":"Trump Warns ‘A Nation Without Borders Is Not a Nation’ After ‘Vicious’ Beheading in France","label":-1},{"text":"Solidarity Demonstrations for French Teacher Beheaded for Showing Images of Mohammed.","label":-1},{"text":"Israel Warplanes Strike Gaza After Hamas Terrorist Rocket Fire","label":-1},{"text":"Paris Mosque Apologises For Sharing ‘Fatwa’ Video Prior to Islamic Beheading Attack","label":-1},{"text":"Kamala Harris: Restore Aid to Palestinians, Reopen U.S. Consulate in Jerusalem, PLO Office in D.C.","label":1},{"text":"Kamala Harris Ignored Angel Parents While Embracing DACA Illegal Aliens","label":-1},{"text":"NGOs Demand Britain Open Borders to Migrants Across the World After Boat Deaths","label":-1},{"text":"'We Will Cut Your Head Off': French Mayor Threatened in Wake of Teacher Beheading","label":-1},{"text":"Report: Apologies for Terrorism 'Exploding' in France After Samuel Paty Murder","label":-1},{"text":".Greece Arrests Islamic State Migrant Helped by Pro-Migration NGOs","label":-1},{"text":"Man Arrested After Threatening French Teachers to 'Avenge the Prophet'","label":-1},{"text":"France: 12-Year-Olds Investigated for Praising Teacher Beheading","label":-1},{"text":"Macron Calls on EU to Restore Internal Border Controls to Combat Terrorist Migrants","label":-1},{"text":"PICS: Muslims Denounce Macron as ‘A Satan, Not a Human’ at Thousands-Strong Protest","label":-1},{"text":"France Shuts Paris Mosque that Shared Fatwa Call Against Beheaded Teacher","label":-1},{"text":"Protesters Demand Migrant Amnesty in Paris Day After Migrant Terror Attack","label":-1},{"text":".Father of Pupil, Teens Investigated","label":-1},{"text":"Watch: Nearly 2,500 African Migrants Arrive in Italy in Just 5 Days","label":0},{"text":"Austrian Chancellor Kurz: EU Must Fight Back Against Political Islam","label":-1},{"text":"Al-Qaeda Threatens Macron, Calls for Death to Those Who 'Insult' Mohammed","label":-1},{"text":"Romanian Trucker Jailed for Smuggling Migrants OUT of the UK","label":-1},{"text":"Iraqi Archbishop: European Union 'Lagged Behind' in Aiding Persecuted Christians","label":-1},{"text":"Mother of ISIS Defector Demands French Govt Send Cash to Them in Syria","label":-1},{"text":"French Police Disperse Turkish Grey Wolves After Anti-Macron, Anti-Armenia 'Allahu Akbar' March","label":-1},{"text":"100+ Convicted Terrorists Set for Early Release","label":-1},{"text":"'Tell My Family I Love Them': A Mother, a 60-Year-Old Woman, and a Church Layman Slain in Nice Terror Attack","label":-1},{"text":"Macron: Parts of France Are 'Breeding Grounds' for Terrorists","label":-1},{"text":"Tucker Carlson on Biden Transition: ‘Not an Incoming Presidential Administration — A Corporate Takeover of the Country’","label":-1},{"text":"EXCLUSIVECongressional Nominee Nicole Malliotakis: 'America's Core Values on the Ballot'","label":1},{"text":"State Media: 'Chinese Netizens' Call Greta Thunberg a 'Clown' for Hong Kong Support","label":-1},{"text":"China Threatens ‘Health and Safety’ of Canadians if Justin Trudeau Helps Hong Kong Refugees","label":-1},{"text":"Greta Thunberg Defies China, Demands Release of Imprisoned Hong Kong Refugees","label":-1},{"text":"DHS Chief Chad Wolf Dunks on Border Wall Doubters","label":-1},{"text":"Interior Dep. Sec. MacGregor: Veterans, Gold Star Families to Receive ‘Free Lifetime Passes’ for National Parks","label":1},{"text":"NYT: Agencies File Blizzard of Lawsuits to Fill Gaps in Trump’s Border Wall","label":-1},{"text":"Steve Miller: Joe Biden Will Destroy Middle Class with Global Catch and Release","label":-1},{"text":"Rahm Emanuel to Fired Retail Workers: You Can Learn to Code!","label":-1},{"text":"Fact Check: Biden Claims U.S. Had a ‘Good Relationship with Hitler Before He Invaded the Rest of Europe’","label":-1},{"text":"Italian PM’s Office to Fund Politically-Correct Training for Journalists","label":0},{"text":"Top Corbyn Ally Abbott: ‘We All Hope and Pray’ That ‘Racist Trump’ Loses U.S. Election","label":-1},{"text":"Actress Natalie Morales: Cuban Americans Who Voted for Trump ‘Are 10,000 Percent Brainwashed’","label":-1},{"text":"Migrants Complain Taxpayer-Funded Housing Is Like 'Prison'","label":-1},{"text":"Joe Biden Says Pope Francis Offered Him ‘Blessings and Congratulations’","label":1},{"text":"Netanyahu Praises Trump for 3 Peace Deals in 6 Weeks","label":1},{"text":"One-in-Four Democrats Favor Hiring Foreign Workers over Americans","label":0},{"text":"Miami Hispanics Hold Festive ‘Protect the Vote’ Protest in Support of Trump","label":1},{"text":"Media Praise Joe Biden’s ‘Solid Catholic Faith’","label":1},{"text":"Senior Palestinian Official Saeb Erekat Dies of Coronavirus at 65","label":0},{"text":"Exclusive: Donald Trump Caravan Parades Through Deep-Blue Heart of Hispanic New Jersey","label":1},{"text":"Abbas Finally Congratulates Biden, Said to Demand Reversal of Embassy Move","label":1},{"text":"Matteo Salvini: Italians Get Lockdowns, Migrants Get ‘Open Ports’","label":-1},{"text":"Pope Francis to Receive Families of Victims of France Terror Attack","label":-1},{"text":"Judge May Add 1 Million Migrants to the DACA Work Permit Program","label":0},{"text":"Exit Poll: Trump Bumps GOP’s Asian Vote to 31 Percent","label":1},{"text":"Women’s March: ‘Defunding the Police Is a Feminist Issue’","label":0},{"text":"Portuguese Bishop Blames European ‘Prejudices’ for Islamist Terror Attack in France","label":-1},{"text":"WATCH: Trump Supporters Sing ‘God Bless America’ in Scranton — in Harmony, in the Snow","label":1},{"text":"Republican Carlos Gimenez Defeats Democrat Debbie Mucarsel-Powell","label":0},{"text":"Women’s March Has 501(c)(4) IRS Status as It Campaigns Against Trump","label":0},{"text":"Pics: Defying Islamists, Giant Image of Mohammed Projected onto French Government Building After Beheading","label":-1},{"text":"Marco Rubio to Trump Rally: ‘Not All Democrats Are Socialists, But All Socialists Are Democrats’","label":0},{"text":"Man Living as Woman Targets Canadian Beauty Pageant for Not Allowing Him Entry into Contest","label":-1},{"text":"MSNBC Columnist: Joe Biden Must Heal America from Trump by Surging Refugee Resettlement to U.S.","label":1},{"text":"John Leguizamo: Latino Trump Supporters Suffer from ‘Self-Hate’","label":-1},{"text":"Democrats Want $5.5 Billion Bailout of New York City’s Illegal Population","label":-1},{"text":"Stash House Raids Yield Arrests of 100 Migrants in Texas near Border","label":-1},{"text":"40,000 in Bangladesh Burn Macron in Effigy over France’s Crackdown on Jihad","label":-1},{"text":"Pakistan: Thousands-Strong Anti-France Rally Goes 24 Hours","label":0},{"text":"‘Christophobia’: Bolsonaro Mourns Brazilian Victim of France Jihad","label":-1},{"text":"India Arrests 2,000, Including Lawmaker, in Anti-French Muslim Mobs","label":-1},{"text":"Illegal Alien Avoids Death Penalty, Pleads Guilty to Murdering Ron Singh","label":-1},{"text":"Pakistan's University of Health Sciences Boycotts France over Mohammed Cartoons","label":-1},{"text":"Islamic Terror Attacks in France and Austria Motivated by Revenge, Says Expert","label":-1},{"text":"Democrat Strategists: Party ‘Lost Ground’ with Minorities, Populism Trumped Wokeness","label":0},{"text":"Iran: Newspaper Depicts Macron as Satan for Opposing Beheadings","label":-1},{"text":"From Charlie Hebdo To Nice: 5 Years of Islamist Terror","label":-1},{"text":"Trump: Biden 'Built Cages for Immigrants,' Complimented Nicolas Maduro's Hair","label":-1},{"text":"Cartel-Linked Mexican Governor Calls on Immigrants in U.S. to Vote for Biden","label":-1},{"text":"Watch: Breitbart News Latinos on 2020 Hispanic Conservative Awakening","label":1},{"text":"Fact Check: Kamala Harris Repeats Lies About Trump and Racism in Nevada","label":-1},{"text":"Fact Check: Kamala Harris Lies 4 Times About Trump and Racism on '60 Minutes'","label":-1},{"text":"FBI Arrests Chinese Agents Persecuting Xi Jinping’s Enemies on U.S. Soil","label":-1},{"text":"Mexico Reprimands Cartel-Linked Governor After Pushing Votes for Biden","label":-1},{"text":"10 Examples of Joe Biden's History of Racially Charged Conduct and Comments","label":-1},{"text":"President Trump Creates 1776 Commission to ‘Stop Radical Indoctrination’","label":0},{"text":"Eric Eggers: Five States Where Voter Fraud Might Change the Presidential Election","label":-1},{"text":"Rahm Emanuel: ‘Republicans Will Regret’ Confirming Barrett","label":-1},{"text":"Barack Obama: ‘The Jury’s Still Out’ — America a ‘Possibility’","label":0},{"text":"Nolte: Riots, Lockdowns Implode Rental Markets in Democrat-Run Cities","label":-1},{"text":"Donald Trump Gained Support Among Black Voters","label":1},{"text":"Human Rights Campaign Readies for Sweeping LGBT Agenda with Biden","label":0},{"text":"Biden Readies Executive Orders to Reverse Trump Policies on Day One","label":0},{"text":"Teachers’ Unions Gleeful: ‘Bye Betsy,’ End to School Choice","label":-1},{"text":"NYT: Post-2020, Democrats Struggle with Socialism","label":-1},{"text":"WATCH: Kamala Harris Tells Five Lies in Two Minutes About Trump and Race","label":-1},{"text":"Democrat Meltdown: Rep. Max Rose Attacks Shopper at Staten Island Store","label":-1},{"text":"Catholic Leaders Challenge Joe Biden’s Commitment to Faith","label":-1},{"text":"Migrant Teen, Infant Brother Found Abandoned near Border River in Texas","label":-1},{"text":"Chinese Media Defends Trump Voters: ‘Not Just Rednecks and Racists’","label":1},{"text":"China Scolds U.S. for Racism at U.N. Human Rights Council","label":-1},{"text":"Law Commission Pushes for Hate Speech Law to Ban ‘Islamophobic’ Mohammed Cartoons","label":-1},{"text":"UK City to Change Statues Which ‘Over-Celebrated Empire, Christianity and “Great” White Men’","label":-1},{"text":"Stephen Moore to Pennsylvania: Joe Biden Is Not Bluffing, He Will Destroy Oil and Gas Industry","label":-1},{"text":"Planned Parenthood: ‘Let’s Revel’ in Media Election Call for Joe Biden","label":1},{"text":"DHS: Donald Trump’s H-1B Reforms Will Raise White-Collar Wages","label":1},{"text":"Victim-Blaming: AP 'Explainer' Asks 'Why Does France Incite Anger in the Muslim World?'","label":-1},{"text":"Exodus: Europe's Jewish Population Plummets as Antisemitism Drives Emigration","label":-1},{"text":"France, Tunisia Hold Talks on Islamist Extremism After Church Terror Attack by Tunisian Migrant","label":-1},{"text":"French Fishing Ships Paid by Migrant Smugglers to Avoid Detection by UK Border Drones: Report","label":-1},{"text":"Potential Copycat Terror Attack Foiled in Paris Suburbs After Nice Attack","label":-1},{"text":"Sweden: Afghans Had Stabbed Man 99 Times in Suspected Honour Killing","label":-1},{"text":"Migrant Convicted of Beating Woman Who Helped Him Get Residency","label":-1},{"text":"Three Suspected Terrorists Escape Italian Deportation Centre","label":-1},{"text":"Migrant Tries to Grab Female Police Officer’s Gun During Coronavirus Check","label":-1},{"text":"Iranian Migrant Charged with Manslaughter over English Channel Drownings","label":-1},{"text":"Peace Deal in Nagorno-Karabakh Triggers Armenian Migrant Wave","label":0},{"text":"One-Year-Old Migrant Found Abandoned in Texas at Border","label":-1},{"text":"Border Patrol Agent Attacked, Injured in Texas","label":-1},{"text":"Swedish Police Didn’t Believe Emergency Call, While Man Murdered and Woman Raped Twice","label":-1},{"text":"Athens Police Hand Out €100k in Coronavirus Fines in Just Two Hours","label":-1},{"text":"Iraqi Who Beheaded Swedish Teen Appeals to Supreme Court","label":-1},{"text":"At Least Four Migrants, Including Two Small Children, Drown as Boat Capsizes in the English Channel","label":-1},{"text":"WATCH: Another 160 Illegal Boat Migrants Cross the English Channel","label":-1},{"text":"Illegal Channel Crossings to Cost Taxpayer Near 250mn","label":-1},{"text":"Judges Drop Case Against Migrant Taxi Ship Accused of Aiding Illegal Migration.","label":-1},{"text":"How Do You Do, Fellow Kids: Parents' After Balding Migrant Who 'Looks 40' Joins School","label":-1},{"text":"Tensions at Italian Migrant Centre Under Quarantine Erupt into Violence","label":-1},{"text":"Report: 76-year-old Nun Assaulted, Afghan Migrant Arrested","label":-1},{"text":"Afghan Migrant Assaults French Hospital Staff, Threatens to Kill Them 'With a Kalashnikov'","label":-1},{"text":"WATCH: Migrants Torch Trump Effigy in Mexico near Texas Border","label":-1},{"text":"French Police Swoop on 80+ Extremists Who Expressed Support for Paris Beheader","label":-1},{"text":"Swedish Border Police Boss Admits Illegal Migrant Numbers Far Above Official Stats","label":-1},{"text":"'I'm Not Going Back': Illegal Migrant Stabbed Woman 30 Times Days Before Planned Deportation","label":-1},{"text":"Taylor Swift Lends ‘Only the Young’ Song to Anti-Trump Ad Pushing Youth Voter Turnout","label":0},{"text":"Pupils in Paris No-Go Suburbs Cheered Burning of French Flags in Response to Mohammed Cartoons","label":-1},{"text":"Greek Government Admits Losing Track of over 32,000 Illegal Migrants","label":-1},{"text":"Paris to Open 'Shooting Rooms' for City's 5,000 Crack Addicts","label":-1},{"text":"Only Eight Migrants on Deportation Flight After 28 Lodge Last-Minute Legal Challenges","label":-1},{"text":"Socialist 'Anti-Hate' Chief Resigns from Paris Govt over Rape Indictment","label":-1},{"text":"Police Arrest Man Armed with Knife Who Plotted to Kill Nice Terrorist","label":-1},{"text":"Iran Seeks Repatriation of Family Drowned in the English Channel","label":-1},{"text":"BREAKING: Greek Orthodox Priest Shot in Lyon, France, Gunman on the Run","label":-1},{"text":"‘Islam Teaches You to Fight Back’: 1000+ Muslims Protest Macron in NYC","label":-1},{"text":"Swathes of Italy Locked Down Again After Being Deemed Coronavirus ‘Red Zones’","label":-1},{"text":"Poll: 87% of Venezuelans Living with Coronavirus Patients Say the Infected Did Not Get PCR Tests","label":-1},{"text":"Pakistan PM Slams Macron, Demands Facebook Censor ‘Islamophobia’","label":-1},{"text":"Bolsonaro Comforts Fans Worried About Trump: ‘Hope Is the Last Thing to Die’","label":1},{"text":"Populist Govts of Hungary, Poland Veto EU's Globalist Power Grab Budget","label":-1},{"text":"UK Urges NATO Allies to Challenge Turkey: Back French Support of Free Speech","label":1},{"text":"Watch: Muslim Armies Coming to 'Crush Paris'","label":-1},{"text":"Submit and Obey: Iran's Rouhani Warns Freedom of Speech Ends on Contact with Islam","label":-1},{"text":"Charlie Hebdo Attack Trial Suspect Threatens Policewoman in Court","label":-1},{"text":"Macron Pledges Increased Protection for Churches After Orthodox Priest Shot","label":1},{"text":"Salvini Questions How Many Terrorists Have Come Through Lampedusa After Nice Church Attack","label":-1},{"text":"Athens No Longer Only Major EU Capital Without a Mosque","label":0},{"text":"Reports: Syrians Wave Islamic State Flags to Protest French Cartoons","label":-1},{"text":"Migration Watch: Number of Freed Foreign Criminals Has Doubled Since 2012","label":-1},{"text":"Muslims Demand 'Provocative' Borat Posters Be Removed from French Buses","label":-1},{"text":"Iran Summons French Envoy After Macron Defends Satirical Cartoons","label":0},{"text":"Caruzo: Take It from a Man Who Can’t Vote Freely – Don’t Take Your Elections for Granted","label":0},{"text":"Over 7,500 Illegal Boat Migrants Arrived in Britain This Year .Arrivals Busts Previous Predictions","label":-1},{"text":"Italy: Leftist Governor Attacks 'Stupid American Extravagance' of Halloween Amid Pandemic","label":-1},{"text":"MSNBC's Johnson: This Is 'War' -- Trump Caravans, Kyle Rittenhouse, Mitch McConnell 'the Enemy'","label":-1},{"text":"U.S. Chamber Fails in a Third of Democrat House Endorsements","label":-1},{"text":"100 Migrants Arrested in 30 Hours in Texas near Border","label":-1},{"text":"UK Govt to Target Illegal Migrants’ Smartphones with Ads Asking Them Not to Come","label":-1},{"text":"Migrants in Cyprus Tear Down French Embassy Flag","label":-1},{"text":"Haitian Migrants Surging Into U.S., Say Feds in Texas","label":-1},{"text":"Report: Armed Turkish Soldiers Prowling Greek Border in Civilian Dress","label":-1},{"text":"Pope Francis: I Dream of a Europe that Protects Life ‘in the Womb Until its Natural End’","label":1},{"text":"Italy: Salvini and Allies Demand Govt Suspend Taxes in Lockdown Areas","label":-1},{"text":"Stephen Miller: Joe Biden Is the ‘Most Globalist Candidate Ever’","label":0},{"text":"Italians Breaking ‘Red Zone’ Quarantine Risk Up To Six Years in Prison","label":-1},{"text":"New Republic: ‘What Do We Do About All These Trump Supporters?’","label":0},{"text":"Kidnapped Teen Boy Found Murdered by Gulf Cartel in Mexican Border State","label":-1},{"text":"Exit Poll: Donald Trump Spiked His Votes Among Married Women in 2020","label":0},{"text":"Turkish Ultranationalist Grey Wolves Protest in Malm After Being Banned in France","label":-1},{"text":"Trump Rewrites H-1B Program to Help American White-Collar Workers","label":1},{"text":"US white male professor allegedly poses as Black immigrant woman","label":0},{"text":"‘Stop stigmatising us’, French Muslims tell Macron","label":-1},{"text":"Race to watch: Iranian-American activist faces Texas conservative","label":0},{"text":"Greek court to decide fate of fascist Golden Dawn group","label":-1},{"text":"US seeks sweeping DNA collection of immigrants, sponsors","label":0},{"text":"Italy softens harsh migration rules championed by Salvini","label":-1},{"text":"US court rejects Trump plan to leave many immigrants off census","label":-1},{"text":"German far-right figure ‘caught’ saying migrants could be gassed","label":-1},{"text":"Guatemala promises to break up migrant caravan heading to US","label":0},{"text":"Italian PM Conte to testify in Salvini refugee abuse case","label":-1},{"text":"Ruth Bader Ginsburg: A life in pursuit of gender equality","label":1},{"text":"Migrant caravan sets out for the US amid COVID-19 concerns","label":-1},{"text":"'There will be blood': Xenophobia in S Africa routine and lethal","label":-1},{"text":"Canada: Murder raises fresh concerns about far-right violence","label":-1},{"text":"Greece braces for historic verdict on far-right Golden Dawn group","label":-1},{"text":"More migrant women in US detention say they didn't OK surgery: AP","label":-1},{"text":"Pandemic exacerbates barriers to voting for homeless Americans","label":-1},{"text":"Why does American travel writing erase Black people?","label":-1},{"text":"Antifa and America’s revamped Red Scare","label":-1},{"text":"Traditionally Republican Arizona now a Trump-Biden battleground","label":0},{"text":"Siah Armajani (1939-2020): An artist of public happiness","label":1},{"text":"Trump and Biden take sharply different paths on immigration","label":0},{"text":"Court rules Trump can end temporary legal status for four nations","label":0},{"text":"Facebook bans ads that seek to delegitimise US elections","label":-1},{"text":"Supreme Court fight could elevate Kamala Harris's profile","label":1},{"text":"Ruth Bader Ginsburg's legacy of empathy and courage","label":1},{"text":"China locks down city on Myanmar border over coronavirus","label":-1},{"text":"Seagram liquor heiress jailed for role in US sex-trafficking ring","label":-1},{"text":"Red Cross warns of COVID-19 fuelling discrimination in Asia","label":-1},{"text":"UN warns of 'further war crimes' against Rohingya in Myanmar","label":-1},{"text":"Melania Trump secret recordings: ‘I’m driving the liberals crazy’","label":-1},{"text":"Trump, struggling to define Biden, steps up Harris attacks","label":-1},{"text":"US House delays vote on bill to avert a government shutdown","label":-1},{"text":"Sinophobia, the new Islamophobia","label":-1},{"text":"The Hong Kong people left out of the UK’s safe haven offer","label":-1},{"text":"Islamophobia in the US presidential election","label":-1},{"text":"Trump sets refugee cap at record low: US election live updates","label":0},{"text":"US watchdog to investigate ICE unwanted hysterectomies claims","label":-1},{"text":"Switzerland votes on curbing immigration from EU nations","label":0},{"text":"‘Alarming’: Experts slam UK plan for offshore asylum centre","label":-1},{"text":"Mexico deploys army on southern border to block migrant caravan","label":-1},{"text":"In Pictures: Guatemala toughens stance on migrant caravan","label":-1},{"text":"Trump set to miss required deadline for 2021 refugee quota","label":-1},{"text":"Trump admin races to raise H-1B visa hurdles for skilled workers - Aljazeera.com","label":-1},{"text":"‘There is no work’: Hondurans brave risks in US-bound caravan","label":-1},{"text":"Rights groups blast Greece for asylum violations","label":-1},{"text":"Italy's left defeats far-right bid to take stronghold Tuscany","label":0},{"text":"Philippines deports US Marine who killed transgender woman","label":-1},{"text":"Algeria expelling thousands of migrants across Niger border: HRW","label":-1},{"text":"American Voter: Torri Loffreda-Weston","label":0},{"text":"Divided Europe seeks to overhaul defunct migration policies","label":-1},{"text":"Trump to limit 2021 US refugee admissions to 15,000, a record low","label":0},{"text":"Suspect wrote ‘give up’ on ricin White House letter: Court papers","label":0},{"text":"Sabah election: Polls open in key test for Malaysia’s Muhyiddin","label":0},{"text":"US to slash H1-B visas for skilled workers by a third","label":-1},{"text":"American Voter: Sophia Madana","label":0},{"text":"Analysis: Why Trump's best news of the week may not pay off","label":1},{"text":"'Anti-Palestinian racism': Appointment row at Toronto university","label":-1},{"text":"The ashes of Moria refugee camp could poison European politics","label":-1},{"text":"Hong Kong legislators protest against China’s arrest of activists","label":-1},{"text":"Analysis: US election 'October surprise' comes early","label":1},{"text":"Doctor says Trump is free of COVID-19-symptoms and fever","label":1},{"text":"Why electoral reform matters: Lessons for the US, from Kenya","label":1},{"text":"The Greek anti-fascist struggle is far from over","label":-1},{"text":"Secret and unprofitable Palantir goes public","label":-1},{"text":"Jamal Khashoggi, the human","label":0},{"text":"Trump aims for an upset over Biden in Minnesota","label":-1},{"text":"Humour, resignation, despair: Living with inflation in Iran","label":-1},{"text":"US election live updates: Biden to lay out pandemic response plan","label":0},{"text":"Key US Senate races put Republican majority control at risk","label":-1},{"text":"Trump aims for Michigan victory over Biden, seeking another upset","label":-1},{"text":"Advocates condemn Trump's 'tragically low' planned US refugee cap","label":-1},{"text":"Gallup poll says world becoming less tolerant of migrants","label":-1},{"text":"‘Brawl’ at migrant camp in Bosnia kills two, injures 18","label":-1},{"text":"Three dead, 53 rescued after migrant boat sinks off Crete","label":-1},{"text":"Greek police accuse aid workers of supporting migrant smugglers","label":-1},{"text":"Refugees in Greece wary of entering new camp after Moria fire","label":-1},{"text":"Ethiopian migrants held in Saudi Arabia call it ‘hellish’","label":-1},{"text":"Sweden: Far-right activists burn copy of Quran, plan more stunts","label":-1},{"text":"EU: Greece-Turkey crisis talks might include other nations","label":-1},{"text":"Two dozen migrants feared drowned off Libya's coast","label":-1},{"text":"US bans palm oil imports from Malaysian producer FGV","label":0},{"text":"Economy, border row on agenda as India's parliament reopens","label":0},{"text":"India reports six million COVID-19 cases: Live news","label":0},{"text":"India sees 100,000 COVID-19 deaths: What happened and what now?","label":0},{"text":"How a high school dropout forced Nepal gov't to act on pandemic","label":-1},{"text":"Italy’s Salvini goes on trial, accused of ‘kidnapping’ refugees","label":-1},{"text":"Refugees accuse Greece of pushing them back out to sea","label":-1},{"text":"Nagorno-Karabakh: Historical grievances with dangerous potential","label":-1},{"text":"Science vs humanities in Australia’s university fee shake-up","label":0},{"text":"How a Greek reporter could help put neo-Nazis behind bars","label":1},{"text":"How a Bollywood star’s death case took a ‘misogynistic spiral’","label":-1},{"text":"Greece reports first COVID-19 refugee death since pandemic began","label":-1},{"text":"Cyprus accuses Turkey of expanding 'illegal drilling' in East Med","label":-1},{"text":"Thousands of refugees sleep rough, without food, after Moria fire","label":-1},{"text":"Amnesty urges EU to rethink Libya cooperation over refugee abuse","label":-1},{"text":"Eight migrants drown after forced off boat by smugglers","label":-1},{"text":"Guatemala sends back some 3,500 migrants amid COVID-19 concerns","label":-1},{"text":"At least 16 migrants feared dead in shipwreck off Libya: IOM","label":-1},{"text":"Europe scrambles to address fate of Greek camp residents","label":-1},{"text":"Pope Francis: COVID-19 crisis a chance to ‘come out better’","label":1},{"text":"Thousands protest after Moria refugee camp burns down","label":-1},{"text":"Greece: Police move refugees to new Lesbos camp after Moria fire","label":-1},{"text":"After France refused rescue ship to dock, refugees reach Sardinia","label":-1},{"text":"Global coronavirus cases pass 30 million: Live news","label":0},{"text":"After Moria fire, 'I don't have hope for myself or my baby'","label":-1},{"text":"After Moria fire, refugees decry conditions in new camp on Lesbos","label":-1},{"text":"‘I just want my husband’s remains to be returned to us’","label":0},{"text":"Integrity of Myanmar polls questioned amid conflict, pandemic","label":-1},{"text":"‘Historic verdict’: Celebrations as Greece convicts Golden Dawn","label":1},{"text":"Greek police fire tear gas as refugees demand to leave Lesbos","label":-1},{"text":"Rohingya living in ‘open prison’ in Myanmar: Human Rights Watch","label":-1},{"text":"Formidable challenges await as Suga set to take over as Japan PM","label":-1},{"text":"Will Putin and the ghost of the USSR save Lukashenko's Belarus?","label":0},{"text":"After fire destroyed Greek camp, refugees seek European support","label":-1},{"text":"A European odyssey: A portrait of Europe during the pandemic","label":0},{"text":"Does anyone care about the Moria refugees?","label":0},{"text":"German police found sharing racist messages in group chats","label":-1},{"text":"Refugee journalists in Lesbos tell their own stories","label":0},{"text":"UN moves to contain coronavirus in Syrian refugee camps: Live","label":0},{"text":"Lead poisoning fears at Greek refugee camp built on military site","label":-1},{"text":"Several killed in ‘gang war’ at Rohingya camps in Bangladesh","label":-1},{"text":"The little talked about side-effects of COVID-19","label":-1},{"text":"Rohingya accuse Bangladesh officers of abuse over hunger strike","label":-1},{"text":"Syria chemical attacks: Case filed in German court names al-Assad","label":-1},{"text":"Myanmar army probes 'wider patterns' of abuse against Rohingya","label":-1},{"text":"When will the world stop ignoring what is happening in Gaza?","label":-1},{"text":"Abbas: Israel normalisation ‘violation of just and lasting’ peace","label":-1},{"text":"The British coastal communities doomed to become climate refugees","label":-1},{"text":"Repression of speech and scholarship on Palestine needs to end","label":-1},{"text":"Humanity needs democratic representation","label":0},{"text":"Far-right combat sports: A dangerous training ground for violence","label":-1},{"text":"Why environmental justice is an anti-colonial struggle","label":1},{"text":"Fighting for Palestine","label":-1},{"text":"A Place of Refuge: Malmo and Nickelsdorf","label":1},{"text":"After Moria tragedy, few answers for refugees abandoned on roads","label":-1},{"text":"Palestinian leadership to reconsider relations with Arab League","label":0},{"text":"Facebook does not profit from hate speech, says India chief","label":-1},{"text":"Palestine quits Arab League role in protest over Israel deals","label":-1},{"text":"Jordan’s King Abdullah accepts prime minister’s resignation","label":0},{"text":"Delhi summons top Facebook India official in hate speech probe","label":-1},{"text":"Rouhani: UAE, Bahrain will bear 'consequences' of Israel deals","label":-1},{"text":"Palestinian Intifada: How Israel orchestrated a bloody takeover","label":-1},{"text":"The Palestinians need an alternative vision","label":1},{"text":"At UN, Qatar emir questions world inaction on Israeli occupation","label":-1},{"text":"Attackers kill 25 displaced civilians in Burkina Faso, UN says","label":-1},{"text":"Nagorno-Karabakh: Information war and competing media narratives","label":-1},{"text":"Al Jazeera condemns AJ+ FARA registration order in US","label":-1},{"text":"Sudan to strike peace with rebels after decades of war","label":-1},{"text":"Qatar rules out normalising relations with Israel","label":0},{"text":"Facebook bias spurs violence in India, US rights groups say","label":-1},{"text":"‘I was chained for 11 months’: Living with depression in Liberia","label":-1},{"text":"Israel bombs Gaza after rocket fire as UAE, Bahrain signed deals","label":-1},{"text":"Paul Rusesabagina admits backing rebels, denies violence","label":-1},{"text":"EU prepares for standoff over Turkish sanctions","label":-1},{"text":"Palestinians rally against Bahrain-Israel normalisation","label":-1},{"text":"Trump’s Kosovo-Serbia normalisation deal is all about Israel","label":0},{"text":"What is behind Bahrain's normalisation deal with Israel?","label":0},{"text":"Explainer: Where do Arab states stand on normalising Israel ties?","label":0},{"text":"Is the climate crisis creating a mental health crisis?","label":-1},{"text":"Rohingya crisis: Relocation plan meets opposition","label":-1},{"text":"How does immigrant food shape identity?","label":0},{"text":"Greek neo-Nazi chief sentenced to 13 years in prison","label":-1},{"text":"Guatemala to verify report on US agents ‘unauthorised’ operation","label":-1},{"text":"Changing population turns Georgia into Trump-Biden battleground","label":0},{"text":"Muslim American votes may carry outsize weight in US election","label":0},{"text":"Far-right EU lawmaker in Greek court for Golden Dawn trial","label":0},{"text":"Greek court considers 15-year sentences for Golden Dawn leaders","label":-1},{"text":"This is what it is like to travel as a stateless person","label":0},{"text":"Joe Biden’s America is a dangerous myth","label":-1},{"text":"Eleven dead after boat carrying refugees sinks off Tunisia","label":-1},{"text":"American Voter: Benjamin Rodgers","label":0},{"text":"Beirut’s migrant workers persist in the shadow of the blast","label":-1},{"text":"Many reported dead in Thailand bus-train collision","label":-1},{"text":"India sees fewest new coronavirus cases in nearly two months","label":0},{"text":"Melania Trump book author accused of breaking nondisclosure pact","label":-1},{"text":"Where are they now? The graduates of India’s Door Step School","label":0},{"text":"Tajikistan president on course to win re-election: Early results","label":1},{"text":"Do not close Pikpa down, replicate it","label":0},{"text":"Jordan king swears in new gov’t headed by PM Bisher al-Khaswaneh","label":0},{"text":"Thousands flee amid fighting between Taliban and Afghan forces","label":-1},{"text":"Canada aims to bring in over 1.2 million immigrants over 3 years","label":0},{"text":"US rights group lawsuit seeks COVID-19 records for ICE detention","label":-1},{"text":"Canada announces new pathway to residency for Hong Kong youth","label":0},{"text":"Status Pending: On the front lines of immigration law in the US","label":-1},{"text":"Pope Francis congratulates Joe Biden on election win","label":1},{"text":"US Supreme Court to hear two cases on Trump immigration policy","label":0},{"text":"American Voter: Mary Shiraef","label":0},{"text":"Macron calls for tighter EU border controls after attacks","label":-1},{"text":"Philippines: About 3,000 Chinese expelled in $830m ‘visa scam’","label":-1},{"text":"S Korea accepts just 164 of nearly 6,000 asylum seekers","label":0},{"text":"Will Biden bring meaningful change to US policy on Latin America?","label":1},{"text":"Asylum seekers in limbo look to US election with hope and fear","label":-1},{"text":"Biden victory sparks massive celebration in US capital","label":1},{"text":"After Trump gains, Latino groups say Dems need economic populism","label":0},{"text":"US House race to watch: Darrell Issa vs Ammar Campa-Najjar","label":0},{"text":"Iranian American Sima Ladjevardian loses congressional race","label":0},{"text":"France’s PM vows to fight ‘relentlessly’ against ‘radical Islam’","label":-1},{"text":"South Africa issues arrest warrant for fugitive Malawi ‘prophet’","label":-1},{"text":"Pennsylvania is crucial to victory for both Trump and Biden","label":0},{"text":"Italy may deploy ships, planes to give Tunisia migrant boat alert","label":0},{"text":"France: Gerald Darmanin to discuss security with Tunisia, Algeria","label":0},{"text":"Muslim and Arab Americans aim to grow their ranks in US House","label":0},{"text":"American Voter: Spencer Lindquist","label":0},{"text":"Trump or Biden? Mexico eyes who could boost struggling economy","label":-1},{"text":"Turkey praises ‘two heroes’ who helped victims in Vienna attack","label":1},{"text":"Thousands gather to hear Biden give victory speech in Wilmington","label":1},{"text":"US House race to watch: Ilhan Omar vs Lacy Johnson","label":0},{"text":"Germany does not believe Thai king breached state business ban","label":-1},{"text":"American Voter: Louis Murray","label":0},{"text":"US elections: What’s at stake for India’s economy?","label":-1},{"text":"US House elections: Competitive races unlikely to flip majority","label":0},{"text":"‘We have to keep fighting’: Asylum seekers at US-Mexico border","label":-1},{"text":"Lost and found: Stories from Matamoros camp on US-Mexico border","label":-1},{"text":"American Voter: Lee Pulliam","label":0},{"text":"As a Republican transgender voter, here is what I will vote for","label":0},{"text":"Why are Vietnamese Americans so divided over Trump?","label":-1},{"text":"21 million Americans have voted early: US election live updates","label":0},{"text":"Erdogan files complaint against Dutch far-right politician","label":-1},{"text":"‘Like Obama’: What Biden’s presidency could mean for human rights","label":0},{"text":"Pence votes, Biden and Trump campaign: US elections live news","label":0},{"text":"COVID-19 top issue for US voters as pandemic rages, survey says","label":-1},{"text":"American Voter: Christi Nichols","label":0},{"text":"Surge in Latino support for Trump helps him win Florida","label":1},{"text":"French far-right activist on trial after Al Jazeera investigation","label":-1},{"text":"What it’s like to be an American abroad during the election","label":0},{"text":"What does the US election mean for Europe?","label":0},{"text":"American Voter: Arjun Rondla","label":0},{"text":"What to listen for during Trump’s stump speeches","label":0},{"text":"Amid COVID-19, Portugal’s ethnic minorities feel heavily policed","label":-1},{"text":"If (only) Amy Coney Barrett was a Muslim","label":0},{"text":"American Voter: Quardricos Driskell","label":0},{"text":"Refugees cling to hope of resettlement, even as world slams doors","label":1},{"text":"US Elections: How Biden flipped battleground Pennsylvania","label":0},{"text":"Puerto Rico cannot vote but could be important in US election","label":1},{"text":"Why is Bangladesh protesting against France?","label":-1},{"text":"US Senate races to watch","label":0},{"text":"Joe Biden's long political career features several policy shifts","label":0},{"text":"At last, a somewhat civil debate between Trump and Biden","label":1},{"text":"Trump's biggest campaign promises: Did he deliver?","label":0},{"text":"Tigray conflict: Ethiopian refugees, soldiers cross into Sudan","label":0},{"text":"Baby, six months, dies hours after being saved from Mediterranean","label":-1},{"text":"‘Little Amal’: A giant puppet with a powerful refugee message","label":1},{"text":"Refugee crisis brews on Canary Islands with record arrivals","label":-1},{"text":"Tigray: UN fears refugee emergency, warns of aid being blocked","label":-1},{"text":"‘Moria 2.0’: Groups slam conditions at replacement refugee camp","label":-1},{"text":"A Refugee’s Tale","label":0},{"text":"Refugees allege physical, sexual abuse by Croatian authorities","label":-1},{"text":"Iraq’s decision to shut down IDP camps too hasty, NGOs say","label":-1},{"text":"Nigeria IDP camp fire displaces thousands of residents","label":-1},{"text":"UK gives $63m for Rohingya refugees ahead of UN donor meeting","label":0},{"text":"International donors pledge nearly $600m to support Rohingya","label":1},{"text":"‘No one bothered’: Afghan mother waits for son held in Guantanamo","label":-1},{"text":"EU to launch inquiry into complicity in Croatia border violence","label":-1},{"text":"Banksy painting expected to fetch more than $6m at UK auction","label":0},{"text":"EU border agency ‘involved in illegal pushbacks’ of migrant boats","label":-1},{"text":"Ivory Coast opposition leader arrested for rival government","label":-1},{"text":"‘Not safe to go back’: Sudanese in Israel fear deportation","label":-1},{"text":"Myanmar’s Rohingya crisis exposes ASEAN weaknesses: Report","label":-1},{"text":"Syria’s president says US pressure obstructing return of refugees","label":-1},{"text":"Ivory Coast: Ex-rebel leader asks army to mutiny, join opposition","label":-1},{"text":"Alarm grows as Ethiopian civil war becomes internationalised","label":-1},{"text":"Ethiopians fleeing Tigray war recount horrors as fighting rages","label":-1},{"text":"Rakhine armed group seized Myanmar governing party candidates","label":-1},{"text":"Malaysia’s Mahathir: Post on French killings taken out of context","label":-1},{"text":"‘We don’t matter’: Rohingya deprived of vote in Myanmar elections","label":-1},{"text":"Jordan’s elections explained in 500 words","label":0},{"text":"At least 74 migrants dead in ‘devastating’ shipwreck off Libya","label":-1},{"text":"Ouattara meets Bedie for talks on Ivory Coast election crisis","label":-1},{"text":"In Pictures: Schools shut and pregnancies rise in COVID-hit Kenya","label":-1},{"text":"Ethiopia PM claims major advance in Tigray region","label":0},{"text":"Gaza children struggle with studies during COVID-19 lockdown","label":-1},{"text":"Voting underway in Myanmar’s general election","label":0},{"text":"Ivory Coast: Security forces surround homes of opposition leaders","label":-1},{"text":"Clashes over Ivory Coast vote as neighbouring states urge talks","label":-1},{"text":"Learning to learn during a pandemic","label":0},{"text":"Jordan to elect new parliament amid deepening economic crisis","label":-1},{"text":"Ethiopia says Tigray forces fired into neighbouring region","label":-1},{"text":"Ethiopia bombs Tigray capital as it rejects mediation calls","label":-1},{"text":"The French state refuses to see reality","label":-1},{"text":"Emery Mwazulu Diyabanza: ‘France is still a colonial country’","label":-1},{"text":"Remembering Robert Fisk: A mentor","label":1},{"text":"Joe Biden ‘no saviour’ of the Palestinians","label":-1},{"text":"Ilhan Omar wins re-election to US House of Representatives","label":0},{"text":"Rohingya refugees are being ignored","label":-1},{"text":"Ethiopian refugees flee ‘massacre’ in Tigray","label":-1},{"text":"In Pictures: Ethiopians flee war across a river into Sudan","label":-1},{"text":"Jeremy Corbyn: ‘Rohingya refugees are being ignored’ | #AJOpinion","label":-1},{"text":"War crimes feared in Ethiopia’s Tigray, Amnesty reports massacre","label":-1},{"text":"Putin says Syrian refugees should return, rebuild country","label":0},{"text":"UN agency for Palestinians to slash salaries as funds run dry","label":-1},{"text":"Ethiopia appoints new Tigray leader, Amnesty reports ‘massacre’","label":-1},{"text":"At least 5 people die in latest shipwreck off Libya","label":-1},{"text":"Syria’s veteran foreign minister Walid al-Moalem dies","label":0},{"text":"Middle East: IMF warns of social unrest risk in ‘fragile’ states","label":-1},{"text":"DR Congo army says Burundi rebels forced from strongholds","label":-1},{"text":"Athens finally gets a mosque","label":0},{"text":"Sudan braces for up to 200,000 fleeing Ethiopia fighting","label":-1},{"text":"Ethiopia’s Tigray blocks general’s appointment in blow to Abiy","label":-1},{"text":"Jordan holds parliamentary elections amid coronavirus surge","label":0},{"text":"Erdogan warns of military action in Syria, decries Russian strike","label":-1},{"text":"Is the Nagorno-Karabakh war really over?","label":-1},{"text":"Italy: Interior minister rejects accusations over Nice killing","label":-1},{"text":"Armenia foreign minister quits as gov’t under fire over ceasefire","label":-1},{"text":"Nagorno-Karabakh: Five things to know about the latest crisis","label":-1},{"text":"Lebanon, Israel hold second round of maritime demarcation talks","label":0},{"text":"Muslim world condemns Macron, France over treatment of Islam","label":-1},{"text":"Int’l community must protect, preserve mass graves: Callamard","label":-1},{"text":"What would a Joe Biden presidency mean for Venezuela?","label":0},{"text":"Will Biden’s presidency be a ‘blessing’ for war-torn Ukraine?","label":0},{"text":"A postmortem of a colonial election","label":0},{"text":"Civilians reel as violence spins out of control in Mozambique","label":-1},{"text":"What is behind the Nagorno-Karabakh flare-up?","label":-1},{"text":"Slovakia becomes latest European country to hit the far right","label":0},{"text":"American Voter: Youssef Osman","label":0},{"text":"Azerbaijanis forced to flee in the 1990s hope to return home","label":-1},{"text":"Surviving torture in a Syrian prison made me who I am today","label":-1},{"text":"‘Islam’ is not in crisis, liberalism is","label":-1},{"text":"An American lynching: ‘I could hear their screams’","label":-1},{"text":"Facebook's India policy chief quits after hate speech allegations","label":-1},{"text":"Sustainable peace cannot be achieved without women","label":1},{"text":"Virus on the Poultry Line","label":0},{"text":"‘They don’t accept you’: Afro-Greeks struggle to be seen","label":-1},{"text":"Parents of 545 children separated at US border still not found","label":0}]